README.org
#+BEGIN_COMMENT
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-bigblow.setup
#+END_COMMENT
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+BEGIN_COMMENT
#+OPTIONS: html-style:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-style.css" />
#+END_COMMENT
#+OPTIONS: d:t  prop:t tags:t |:t
#+OPTIONS: H:7 num:4 toc:t ^:nil p:nil html-style:nil pri:t
#+EXCLUDE_TAGS: no_export
#+EXPORT_FILE_NAME: public/fullstack.html
#+STARTUP:  overview entitiespretty
#+TODO:  TODO WIP | COMPETE OBSOLETE
#+CREATOR: org-mode
#+LANGUAGE: en
#+TITLE: full-stack
#+AUTHOR: Richard Bouska


#+BEGIN_SRC emacs-lisp :exports none :results verbatim
(org-html-export-to-html nil t nil nil)
 #+END_SRC
#+BEGIN_CENTER
*What is considered a full-stack - Richard's point of view*
 #+END_CENTER
