public/fullstack.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-26 Sat 15:09 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>full-stack</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Richard Bouska" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">full-stack</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#SOFTWARE_ENGINEERING">1. <span class="todo WIP">WIP</span> Software Engineering&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org2456bf1">1.1. bit / byte / endian / float</a>
<ul>
<li><a href="#org83621fd">1.1.1. XOR, OR, AND, Shift (logical vs aritmetic)</a></li>
<li><a href="#org3ab99cd">1.1.2. one`s complement</a></li>
<li><a href="#org7581d6a">1.1.3. two`s complements</a></li>
<li><a href="#org1e0b885">1.1.4. ieee754 explain float: mantisa,exponent</a></li>
<li><a href="#orgd870c98">1.1.5. Endian</a></li>
</ul>
</li>
<li><a href="#orgdfd25c7">1.2. TCP/IP</a>
<ul>
<li><a href="#orge9107ca">1.2.1. IP address / netmask</a></li>
<li><a href="#org8230dc2">1.2.2. CIDR</a></li>
</ul>
</li>
<li><a href="#org8ecedca">1.3. I18N</a>
<ul>
<li><a href="#org809fd1c">1.3.1. iso-639</a></li>
<li><a href="#org6536a05">1.3.2. bcp-47 / rfc-5646</a></li>
</ul>
</li>
<li><a href="#orgaa4cd8f">1.4. Unicode</a>
<ul>
<li><a href="#orgac536f0">1.4.1. What is unicode</a></li>
<li><a href="#orgc1f7809">1.4.2. utf-8</a></li>
<li><a href="#orgc7b5834">1.4.3. ASCII</a></li>
<li><a href="#orgc28f6f4">1.4.4. EBCDIC</a></li>
</ul>
</li>
<li><a href="#org4b67cef">1.5. Formats</a>
<ul>
<li><a href="#org5767111">1.5.1. yaml</a></li>
<li><a href="#orgb972163">1.5.2. json</a></li>
<li><a href="#org15ec7b6">1.5.3. xml</a></li>
</ul>
</li>
<li><a href="#orgbdece4f">1.6. declarative vs imperative</a></li>
<li><a href="#org9ec1ce7">1.7. <span class="priority">[B]</span> Code complexity</a>
<ul>
<li><a href="#org42c674b">1.7.1. Code complexity (big O)</a></li>
<li><a href="#org765b9cc">1.7.2. Amortized complexity</a></li>
</ul>
</li>
<li><a href="#orgfb967e0">1.8. TCP/IP</a>
<ul>
<li><a href="#org9c85191">1.8.1. IP address / netmask</a></li>
<li><a href="#org65c830f">1.8.2. CIDR</a></li>
</ul>
</li>
<li><a href="#org1862b75">1.9. basic data structures</a>
<ul>
<li><a href="#org1a7baf1">1.9.1. tree</a></li>
<li><a href="#org713bb07">1.9.2. list</a></li>
<li><a href="#orga40b5ce">1.9.3. hash</a></li>
</ul>
</li>
<li><a href="#orgc52cf85">1.10. basic algorithms</a>
<ul>
<li><a href="#org26928e8">1.10.1. Stable vs unstable sorting</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#ARCHITECTURE">2. <span class="todo WIP">WIP</span> Architecture&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org17e2f4a">2.1. <span class="todo WIP">WIP</span> DDD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org5927b16">2.1.1. bounded context&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org3f9ebc3">2.1.2. ubiquotous language&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgb5a809c">2.1.3. Entity and Value Object&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#org32b7d19">2.2. <span class="todo WIP">WIP</span> Messaging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgf9df493">2.2.1. queue</a></li>
<li><a href="#org47ae210">2.2.2. topics</a></li>
<li><a href="#org1e3f90b">2.2.3. message delivery mode:</a></li>
<li><a href="#org8909033">2.2.4. tools</a>
<ul>
<li><a href="#orgd83394a">2.2.4.1. <span class="todo TODO">TODO</span> Solace Pub/Sub Plus</a></li>
<li><a href="#orged6ce7e">2.2.4.2. <span class="todo TODO">TODO</span> Google PubSub</a></li>
<li><a href="#org50eabd5">2.2.4.3. <span class="todo TODO">TODO</span> AWS SNS</a></li>
<li><a href="#org3df14cd">2.2.4.4. <span class="todo TODO">TODO</span> AWS SES</a></li>
<li><a href="#org9864e90">2.2.4.5. <span class="todo TODO">TODO</span> AWS SQS</a></li>
<li><a href="#org02044f1">2.2.4.6. <span class="todo TODO">TODO</span> AWS Kinesis</a></li>
<li><a href="#orge51869e">2.2.4.7. <span class="todo TODO">TODO</span> RabbbitMQ</a></li>
<li><a href="#orgadc8b00">2.2.4.8. <span class="todo TODO">TODO</span> Kafka</a></li>
</ul>
</li>
<li><a href="#org0772145">2.2.5. protocols</a>
<ul>
<li><a href="#org4a6da81">2.2.5.1. <span class="todo TODO">TODO</span> amqp(s)</a></li>
<li><a href="#orgbc6fcd2">2.2.5.2. <span class="todo TODO">TODO</span> mqtt(s)</a></li>
<li><a href="#org7378c8f">2.2.5.3. <span class="todo TODO">TODO</span> http(s)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc1b46dc">2.3. <span class="todo WIP">WIP</span> HTTP Family&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org4e618de">2.3.1. HTTP</a>
<ul>
<li><a href="#org485843b">2.3.1.1. What is the use of Accept and Content-Type Headers in HTTP Request?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org3dc2426">2.3.1.2. <span class="todo WIP">WIP</span> What is Server-Sent Events  (SSE)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgf05ee1c">2.3.1.3. <span class="todo WIP">WIP</span> What are WebSockets&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc72a390">2.4. <span class="todo WIP">WIP</span> REST</a>
<ul>
<li><a href="#orgac95ca3">2.4.1. What are the HTTP methods supported by REST?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org20a7e8e">2.4.2. What is the purpose of HTTP Status Code?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org75478e4">2.4.3. What is statelessness in RESTful Webservices?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgf4610ce">2.4.4. What is the difference between PUT and POST?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org77ce5f3">2.4.5. <span class="todo TODO">TODO</span> HATEOAS</a></li>
</ul>
</li>
<li><a href="#org52dd963">2.5. <span class="todo TODO">TODO</span> GraphQL</a></li>
<li><a href="#org540b12c">2.6. <span class="todo TODO">TODO</span> 12 Factor Apps</a></li>
<li><a href="#org36e7055">2.7. <span class="todo TODO">TODO</span> 3Factor Apps</a></li>
<li><a href="#org8df916e">2.8. <span class="todo WIP">WIP</span> OpenApiSpec / Open API 3.0 / Swagger</a>
<ul>
<li><a href="#orga5f3ee2">2.8.1. What Is OpenAPI?</a></li>
</ul>
</li>
<li><a href="#orgbd465bc">2.9. <span class="todo WIP">WIP</span> micro-service-architecture</a></li>
<li><a href="#org84eb218">2.10. <span class="todo WIP">WIP</span> Enterprise Architecture Integration Patterns</a>
<ul>
<li><a href="#orgfbf14df">2.10.1. orchestration</a></li>
<li><a href="#org9e116bd">2.10.2. choreography</a></li>
</ul>
</li>
<li><a href="#org9b22e55">2.11. <span class="todo TODO">TODO</span> Event Sourcing</a></li>
<li><a href="#org81756e3">2.12. <span class="todo TODO">TODO</span> CQRS</a></li>
<li><a href="#orgef73d14">2.13. <span class="todo TODO">TODO</span> CRUD</a></li>
<li><a href="#org5a622a4">2.14. <span class="todo WIP">WIP</span> Pragmatic Design principes</a>
<ul>
<li><a href="#org5344665">2.14.1. DRY&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org8e37c19">2.14.2. KISS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org47597b9">2.14.3. YAGNI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgc52e4c8">2.14.4. SOLID</a></li>
<li><a href="#org9088c26">2.14.5. open-close principal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org74dc5e5">2.14.6. High cohesion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org657b1a3">2.14.7. Low coupling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgeab7e54">2.14.7.1. What is temporal coupling?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org74a25b5">2.15. <span class="todo TODO">TODO</span> Antifragile architecture</a></li>
<li><a href="#orgcca380b">2.16. <span class="todo WIP">WIP</span> Evolutionary database design</a></li>
</ul>
</li>
<li><a href="#DATA">3. <span class="todo WIP">WIP</span> Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org628d1d6">3.1. <span class="todo WIP">WIP</span> background&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org59d0f57">3.1.1. What does ACID mean?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org921e552">3.1.2. <span class="todo WIP">WIP</span> BASE</a>
<ul>
<li><a href="#orgd026896">3.1.2.1. what does it mean?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orgf395ab7">3.1.3. ORM</a>
<ul>
<li><a href="#orgba5679b">3.1.3.1. What ORM (object-relational-mapping ) means&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org99be721">3.1.3.2. What is object relation impedance mismatch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orge1c7218">3.1.3.3. bottom up&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org255cbd9">3.1.3.4. tom down&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgc613fd2">3.1.3.5. meet in the middle&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orgda58aaa">3.1.4. CAP theorem</a>
<ul>
<li><a href="#orgd06a3de">3.1.4.1. Beyond CAP database systems</a></li>
</ul>
</li>
<li><a href="#org8dfada8">3.1.5. Wall: Write Ahead Logs</a>
<ul>
<li><a href="#orgb79ff4c">3.1.5.1. what it is good for</a></li>
</ul>
</li>
<li><a href="#orged76fed">3.1.6. eventual consistency</a></li>
<li><a href="#org3732033">3.1.7. Multi master replication</a></li>
<li><a href="#org8872360">3.1.8. OLAP</a></li>
<li><a href="#org4b10881">3.1.9. OLTP</a></li>
<li><a href="#org90d17e3">3.1.10. Slowly Moving Dimensions</a>
<ul>
<li><a href="#orge1cb8d0">3.1.10.1. What is it?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgc71b747">3.1.10.2. Type 0 - The passive method.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org7668d81">3.1.10.3. Type 1 - Overwriting the old value.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org85cd09f">3.1.10.4. Type 2 - Creating a new additional record.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org7364868">3.1.10.5. Type 3 - Adding a new column.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org2e10c3a">3.1.10.6. Type 4 - Using historical table.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgd55e672">3.1.10.7. Type 6 - Combine approaches of types 1,2,3 (1+2+3=6).&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orgc270fc4">3.1.11. Backup strategy</a>
<ul>
<li><a href="#orgd3dc6e0">3.1.11.1. full vs incremental backup</a></li>
<li><a href="#org51f106e">3.1.11.2. snapshots</a></li>
<li><a href="#org0ac6071">3.1.11.3. on-line replica</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb63c01d">3.2. <span class="todo WIP">WIP</span> SQL</a>
<ul>
<li><a href="#orgf4cb08c">3.2.1. partitionning</a></li>
<li><a href="#orgf42c917">3.2.2. inner vs outher join</a></li>
<li><a href="#org231732d">3.2.3. DB Index</a></li>
<li><a href="#org71625c8">3.2.4. Constraint</a></li>
<li><a href="#org7c60b54">3.2.5. Agregace (group by)</a></li>
<li><a href="#org02cfdb9">3.2.6. Co jsou window funkce?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org1f501c6">3.2.7. what is a defference between CTE and temp table?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org0ade0f2">3.2.8. CTE (with)</a></li>
<li><a href="#orgba1d869">3.2.9. DML/DDL</a></li>
</ul>
</li>
<li><a href="#org7e006d6">3.3. <span class="todo WIP">WIP</span> Distributed consensus:</a>
<ul>
<li><a href="#org302c3b7">3.3.1. Paxos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org1dde2f0">3.3.2. Raft&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orga655291">3.3.3. Zab&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#org4075ec3">3.4. <span class="todo WIP">WIP</span> Transactions</a>
<ul>
<li><a href="#org072461b">3.4.1. transaction problems that are prevented by isolation:</a>
<ul>
<li><a href="#org55259d6">3.4.1.1. What are they and what they mean?</a></li>
</ul>
</li>
<li><a href="#orge0ae0c8">3.4.2. JDBC transaction isolation levels</a>
<ul>
<li><a href="#org2d4d982">3.4.2.1. what are they and what they prevent from?</a></li>
</ul>
</li>
<li><a href="#org9dd5d5a">3.4.3. ANSI/ISO levels -</a>
<ul>
<li><a href="#orgbdb0862">3.4.3.1. what they are</a></li>
<li><a href="#org2c3ddfa">3.4.3.2. define some</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga186ff1">3.5. <span class="todo WIP">WIP</span> Datawarehouse?</a></li>
<li><a href="#orgafc4c99">3.6. <span class="todo WIP">WIP</span> Star schema  structure</a></li>
<li><a href="#org265673b">3.7. <span class="todo WIP">WIP</span> Snowflake schema  structure</a></li>
<li><a href="#org9cec340">3.8. <span class="todo WIP">WIP</span> WAL  / transactional log?</a></li>
<li><a href="#org2e8fba7">3.9. <span class="todo WIP">WIP</span> Tools</a>
<ul>
<li><a href="#org6b0aeb2">3.9.1. PostgreSQL</a>
<ul>
<li><a href="#orgff50610">3.9.1.1. What is the current version of PostgreSQL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5a1303c">3.9.1.2. Explain about Multi version concurrency control?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orge9e7495">3.9.2. ORACLE:</a></li>
<li><a href="#org2394632">3.9.3. Big Table</a></li>
<li><a href="#org202c585">3.9.4. Big Query</a></li>
<li><a href="#org5a0ec25">3.9.5. Elastic Search</a>
<ul>
<li><a href="#orgf9f188b">3.9.5.1. Bloom Filter</a></li>
</ul>
</li>
<li><a href="#org10061cd">3.9.6. MongoDB</a></li>
<li><a href="#orgfad2189">3.9.7. Liquibase</a></li>
<li><a href="#orgef928f5">3.9.8. Apache Drill</a></li>
<li><a href="#org52cd471">3.9.9. Apache Cassandra</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#METHODOLOGY">4. <span class="todo WIP">WIP</span> Methodology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#orgc37ef73">4.1. Scrum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgc60f615">4.2. Kanban&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgdc70b35">4.3. XP&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org6ac8f42">4.4. Lean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org1020c3c">4.5. Jira&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org5fe0e61">4.6. Confluence&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orga62a8d0">4.7. MOSCOW&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org1c8594b">4.8. DoD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgbefa26e">4.9. DoR&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org6f080c4">4.10. Uml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org9fda5ba">4.11. C4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgc2b7b2e">4.12. Org42&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#CLOUD">5. <span class="todo WIP">WIP</span> Cloud&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org86edb01">5.1. <span class="todo TODO">TODO</span> Cloud native architecture</a></li>
<li><a href="#orgc6128cb">5.2. <span class="todo TODO">TODO</span> Open Policy Agent</a></li>
<li><a href="#org2c7c5c3">5.3. <span class="todo TODO">TODO</span> IaaS</a></li>
<li><a href="#org243cb0a">5.4. <span class="todo TODO">TODO</span> PaaS</a></li>
<li><a href="#orgeedad8c">5.5. <span class="todo TODO">TODO</span> SaaS</a></li>
<li><a href="#org579b3d5">5.6. <span class="todo WIP">WIP</span> AWS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org7deb3df">5.6.1. EC2 (Amazon Elastic Compute Cloud)</a>
<ul>
<li><a href="#orgcabb379">5.6.1.1. AMI</a></li>
</ul>
</li>
<li><a href="#orgcf41495">5.6.2. Regions</a></li>
<li><a href="#orgc962156">5.6.3. Availability Zones</a></li>
<li><a href="#org6cdc10f">5.6.4. ELB CLB ALB</a></li>
<li><a href="#org5c2547c">5.6.5. EFS</a></li>
<li><a href="#orgee6b2a0">5.6.6. Route53</a></li>
<li><a href="#org809fc00">5.6.7. Beanstalk</a></li>
<li><a href="#org75677bd">5.6.8. RDS</a></li>
<li><a href="#org3ce50cb">5.6.9. AWS Wavelength</a></li>
</ul>
</li>
<li><a href="#org3d666a7">5.7. GCP Services&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org1bb4c22">5.7.1. <span class="todo TODO">TODO</span> bigquery</a></li>
<li><a href="#org898dd26">5.7.2. <span class="todo TODO">TODO</span> composer</a></li>
<li><a href="#org8ab69b5">5.7.3. <span class="todo TODO">TODO</span> dataflow</a></li>
<li><a href="#org13c1b97">5.7.4. <span class="todo TODO">TODO</span> firestore</a></li>
<li><a href="#orgbcdee4b">5.7.5. <span class="todo TODO">TODO</span> automl</a></li>
<li><a href="#org939f515">5.7.6. <span class="todo TODO">TODO</span> dataproc</a></li>
<li><a href="#org941272f">5.7.7. <span class="todo TODO">TODO</span> secretmanager</a></li>
<li><a href="#orgc624797">5.7.8. <span class="todo TODO">TODO</span> pubsub</a></li>
<li><a href="#orge5e2ca6">5.7.9. <span class="todo TODO">TODO</span> iam</a></li>
<li><a href="#org09f278c">5.7.10. <span class="todo WIP">WIP</span> aim:service accounts</a></li>
</ul>
</li>
<li><a href="#org20a0d3a">5.8. FINOPS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org529048f">5.8.1. GCP Cost Model</a></li>
<li><a href="#org20f2cc1">5.8.2. AWS Cost Model</a></li>
<li><a href="#orgfb4d985">5.8.3. data at rest cost</a></li>
<li><a href="#org42dba4a">5.8.4. transfer cost</a></li>
<li><a href="#orgc3b0cd1">5.8.5. CPU cost</a></li>
</ul>
</li>
<li><a href="#org0edace8">5.9. Storage:</a>
<ul>
<li><a href="#orgff0bc40">5.9.1. AWS S3</a></li>
<li><a href="#org3c53e0d">5.9.2. GCS bucket</a>
<ul>
<li><a href="#org7e9df74">5.9.2.1. api</a></li>
<li><a href="#org513cf7c">5.9.2.2. what it is good for</a></li>
</ul>
</li>
<li><a href="#org670b02f">5.9.3. <span class="todo WIP">WIP</span> MinIO Object Storage</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#DEVOPS">6. <span class="todo WIP">WIP</span> DEVOPS / SRE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org38d060b">6.1. Culture</a>
<ul>
<li><a href="#orge852fbf">6.1.1. <span class="todo TODO">TODO</span> The Three Ways</a>
<ul>
<li><a href="#org139fc6c">6.1.1.1. The First Way: Principles of Flow</a></li>
<li><a href="#org07138f8">6.1.1.2. The Second Way: Principles of Feedback</a></li>
<li><a href="#orgf350bec">6.1.1.3. The Third Way: Principles of Continuous Learning</a></li>
</ul>
</li>
<li><a href="#orgd75e4c4">6.1.2. ACCELERATE</a></li>
<li><a href="#org2bb1527">6.1.3. CALMS (Culture, Automation, Lean, Measurement, Sharing)</a></li>
</ul>
</li>
<li><a href="#org4039459">6.2. Tools</a>
<ul>
<li><a href="#orgd33d65c">6.2.1. DNS</a>
<ul>
<li><a href="#orgc18dcaa">6.2.1.1. What is DNS?</a></li>
<li><a href="#org2e0e9bd">6.2.1.2. What is Nameserver?</a></li>
<li><a href="#org52a5274">6.2.1.3. What is DNS Spoofing?</a></li>
<li><a href="#org03cfcbb">6.2.1.4. How can we prevent DNS Spoofing?</a></li>
<li><a href="#orge8b36f4">6.2.1.5. What is Round Robin DNS? What is the purpose of it?</a></li>
<li><a href="#org6320977">6.2.1.6. What is primary and secondary name server?</a></li>
<li><a href="#org61aa14e">6.2.1.7. What is DNS resolver?</a></li>
<li><a href="#orgec3b96c">6.2.1.8. What is the difference between URL and Domain?</a></li>
<li><a href="#orgcfb6365">6.2.1.9. What is DNS server?</a></li>
<li><a href="#org87d2a6b">6.2.1.10. What are the different types of records in DNS?</a></li>
<li><a href="#orge868b06">6.2.1.11. Explain SOA record?</a></li>
<li><a href="#orgb429633">6.2.1.12. What is the use of PTR in DNS?</a></li>
<li><a href="#org5c47031">6.2.1.13. Explain CNAME record?</a></li>
<li><a href="#org9370c4c">6.2.1.14. Explain Dynamic DNS</a></li>
<li><a href="#org284fc71">6.2.1.15. What is Resource Record?</a></li>
<li><a href="#orgf7df6af">6.2.1.16. What is DNS Zone?</a></li>
<li><a href="#orga470f99">6.2.1.17. Define TTL</a></li>
<li><a href="#org00570cf">6.2.1.18. Explain MX record?</a></li>
<li><a href="#org2545542">6.2.1.19. What is Forward Lookup</a></li>
<li><a href="#org10b303f">6.2.1.20. What is Reverse Lookup</a></li>
<li><a href="#org0918964">6.2.1.21. <span class="todo TODO">TODO</span> What is  DKIM</a></li>
</ul>
</li>
<li><a href="#org04398af">6.2.2. Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org57e4e99">6.2.2.1. What is the use of Staging area or Indexing in Git?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgfd2f396">6.2.2.2. <span class="todo TODO">TODO</span> squash? Waht it is? whan to use it awht it is good for?</a></li>
<li><a href="#orgcda91a9">6.2.2.3. <span class="todo TODO">TODO</span> pull-request</a></li>
<li><a href="#org4fa814e">6.2.2.4. <span class="todo TODO">TODO</span> cherry pick</a></li>
<li><a href="#org01d9981">6.2.2.5. <span class="todo TODO">TODO</span> flow</a></li>
<li><a href="#org162621c">6.2.2.6. <span class="todo TODO">TODO</span> git push</a></li>
<li><a href="#org314b9f4">6.2.2.7. <span class="todo TODO">TODO</span> rebase vs merge - semantical and syntactical diff</a></li>
<li><a href="#orgb6999dd">6.2.2.8. <span class="todo TODO">TODO</span> stash</a></li>
</ul>
</li>
<li><a href="#org43e15a8">6.2.3. Artifactory</a></li>
<li><a href="#org1307d72">6.2.4. Nexus &#x2026; sunset</a></li>
<li><a href="#org913dbcd">6.2.5. Docker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org127c129">6.2.5.1. <span class="todo TODO">TODO</span> dockerhub :-)</a></li>
<li><a href="#org465d88b">6.2.5.2. <span class="todo TODO">TODO</span> docker file</a></li>
<li><a href="#orgf2c8bfa">6.2.5.3. <span class="todo TODO">TODO</span> docker image</a></li>
<li><a href="#org10179d2">6.2.5.4. <span class="todo TODO">TODO</span> docker compose</a></li>
<li><a href="#org36a6b02">6.2.5.5. <span class="todo TODO">TODO</span> docker swarm</a></li>
<li><a href="#org54bfdd2">6.2.5.6. <span class="todo TODO">TODO</span> linux namespaces</a></li>
<li><a href="#org2f7c005">6.2.5.7. <span class="todo TODO">TODO</span> cgroups</a></li>
<li><a href="#org5bca044">6.2.5.8. <span class="todo TODO">TODO</span> OCI</a></li>
<li><a href="#org188017d">6.2.5.9. <span class="todo TODO">TODO</span> volumes</a></li>
<li><a href="#org5a55460">6.2.5.10. <span class="todo TODO">TODO</span> networks</a></li>
<li><a href="#org7258310">6.2.5.11. <span class="todo TODO">TODO</span> BuildKit</a></li>
<li><a href="#org9e0c370">6.2.5.12. <span class="todo TODO">TODO</span> DTR - docker trusted registry</a></li>
</ul>
</li>
<li><a href="#org4008b0c">6.2.6. K8S / Kubernetes:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgfdd2607">6.2.6.1. What is a service&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org62aadd4">6.2.6.2. What are network policies?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org70d2d6e">6.2.6.3. what are labels?</a></li>
<li><a href="#orgac268e4">6.2.6.4. What are network policies rules?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb79096a">6.2.6.5. what are podSelectors?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgf4321d5">6.2.6.6. what is namespaceSelector?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgcbd1cbc">6.2.6.7. what is empty selector:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org40a9eb0">6.2.6.8. what ipBlock and hwhat are they good for?</a></li>
<li><a href="#org64fbc26">6.2.6.9. what is a network policy plugin and how you enable that?</a></li>
<li><a href="#org2cfb6b6">6.2.6.10. network policy API</a></li>
<li><a href="#orgc959f95">6.2.6.11. whats is kube-dns</a></li>
<li><a href="#org7001d64">6.2.6.12. helm</a></li>
<li><a href="#org20d1655">6.2.6.13. chart</a></li>
<li><a href="#org4758f22">6.2.6.14. template</a></li>
<li><a href="#org09de285">6.2.6.15. cluster</a></li>
<li><a href="#org18e17c5">6.2.6.16. pod</a></li>
<li><a href="#orge4b3921">6.2.6.17. node</a></li>
<li><a href="#orge2bd955">6.2.6.18. service mesh</a></li>
<li><a href="#orgce8a0cb">6.2.6.19. ingress controller</a></li>
<li><a href="#org8ce7d1c">6.2.6.20. ingress and exgress?</a></li>
<li><a href="#org87c804d">6.2.6.21. etcd</a></li>
<li><a href="#org0fa89eb">6.2.6.22. secret</a></li>
<li><a href="#orgaaaa589">6.2.6.23. operator</a></li>
<li><a href="#orgc7824dd">6.2.6.24. CRD / Custom Resources</a></li>
<li><a href="#orgb96c785">6.2.6.25. liveness/readines probes</a></li>
<li><a href="#org7843c1d">6.2.6.26. kubectl</a></li>
<li><a href="#org05f892d">6.2.6.27. CNCF</a></li>
</ul>
</li>
<li><a href="#org46ffed3">6.2.7. Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgfa180c7">6.2.7.1. resource</a></li>
<li><a href="#orgd717294">6.2.7.2. module</a></li>
<li><a href="#org6982f7d">6.2.7.3. state</a></li>
<li><a href="#org6fb62d6">6.2.7.4. backend</a></li>
</ul>
</li>
<li><a href="#org55f6479">6.2.8. Chef&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org569fd5c">6.2.9. Puppet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org3efad75">6.2.10. Ansible&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgf2fab9e">6.2.11. Cloud Formation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org1cca176">6.2.12. Hashicorp consul&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org5ef251e">6.2.13. Hashicorp vault&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgea00468">6.2.14. zookeeper&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgb2b90f4">6.2.15. kibana&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org4c713be">6.2.16. graphana&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orga687ac6">6.2.17. ELK&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orge99949a">6.2.18. DynaTrace&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org8ab9488">6.2.19. Piwik&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#orgd14b69f">6.3. Linux</a>
<ul>
<li><a href="#orge812262">6.3.1. cron</a></li>
<li><a href="#orgb158ae4">6.3.2. runlevel / init / inittab</a></li>
<li><a href="#org5878891">6.3.3. systemd</a></li>
<li><a href="#orgf137f5d">6.3.4. snap</a></li>
<li><a href="#org466ff23">6.3.5. apt</a></li>
<li><a href="#org6384e74">6.3.6. ssh</a>
<ul>
<li><a href="#org59bf78f">6.3.6.1. how to create trust between computers</a></li>
</ul>
</li>
<li><a href="#org91233c2">6.3.7. awk</a></li>
<li><a href="#org1baf003">6.3.8. sed</a></li>
<li><a href="#org908c0c5">6.3.9. grep</a></li>
<li><a href="#orgbd3c139">6.3.10. tail</a></li>
<li><a href="#org041efb0">6.3.11. head</a></li>
<li><a href="#orgf84db2c">6.3.12. rsync</a></li>
<li><a href="#orgdac36cc">6.3.13. mount</a></li>
<li><a href="#org1e69311">6.3.14. ls / ps / htop</a></li>
<li><a href="#org1f854a3">6.3.15. bash&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgad5d332">6.3.15.1. co je to here doc?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org288fd64">6.3.16. co je to regexp</a></li>
<li><a href="#org5f4a003">6.3.17. list open ports</a></li>
<li><a href="#org77ab9f0">6.3.18. iptables</a></li>
<li><a href="#org291ae8e">6.3.19. BPF</a></li>
<li><a href="#org8f8f750">6.3.20. list open files</a></li>
<li><a href="#org8106c97">6.3.21. stdin stdout stderr</a></li>
<li><a href="#orgfa434c2">6.3.22. NFS</a></li>
<li><a href="#org9f37c3e">6.3.23. file types:</a>
<ul>
<li><a href="#org07cfa3d">6.3.23.1. block device</a></li>
<li><a href="#org2da07c4">6.3.23.2. character device</a></li>
<li><a href="#org6fda3cb">6.3.23.3. named pipe</a></li>
<li><a href="#orgb41e5ce">6.3.23.4. symlink</a></li>
</ul>
</li>
<li><a href="#orgdcaee2e">6.3.24. etc/nsswitch./conf</a></li>
<li><a href="#org288d272">6.3.25. etc/resolv.conf</a></li>
<li><a href="#org4b9e7a7">6.3.26. ip</a></li>
<li><a href="#orgb603351">6.3.27. nmap</a></li>
<li><a href="#orgfcfa124">6.3.28. nc</a></li>
<li><a href="#orgf978c1c">6.3.29. socat</a></li>
<li><a href="#org2b22834">6.3.30. chmod</a></li>
<li><a href="#orgae94187">6.3.31. dd</a></li>
<li><a href="#orgfae050a">6.3.32. tar</a></li>
<li><a href="#org9d377d7">6.3.33. apt-get apt</a></li>
<li><a href="#org862b8a2">6.3.34. wget</a></li>
<li><a href="#org1d92941">6.3.35. curl</a></li>
<li><a href="#org0f94046">6.3.36. find</a></li>
</ul>
</li>
<li><a href="#orge322841">6.4. Observability</a>
<ul>
<li><a href="#org0f38b7b">6.4.1. 3 pillars</a>
<ul>
<li><a href="#org33385d3">6.4.1.1. logs</a></li>
<li><a href="#orgb75948a">6.4.1.2. metrics</a></li>
<li><a href="#org8490420">6.4.1.3. traces</a></li>
</ul>
</li>
<li><a href="#org36d3d48">6.4.2. Tail Latency</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#WEB">7. <span class="todo WIP">WIP</span> Web Front End&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org069e303">7.1. React</a>
<ul>
<li><a href="#orgb180cf2">7.1.1. React</a></li>
<li><a href="#orge66532c">7.1.2. React Native</a></li>
<li><a href="#org4788150">7.1.3. react-hooks</a></li>
</ul>
</li>
<li><a href="#org91bd42a">7.2. Angular</a></li>
<li><a href="#org2aa311d">7.3. PWA</a>
<ul>
<li><a href="#orgf4f20dc">7.3.1. app-shell model</a></li>
</ul>
</li>
<li><a href="#org5132467">7.4. HTML + CSS</a>
<ul>
<li><a href="#orgc55c55b">7.4.1. Chrome Development Tools</a></li>
<li><a href="#org5270f1f">7.4.2. HTML5 Layout</a></li>
<li><a href="#org7803a5f">7.4.3. What is iframe good for?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org8bd97a3">7.4.4. <span class="todo WIP">WIP</span> Cookies</a></li>
<li><a href="#orgc0ea479">7.4.5. <span class="todo WIP">WIP</span> Cookies / SameSite</a></li>
<li><a href="#org3a95a92">7.4.6. Less</a></li>
<li><a href="#org23bf1c1">7.4.7. Sass</a></li>
<li><a href="#orgbb5066d">7.4.8. CORS</a>
<ul>
<li><a href="#org67c748b">7.4.8.1. why is CORS necessary?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org85f9d60">7.4.8.2. How Does CORS Manage Requests From External Resources?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org2000e5c">7.4.8.3. What http headers were added by CORS?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5227429">7.5. The Elm Architecture (TEA)</a></li>
</ul>
</li>
<li><a href="#SECURITY">8. <span class="todo WIP">WIP</span> Security&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org68b2ca3">8.1. SPIFFE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org745fd5b">8.1.1. what is spiffe</a></li>
</ul>
</li>
<li><a href="#org92b0039">8.2. Oauth2/OIDC&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org93084a0">8.2.1. grant (flow) types:</a>
<ul>
<li><a href="#org102800a">8.2.1.1. Authorization Code Flow</a></li>
<li><a href="#orgfd1bdf0">8.2.1.2. Client Credentials Flow</a></li>
<li><a href="#org965fd29">8.2.1.3. Device Code</a></li>
<li><a href="#orgfc6a8fe">8.2.1.4. Refresh Token</a></li>
<li><a href="#orgca876d8">8.2.1.5. PKCE</a></li>
<li><a href="#orgfb569b1">8.2.1.6. (Implicit Flow)</a></li>
<li><a href="#org9de3696">8.2.1.7. (Password Grant)</a></li>
</ul>
</li>
<li><a href="#orgb934c5e">8.2.2. Scope</a></li>
<li><a href="#org7f52f73">8.2.3. What is acr_values</a></li>
</ul>
</li>
<li><a href="#orga894bf5">8.3. JWT</a>
<ul>
<li><a href="#org1c0a5bb">8.3.1. What are the registered claim names?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgec9ed95">8.3.2. What is registered claim name "iss" (Issuer) Claim?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgc2c09fa">8.3.3. What is registered claim name "sub" (Subject) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb583781">8.3.4. What is registered claim name "aud" (Audience) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb27d13c">8.3.5. What is registered claim name "exp" (Expiration Time) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org60bf64c">8.3.6. What is registered claim name "nbf" (Not Before) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org96d62e0">8.3.7. What is registered claim name "iat" (Issued At) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgaf53e15">8.3.8. What is registered claim name "jti" (JWT ID) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org9715875">8.3.9. What are Public Claim Names&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org1135a2f">8.4. <span class="todo WIP">WIP</span> JWKS</a></li>
<li><a href="#org657b313">8.5. LDAP</a>
<ul>
<li><a href="#org14ffc52">8.5.1. object class</a>
<ul>
<li><a href="#org47524c7">8.5.1.1. inetOrgPerson</a></li>
</ul>
</li>
<li><a href="#orged25d61">8.5.2. OID</a></li>
<li><a href="#orgd94afcc">8.5.3. CN, DN, SN,</a></li>
</ul>
</li>
<li><a href="#org9e40089">8.6. OWASP top 10 2017</a>
<ul>
<li><a href="#org8ce73e5">8.6.1. A1:2017-Injection</a></li>
<li><a href="#org24e39bb">8.6.2. A2:2017-Broken Authentication</a></li>
<li><a href="#orgc25ab00">8.6.3. A3:2017-Sensitive Data Exposure</a></li>
<li><a href="#orge918c6b">8.6.4. A4:2017-XML External Entities (XXE)</a></li>
<li><a href="#org59856b3">8.6.5. A5:2017-Broken Access Control</a></li>
<li><a href="#org6a66c29">8.6.6. A6:2017-Security Misconfiguration</a></li>
<li><a href="#orga6f9dda">8.6.7. A7:2017-Cross-Site Scripting (XSS)</a></li>
<li><a href="#org2f99846">8.6.8. A8:2017-Insecure Deserialization</a></li>
<li><a href="#org2ac136e">8.6.9. A9:2017-Using Components with Known Vulnerabilities</a></li>
<li><a href="#orgc28b317">8.6.10. A10:2017-Insufficient Logging &amp; Monitoring</a></li>
</ul>
</li>
<li><a href="#org84ada5d">8.7. Crypto</a>
<ul>
<li><a href="#orgb98ece0">8.7.1. Block Ciphers</a>
<ul>
<li><a href="#org989238e">8.7.1.1. ECB, CBC, OFB, CFB, CTR  - what they are</a></li>
<li><a href="#org1d1b6d5">8.7.1.2. RSA</a></li>
<li><a href="#orgc65d75d">8.7.1.3. AES</a></li>
<li><a href="#org90cb979">8.7.1.4. DES</a></li>
</ul>
</li>
<li><a href="#orgef703a8">8.7.2. Hash</a>
<ul>
<li>
<ul>
<li><a href="#org5035f8c">base64</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org80c1e91">8.7.3. symetricka sifra</a></li>
<li><a href="#orgcb67580">8.7.4. asymetricka sifra</a></li>
<li><a href="#org8811ad3">8.7.5. RS256 vs HS256: What's the difference?</a></li>
</ul>
</li>
<li><a href="#orge5f95ee">8.8. bastillion.io</a></li>
<li><a href="#orgf2f7b93">8.9. PKI</a></li>
<li><a href="#orgd8768f2">8.10. X509</a>
<ul>
<li><a href="#org281db16">8.10.1. Why does GoDaddy have four different certificate chain, G2, G3, G4?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org8eb877b">8.11. <span class="todo TODO">TODO</span> Illumio Security</a></li>
<li><a href="#org281d9d7">8.12. <span class="todo TODO">TODO</span> DEVSECOPS</a></li>
</ul>
</li>
<li><a href="#LANGUAGES">9. <span class="todo WIP">WIP</span> Languages &amp; programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#orgfd5e72a">9.1. Functional Programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgb6fea3a">9.1.1. Lambda Calculus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org0794a1f">9.1.1.1. α-conversion</a></li>
<li><a href="#orgdf19e7c">9.1.1.2. β-reduction</a></li>
<li><a href="#org63bd884">9.1.1.3. η-reduction</a></li>
</ul>
</li>
<li><a href="#orgb99e1db">9.1.2. Patterns</a>
<ul>
<li><a href="#org7d1e0fd">9.1.2.1. Monoid</a></li>
<li><a href="#org1b72ddb">9.1.2.2. Functor</a></li>
<li><a href="#orge858eaa">9.1.2.3. Applicative</a></li>
<li><a href="#org80eaf2e">9.1.2.4. Monad</a></li>
<li><a href="#orgfd5d470">9.1.2.5. Kleisli Functor</a></li>
<li><a href="#orgc19920d">9.1.2.6. Optics</a>
<ul>
<li><a href="#org8ee7319">Lenses</a></li>
<li><a href="#org2129783">Prisms</a></li>
</ul>
</li>
<li><a href="#org0998459">9.1.2.7. Recursion Schemes</a>
<ul>
<li><a href="#org20908e4">catamorphisms</a></li>
<li><a href="#org09be9a6">anamorphisms</a></li>
<li><a href="#org9a75cd5">hylomorphisms</a></li>
<li><a href="#orgad82b97">paramorphisms</a></li>
<li><a href="#org91973cf">Persistent data structure - Chris Okasaki</a></li>
</ul>
</li>
<li><a href="#orgb546ea9">9.1.2.8. Immutability&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org7bd3b49">9.2. Object Oriented Programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgb8e9080">9.2.1. Polymorphism</a></li>
<li><a href="#org84c5128">9.2.2. Gof Design Patterns</a>
<ul>
<li><a href="#org659737e">9.2.2.1. Abstract Factory</a></li>
<li><a href="#org5155ce1">9.2.2.2. Singleton</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5f64b62">9.3. ReasonML&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org6897862">9.4. JavaScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org9eee02c">9.4.1. what is IIFE?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org411f3a7">9.4.2. inheritance model of JS</a></li>
<li><a href="#orgee2b0aa">9.4.3. hoisting</a></li>
<li><a href="#org0cfb762">9.4.4. event loop</a></li>
<li><a href="#orgf0f4fe3">9.4.5. promisses</a></li>
<li><a href="#orgac07504">9.4.6. observables</a></li>
<li><a href="#org4c8a467">9.4.7. RxJS</a></li>
<li><a href="#org33b3c9b">9.4.8. JS modular system</a></li>
</ul>
</li>
<li><a href="#org8f81b22">9.5. TypeScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org81433c4">9.6. Babel</a></li>
<li><a href="#orge4b4a68">9.7. Java&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#orgbdad914">9.7.1. Basic Java</a>
<ul>
<li><a href="#org59f8668">9.7.1.1. hashCode()</a>
<ul>
<li><a href="#orgbbdb687">is this code wrong? yes / no / why&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orgf5879be">9.7.1.2. hashCode vs equals()&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org303eb33">9.7.1.3. what is a contract?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5720c6a">9.7.1.4. Java Collections Framework:</a>
<ul>
<li><a href="#org371152e">what is a difference between List vs Set vs Map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orge969e54">what is the difference ArrayList vs LinkedList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org471b5b6">9.7.1.5. StringBuilder vs StringBuffer vs String</a></li>
<li><a href="#orgc58fb13">9.7.1.6. Can we have static method in the interface?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orga24076a">9.7.1.7. You have a list of Custom objects? How can you sort them?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org76cee9c">9.7.1.8. How to create thread safe Singleton in Java&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5247281">9.7.1.9. Difference between List and Set in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb13253f">9.7.1.10. How do you prevent a class from being sub-classed in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgf2f4c97">9.7.1.11. Difference between throw and throws keyword in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org97870c4">9.7.1.12. Difference between Iterator and Enumeration in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgc2c48fa">9.7.1.13. What is IdentityHashMap in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orge0883fc">9.7.1.14. What is String pool in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orge734cfa">9.7.1.15. Can a Serializable class contain a non-serializable field in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5ae57a0">9.7.1.16. Difference between this and super in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgbfb7af0">9.7.1.17. Difference between Comparator and Comparable in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org84a7230">9.7.1.18. BigDecimal vs float&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5486e53">9.7.1.19. what is the difference betwen checked and unchecked exception?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgfb5e596">9.7.1.20. Co všechno je špatně na tomto kusu kódu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org766eb86">9.7.1.21. Explain Java 7 ARM (Automatic Resource Managemet) Feature and multi-catch block?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org494b430">9.7.1.22. <span class="todo TODO">TODO</span> JPA</a></li>
<li><a href="#orgdad4875">9.7.1.23. <span class="todo TODO">TODO</span> Generics</a></li>
<li><a href="#org2e70128">9.7.1.24. <span class="todo TODO">TODO</span> Java 9 - project jigsaw</a></li>
<li><a href="#org34394d2">9.7.1.25. <span class="todo TODO">TODO</span> QueryDSL</a></li>
<li><a href="#orgb930b09">9.7.1.26. <span class="todo WIP">WIP</span> Maven</a>
<ul>
<li><a href="#org2ace6d2">Jaký je rozdíl mezi &lt;dependencies&gt; a &lt;dependencyManagement&gt;?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org4937e20">K čemu se používá scope provided?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#orgbfe51ed">9.7.1.27. <span class="todo TODO">TODO</span> Gradle</a></li>
</ul>
</li>
<li><a href="#orgeb8dd86">9.7.2. Spring &amp; Spring Boot</a>
<ul>
<li><a href="#org5a8240f">9.7.2.1. Jaký je rozdíl mezi JavaEE a Springem?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org5920cad">9.7.2.2. Difference between spring and spting boot&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org24adfd8">9.7.2.3. Co přinesl Spring Boot do Spring ekosystému?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgedc8130">9.7.2.4. Jaký je hlavní rozdíl v transaction handlingu mezi JavaEE (od verze 3) a Springem?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org07c7c37">9.7.2.5. How Would You Enable Transactions in Spring and What Are Their Benefits?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org0abb448">9.7.2.6. What is the difference betweek JPA and Hibernate?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org8e5752a">9.7.2.7. Can use jetty instead of tomcat in spring-boot-starter-web?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org893a2d5">9.7.2.8. What Is Reactive Programming?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org80a392d">9.7.2.9. What Is Spring Webflux?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org04f1e0c">9.7.2.10. What Are the Mono and Flux Types?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb718f58">9.7.2.11. What Is the Use of Webclient and Webtestclient?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgded9704">9.7.2.12. What Are the Disadvantages of Using Reactive Streams?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org65daf5b">9.7.2.13. Is Spring 5 Compatible With Older Versions of Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgb81aa02">9.7.2.14. Can We Use Both Web Mvc and Webflux in the Same Application?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org19d0248">9.7.2.15. What Is the Role of the @Autowired Annotation?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#org0ed8045">9.7.2.16. "Spring 4.3 přinesl constructor-based dependency injection i bez nutnosti anotace Autowired. Jaké jsou výhody a nevýhody takového DI?"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org0ce9a19">9.7.3. JavaEE / JakartaEE</a>
<ul>
<li><a href="#org386f91a">9.7.3.1. access intent</a>
<ul>
<li><a href="#org0c261d0">optimistic vs pessimistic</a></li>
</ul>
</li>
<li><a href="#orgc8ec94d">9.7.3.2. Jaký je rozdíl mezi Java SE a JavaEE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
<li><a href="#orgf4543c7">9.7.3.3. Co je to aplikační server a nějaký příklad&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></a></li>
</ul>
</li>
<li><a href="#org5936f5a">9.7.4. Implemetations</a>
<ul>
<li><a href="#orga408427">9.7.4.1. GraalVM</a></li>
<li><a href="#org3182ee0">9.7.4.2. Quarcus</a></li>
<li><a href="#orgfffc8fa">9.7.4.3. AdoptOpenJDK</a></li>
</ul>
</li>
<li><a href="#org43363e9">9.7.5. JDBC</a></li>
<li><a href="#orgbe7946a">9.7.6. JMS</a></li>
</ul>
</li>
<li><a href="#org6662f26">9.8. <span class="todo TODO">TODO</span> Python</a></li>
<li><a href="#org0f4e2a5">9.9. <span class="todo TODO">TODO</span> JS on a backend</a>
<ul>
<li><a href="#orgf6fd3f9">9.9.1. <span class="todo TODO">TODO</span> NodeJS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#orgb6f5425">9.10. <span class="todo TODO">TODO</span> JS environment</a>
<ul>
<li><a href="#orgf492a00">9.10.1. npm</a></li>
<li><a href="#org0417f2c">9.10.2. yarn</a></li>
<li><a href="#orgc6d6735">9.10.3. nvm</a></li>
<li><a href="#org6e6a86f">9.10.4. Name soem popular libraries?</a></li>
</ul>
</li>
<li><a href="#orga626ff0">9.11. Language theory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a>
<ul>
<li><a href="#org7c830cc">9.11.1. Garbage Collector</a></li>
<li><a href="#org423430b">9.11.2. Type systems</a>
<ul>
<li><a href="#org7f6ce8d">9.11.2.1. strongly typed</a></li>
<li><a href="#org7addf42">9.11.2.2. weakly typed</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#QUALITY">10. <span class="todo WIP">WIP</span> Quality and Testing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#orge4aab85">10.1. <span class="todo TODO">TODO</span> Blue green deployment</a></li>
<li><a href="#orgfa4e8e0">10.2. <span class="todo TODO">TODO</span> AB testing</a></li>
<li><a href="#org53b03b0">10.3. <span class="todo TODO">TODO</span> Code coverage</a></li>
<li><a href="#org231770c">10.4. <span class="todo TODO">TODO</span> Cyclomatic complexity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orgca04c58">10.5. <span class="todo TODO">TODO</span> Code quality&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#orge123c5f">10.6. <span class="todo TODO">TODO</span> Unit testing</a></li>
</ul>
</li>
<li><a href="#CORE_VALUES">11. <span class="todo WIP">WIP</span> Core Values&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org06123cc">11.1. <span class="todo TODO">TODO</span> Code of Conduct&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
<li><a href="#org9bd68d2">11.2. <span class="todo WIP">WIP</span> SW developer responsibility&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></a></li>
</ul>
</li>
<li><a href="#INFORMATION_SOURCES">12. <span class="todo WIP">WIP</span> Information Sources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#orgcac02df">12.1. InfoQ</a></li>
<li><a href="#orga2fef8b">12.2. Coding Blocks</a></li>
<li><a href="#orgaeb4d0e">12.3. SE-Radio</a></li>
</ul>
</li>
<li><a href="#BIG_NAMES">13. <span class="todo WIP">WIP</span> Big Names&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></a>
<ul>
<li><a href="#org672f1c5">13.1. <span class="todo TODO">TODO</span> Bartosz MILEWSKI</a></li>
<li><a href="#org7fddbc7">13.2. <span class="todo TODO">TODO</span> Venkat Subramaniam</a></li>
<li><a href="#org5865238">13.3. <span class="todo TODO">TODO</span> Trisha GEE</a></li>
<li><a href="#orgc80ce7c">13.4. <span class="todo TODO">TODO</span> Kevlin HENNEY</a></li>
<li><a href="#org643d9cd">13.5. <span class="todo TODO">TODO</span> Brian GOETZ</a></li>
<li><a href="#org5a4bd37">13.6. <span class="todo TODO">TODO</span> Troy HUNT</a></li>
<li><a href="#org998061c">13.7. <span class="todo TODO">TODO</span> Scott MEYERS</a></li>
<li><a href="#orgf4239d0">13.8. <span class="todo TODO">TODO</span> Erik Meijer</a></li>
<li><a href="#org696a2bd">13.9. <span class="todo TODO">TODO</span> Edward Kmett</a></li>
<li><a href="#orge526b96">13.10. <span class="todo TODO">TODO</span> Chris Allen</a></li>
</ul>
</li>
<li><a href="#org20c056f">14. <span class="todo TODO">TODO</span> To integrate&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NO_EXPORT">NO_EXPORT</span></span></a></li>
</ul>
</div>
</div>
<div class="org-center">
<p>
<b>What is considered a full-stack - Richard's point of view</b>
</p>
</div>
