README.org
* WIP Software Engineering                                           :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: SOFTWARE_ENGINEERING
:END:
** bit / byte / endian / float
*** XOR, OR, AND, Shift (logical vs aritmetic)
*** one`s complement
*** two`s complements
*** ieee754 explain float: mantisa,exponent
*** Endian
** TCP/IP
*** IP address / netmask
*** CIDR
** I18N
*** iso-639
*** bcp-47 / rfc-5646
** Unicode
*** What is unicode
:PROPERTIES:
:lerning:  http://www.unicode.org/standard/WhatIsUnicode.html
:END:
- The Unicode Standard provides a unique number for every character, no matter what platform, device, application or language. It has been adopted by all modern software providers and now allows data to be transported through many different platforms, devices and applications without corruption. Support of Unicode forms the foundation for the representation of languages and symbols in all major operating systems, search engines, browsers, laptops, and smart phonesplus the Internet and World Wide Web (URLs, HTML, XML, CSS, JSON, etc.). Supporting Unicode is the best way to implement ISO/IEC 10646.
- The emergence of the Unicode Standard and the availability of tools supporting it are among the most significant recent global software technology trends.
*** utf-8
*** ASCII
*** EBCDIC
** Formats
*** yaml
:PROPERTIES:
:learning: https://rollout.io/blog/yaml-tutorial-everything-you-need-get-started/
:END:
*** json
*** xml
** declarative vs imperative
** [#B] Code complexity 
*** Code complexity (big O)
*** Amortized complexity
** TCP/IP
*** IP address / netmask
*** CIDR
** basic data structures
*** tree
*** list
*** hash
** basic algorithms
*** Stable vs unstable sorting

* WIP Architecture                                                   :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: ARCHITECTURE
:END:
basic of architecture 
** WIP DDD                                                           :TOPIC:
*** bounded context                                               :TOPIC:
*** ubiquotous language                                           :TOPIC:
*** Entity and Value Object                                       :TOPIC:
** WIP Messaging                                                     :TOPIC:
*** queue
*** topics
*** message delivery mode: 
- at least once
- at most once
- exactly once
*** tools
**** TODO Solace Pub/Sub Plus
**** TODO Google PubSub
**** TODO AWS SNS
**** TODO AWS SES
**** TODO AWS SQS
**** TODO AWS Kinesis
**** TODO RabbbitMQ
**** TODO Kafka

*** protocols
**** TODO amqp(s)
**** TODO mqtt(s)
**** TODO http(s)
** WIP HTTP Family                                                   :TOPIC:
*** HTTP
