public/fullstack.html
<div id="outline-container-org7717437" class="outline-2">
<h2 id="SOFTWARE_ENGINEERING"><span class="section-number-2">1</span> <span class="todo WIP">WIP</span> Software Engineering&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-SOFTWARE_ENGINEERING">
<pre class="example">
CUSTOM_ID: SOFTWARE_ENGINEERING
</pre>
</div>
<div id="outline-container-org2456bf1" class="outline-3">
<h3 id="org2456bf1"><span class="section-number-3">1.1</span> bit / byte / endian / float</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org83621fd" class="outline-4">
<h4 id="org83621fd"><span class="section-number-4">1.1.1</span> XOR, OR, AND, Shift (logical vs aritmetic)</h4>
</div>
<div id="outline-container-org3ab99cd" class="outline-4">
<h4 id="org3ab99cd"><span class="section-number-4">1.1.2</span> one`s complement</h4>
</div>
<div id="outline-container-org7581d6a" class="outline-4">
<h4 id="org7581d6a"><span class="section-number-4">1.1.3</span> two`s complements</h4>
</div>
<div id="outline-container-org1e0b885" class="outline-4">
<h4 id="org1e0b885"><span class="section-number-4">1.1.4</span> ieee754 explain float: mantisa,exponent</h4>
</div>
<div id="outline-container-orgd870c98" class="outline-4">
<h4 id="orgd870c98"><span class="section-number-4">1.1.5</span> Endian</h4>
</div>
</div>
<div id="outline-container-orgdfd25c7" class="outline-3">
<h3 id="orgdfd25c7"><span class="section-number-3">1.2</span> TCP/IP</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orge9107ca" class="outline-4">
<h4 id="orge9107ca"><span class="section-number-4">1.2.1</span> IP address / netmask</h4>
</div>
<div id="outline-container-org8230dc2" class="outline-4">
<h4 id="org8230dc2"><span class="section-number-4">1.2.2</span> CIDR</h4>
</div>
</div>
<div id="outline-container-org8ecedca" class="outline-3">
<h3 id="org8ecedca"><span class="section-number-3">1.3</span> I18N</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org809fd1c" class="outline-4">
<h4 id="org809fd1c"><span class="section-number-4">1.3.1</span> iso-639</h4>
</div>
<div id="outline-container-org6536a05" class="outline-4">
<h4 id="org6536a05"><span class="section-number-4">1.3.2</span> bcp-47 / rfc-5646</h4>
</div>
</div>
<div id="outline-container-orgaa4cd8f" class="outline-3">
<h3 id="orgaa4cd8f"><span class="section-number-3">1.4</span> Unicode</h3>
<div class="outline-text-3" id="text-1-4">
</div>
<div id="outline-container-orgac536f0" class="outline-4">
<h4 id="orgac536f0"><span class="section-number-4">1.4.1</span> What is unicode</h4>
<div class="outline-text-4" id="text-1-4-1">
<pre class="example">
lerning: http://www.unicode.org/standard/WhatIsUnicode.html
</pre>
<ul class="org-ul">
<li>The Unicode Standard provides a unique number for every character, no matter what platform, device, application or language. It has been adopted by all modern software providers and now allows data to be transported through many different platforms, devices and applications without corruption. Support of Unicode forms the foundation for the representation of languages and symbols in all major operating systems, search engines, browsers, laptops, and smart phonesplus the Internet and World Wide Web (URLs, HTML, XML, CSS, JSON, etc.). Supporting Unicode is the best way to implement ISO/IEC 10646.</li>
<li>The emergence of the Unicode Standard and the availability of tools supporting it are among the most significant recent global software technology trends.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc1f7809" class="outline-4">
<h4 id="orgc1f7809"><span class="section-number-4">1.4.2</span> utf-8</h4>
</div>
<div id="outline-container-orgc7b5834" class="outline-4">
<h4 id="orgc7b5834"><span class="section-number-4">1.4.3</span> ASCII</h4>
</div>
<div id="outline-container-orgc28f6f4" class="outline-4">
<h4 id="orgc28f6f4"><span class="section-number-4">1.4.4</span> EBCDIC</h4>
</div>
</div>
<div id="outline-container-org4b67cef" class="outline-3">
<h3 id="org4b67cef"><span class="section-number-3">1.5</span> Formats</h3>
<div class="outline-text-3" id="text-1-5">
</div>
<div id="outline-container-org5767111" class="outline-4">
<h4 id="org5767111"><span class="section-number-4">1.5.1</span> yaml</h4>
<div class="outline-text-4" id="text-1-5-1">
<pre class="example">
learning: https://rollout.io/blog/yaml-tutorial-everything-you-need-get-started/
</pre>
</div>
</div>
<div id="outline-container-orgb972163" class="outline-4">
<h4 id="orgb972163"><span class="section-number-4">1.5.2</span> json</h4>
</div>
<div id="outline-container-org15ec7b6" class="outline-4">
<h4 id="org15ec7b6"><span class="section-number-4">1.5.3</span> xml</h4>
</div>
</div>
<div id="outline-container-orgbdece4f" class="outline-3">
<h3 id="orgbdece4f"><span class="section-number-3">1.6</span> declarative vs imperative</h3>
</div>
<div id="outline-container-org9ec1ce7" class="outline-3">
<h3 id="org9ec1ce7"><span class="section-number-3">1.7</span> <span class="priority">[B]</span> Code complexity</h3>
<div class="outline-text-3" id="text-1-7">
</div>
<div id="outline-container-org42c674b" class="outline-4">
<h4 id="org42c674b"><span class="section-number-4">1.7.1</span> Code complexity (big O)</h4>
</div>
<div id="outline-container-org765b9cc" class="outline-4">
<h4 id="org765b9cc"><span class="section-number-4">1.7.2</span> Amortized complexity</h4>
</div>
</div>
<div id="outline-container-orgfb967e0" class="outline-3">
<h3 id="orgfb967e0"><span class="section-number-3">1.8</span> TCP/IP</h3>
<div class="outline-text-3" id="text-1-8">
</div>
<div id="outline-container-org9c85191" class="outline-4">
<h4 id="org9c85191"><span class="section-number-4">1.8.1</span> IP address / netmask</h4>
</div>
<div id="outline-container-org65c830f" class="outline-4">
<h4 id="org65c830f"><span class="section-number-4">1.8.2</span> CIDR</h4>
</div>
</div>
<div id="outline-container-org1862b75" class="outline-3">
<h3 id="org1862b75"><span class="section-number-3">1.9</span> basic data structures</h3>
<div class="outline-text-3" id="text-1-9">
</div>
<div id="outline-container-org1a7baf1" class="outline-4">
<h4 id="org1a7baf1"><span class="section-number-4">1.9.1</span> tree</h4>
</div>
<div id="outline-container-org713bb07" class="outline-4">
<h4 id="org713bb07"><span class="section-number-4">1.9.2</span> list</h4>
</div>
<div id="outline-container-orga40b5ce" class="outline-4">
<h4 id="orga40b5ce"><span class="section-number-4">1.9.3</span> hash</h4>
</div>
</div>
<div id="outline-container-orgc52cf85" class="outline-3">
<h3 id="orgc52cf85"><span class="section-number-3">1.10</span> basic algorithms</h3>
<div class="outline-text-3" id="text-1-10">
</div>
<div id="outline-container-org26928e8" class="outline-4">
<h4 id="org26928e8"><span class="section-number-4">1.10.1</span> Stable vs unstable sorting</h4>
</div>
</div>
</div>

<div id="outline-container-org84e25dc" class="outline-2">
<h2 id="ARCHITECTURE"><span class="section-number-2">2</span> <span class="todo WIP">WIP</span> Architecture&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-ARCHITECTURE">
<pre class="example">
CUSTOM_ID: ARCHITECTURE
</pre>
<p>
basic of architecture 
</p>
</div>
<div id="outline-container-org17e2f4a" class="outline-3">
<h3 id="org17e2f4a"><span class="section-number-3">2.1</span> <span class="todo WIP">WIP</span> DDD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-org5927b16" class="outline-4">
<h4 id="org5927b16"><span class="section-number-4">2.1.1</span> bounded context&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org3f9ebc3" class="outline-4">
<h4 id="org3f9ebc3"><span class="section-number-4">2.1.2</span> ubiquotous language&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orgb5a809c" class="outline-4">
<h4 id="orgb5a809c"><span class="section-number-4">2.1.3</span> Entity and Value Object&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
</div>
<div id="outline-container-org32b7d19" class="outline-3">
<h3 id="org32b7d19"><span class="section-number-3">2.2</span> <span class="todo WIP">WIP</span> Messaging&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgf9df493" class="outline-4">
<h4 id="orgf9df493"><span class="section-number-4">2.2.1</span> queue</h4>
</div>
<div id="outline-container-org47ae210" class="outline-4">
<h4 id="org47ae210"><span class="section-number-4">2.2.2</span> topics</h4>
</div>
<div id="outline-container-org1e3f90b" class="outline-4">
<h4 id="org1e3f90b"><span class="section-number-4">2.2.3</span> message delivery mode:</h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li>at least once</li>
<li>at most once</li>
<li>exactly once</li>
</ul>
</div>
</div>
<div id="outline-container-org8909033" class="outline-4">
<h4 id="org8909033"><span class="section-number-4">2.2.4</span> tools</h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<div id="outline-container-orgd83394a" class="outline-5">
<h5 id="orgd83394a"><span class="section-number-5">2.2.4.1</span> <span class="todo TODO">TODO</span> Solace Pub/Sub Plus</h5>
</div>
<div id="outline-container-orged6ce7e" class="outline-5">
<h5 id="orged6ce7e"><span class="section-number-5">2.2.4.2</span> <span class="todo TODO">TODO</span> Google PubSub</h5>
</div>
<div id="outline-container-org50eabd5" class="outline-5">
<h5 id="org50eabd5"><span class="section-number-5">2.2.4.3</span> <span class="todo TODO">TODO</span> AWS SNS</h5>
</div>
<div id="outline-container-org3df14cd" class="outline-5">
<h5 id="org3df14cd"><span class="section-number-5">2.2.4.4</span> <span class="todo TODO">TODO</span> AWS SES</h5>
</div>
<div id="outline-container-org9864e90" class="outline-5">
<h5 id="org9864e90"><span class="section-number-5">2.2.4.5</span> <span class="todo TODO">TODO</span> AWS SQS</h5>
</div>
<div id="outline-container-org02044f1" class="outline-5">
<h5 id="org02044f1"><span class="section-number-5">2.2.4.6</span> <span class="todo TODO">TODO</span> AWS Kinesis</h5>
</div>
<div id="outline-container-orge51869e" class="outline-5">
<h5 id="orge51869e"><span class="section-number-5">2.2.4.7</span> <span class="todo TODO">TODO</span> RabbbitMQ</h5>
</div>
<div id="outline-container-orgadc8b00" class="outline-5">
<h5 id="orgadc8b00"><span class="section-number-5">2.2.4.8</span> <span class="todo TODO">TODO</span> Kafka</h5>
</div>
</div>

<div id="outline-container-org0772145" class="outline-4">
<h4 id="org0772145"><span class="section-number-4">2.2.5</span> protocols</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
<div id="outline-container-org4a6da81" class="outline-5">
<h5 id="org4a6da81"><span class="section-number-5">2.2.5.1</span> <span class="todo TODO">TODO</span> amqp(s)</h5>
</div>
<div id="outline-container-orgbc6fcd2" class="outline-5">
<h5 id="orgbc6fcd2"><span class="section-number-5">2.2.5.2</span> <span class="todo TODO">TODO</span> mqtt(s)</h5>
</div>
<div id="outline-container-org7378c8f" class="outline-5">
<h5 id="org7378c8f"><span class="section-number-5">2.2.5.3</span> <span class="todo TODO">TODO</span> http(s)</h5>
</div>
</div>
</div>
<div id="outline-container-orgc1b46dc" class="outline-3">
<h3 id="orgc1b46dc"><span class="section-number-3">2.3</span> <span class="todo WIP">WIP</span> HTTP Family&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-2-3">
</div>
