README.org
**** What is the use of Accept and Content-Type Headers in HTTP Request? :QUESTION:
:ANSWER:
- Accept headers:
  - tells web service what kind of response client is accepting, so if a web service is capable of sending response in XML and JSON format and client sends Accept header as application/xml then XML response will be sent. For Accept header application/json, server will send the JSON response.
- Content-Type header:
  - is used to tell server what is the format of data being sent in the request. If Content-Type header is application/xml then server will try to parse it as XML data. This header is useful in HTTP Post and Put requests.
:END:
**** WIP What is Server-Sent Events  (SSE)                      :QUESTION:
:ANSWER:
- is a standard describing how servers can initiate data transmission towards clients once an initial client connection has been established.
- They are commonly used to send message updates or continuous data streams to a browser client
  - designed to enhance native, cross-browser streaming through a JavaScript API called EventSource,
    - through which a client requests a particular URL in order to receive an event stream.
:END:
**** WIP What are WebSockets                                    :QUESTION:
** WIP REST
*** What are the HTTP methods supported by REST?                 :QUESTION:
:ANSWER:
HTTP methods supported by REST are:

| GET     | It requests a resource at the request URL. It should not contain a request body as it will be discarded. Maybe it can be cached locally or on the server. |
| POST    | It submits information to the service for processing; it should typically return the modified or new resource                                             |
| PUT     | At the request URL it update the resource                                                                                                                 |
| DELETE  | At the request URL it removes the resource                                                                                                                |
| OPTIONS | It indicates which techniques are supported                                                                                                               |
| HEAD    | About the request URL it returns meta information                                                                                                         |
:END:

*** What is the purpose of HTTP Status Code?                     :QUESTION:
:ANSWER:
HTTP Status code are standard codes and refers to predefined status of task done at server. For example, HTTP Status 404 states that requested resource is not present on server.

Consider following status codes:
|-----+-----------------------+----------------------------------------------------------------------------------------------------------------------------------------------------|
| 200 | OK                    | shows success.                                                                                                                                     |
| 201 | CREATED               | when a resource is successful created using POST or PUT request. Return link to newly created resource using location header.                      |
| 304 | NOT MODIFIED          | used to reduce network bandwidth usage in case of conditional GET requests. Response body should be empty. Headers should have date, location etc. |
| 400 | BAD REQUEST           | states that invalid input is provided e.g. validation error, missing data.                                                                         |
| 401 | FORBIDDEN             | states that user is not having access to method being used for example, delete access without admin rights.                                        |
| 404 | NOT FOUND             | states that method is not available.                                                                                                               |
| 409 | CONFLICT              | states conflict situation while executing the method for example, adding duplicate entry.                                                          |
| 500 | INTERNAL SERVER ERROR | states that server has thrown some exception while executing the method.                                                                           |
|-----+-----------------------+----------------------------------------------------------------------------------------------------------------------------------------------------|
:END:
*** What is statelessness in RESTful Webservices?                :QUESTION:
:ANSWER:
- As per REST architecture, a RESTful web service should not keep a client state on server.
- This restriction is called statelessness.
- It is responsibility of the client to pass its context to server and then server can store this context to process client's further request.
- For example, session maintained by server is identified by session identifier passed by the client.
:END:
*** What is the difference between PUT and POST?                 :QUESTION:

:ANSWER:
- PUT puts a file or resource at a particular URI and exactly at that URI. If there is already a file or resource at that URI, PUT changes that file or resource. If there is no resource or file there, PUT makes one
- POST sends data to a particular URI and expects the resource at that URI to deal with the request. The web server at this point can decide what to do with the data in the context of specified resource
- PUT is idempotent meaning, invoking it any number of times will not have an impact on resources.
- However, POST is not idempotent, meaning if you invoke POST multiple times it keeps creating more resources
:END:
*** TODO HATEOAS
** TODO GraphQL
** TODO 12 Factor Apps
** TODO 3Factor Apps
** WIP OpenApiSpec / Open API 3.0 / Swagger 
:PROPERTIES:
:learning: https://app.swaggerhub.com/help/tutorials/openapi-3-tutorial
:END:
