public/fullstack.html
<div id="outline-container-org4e618de" class="outline-4">
<h4 id="org4e618de"><span class="section-number-4">2.3.1</span> HTTP</h4>
<div class="outline-text-4" id="text-2-3-1">
</div>
<div id="outline-container-org485843b" class="outline-5">
<h5 id="org485843b"><span class="section-number-5">2.3.1.1</span> What is the use of Accept and Content-Type Headers in HTTP Request?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-2-3-1-1">
<ul class="org-ul">
<li>Accept headers:
<ul class="org-ul">
<li>tells web service what kind of response client is accepting, so if a web service is capable of sending response in XML and JSON format and client sends Accept header as application/xml then XML response will be sent. For Accept header application/json, server will send the JSON response.</li>
</ul></li>
<li>Content-Type header:
<ul class="org-ul">
<li>is used to tell server what is the format of data being sent in the request. If Content-Type header is application/xml then server will try to parse it as XML data. This header is useful in HTTP Post and Put requests.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org3dc2426" class="outline-5">
<h5 id="org3dc2426"><span class="section-number-5">2.3.1.2</span> <span class="todo WIP">WIP</span> What is Server-Sent Events  (SSE)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-2-3-1-2">
<ul class="org-ul">
<li>is a standard describing how servers can initiate data transmission towards clients once an initial client connection has been established.</li>
<li>They are commonly used to send message updates or continuous data streams to a browser client
<ul class="org-ul">
<li>designed to enhance native, cross-browser streaming through a JavaScript API called EventSource,
<ul class="org-ul">
<li>through which a client requests a particular URL in order to receive an event stream.</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf05ee1c" class="outline-5">
<h5 id="orgf05ee1c"><span class="section-number-5">2.3.1.3</span> <span class="todo WIP">WIP</span> What are WebSockets&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
</div>
</div>
<div id="outline-container-orgc72a390" class="outline-3">
<h3 id="orgc72a390"><span class="section-number-3">2.4</span> <span class="todo WIP">WIP</span> REST</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-orgac95ca3" class="outline-4">
<h4 id="orgac95ca3"><span class="section-number-4">2.4.1</span> What are the HTTP methods supported by REST?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
HTTP methods supported by REST are:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">GET</td>
<td class="org-left">It requests a resource at the request URL. It should not contain a request body as it will be discarded. Maybe it can be cached locally or on the server.</td>
</tr>

<tr>
<td class="org-left">POST</td>
<td class="org-left">It submits information to the service for processing; it should typically return the modified or new resource</td>
</tr>

<tr>
<td class="org-left">PUT</td>
<td class="org-left">At the request URL it update the resource</td>
</tr>

<tr>
<td class="org-left">DELETE</td>
<td class="org-left">At the request URL it removes the resource</td>
</tr>

<tr>
<td class="org-left">OPTIONS</td>
<td class="org-left">It indicates which techniques are supported</td>
</tr>

<tr>
<td class="org-left">HEAD</td>
<td class="org-left">About the request URL it returns meta information</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org20a7e8e" class="outline-4">
<h4 id="org20a7e8e"><span class="section-number-4">2.4.2</span> What is the purpose of HTTP Status Code?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
HTTP Status code are standard codes and refers to predefined status of task done at server. For example, HTTP Status 404 states that requested resource is not present on server.
</p>

<p>
Consider following status codes:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">200</td>
<td class="org-left">OK</td>
<td class="org-left">shows success.</td>
</tr>

<tr>
<td class="org-right">201</td>
<td class="org-left">CREATED</td>
<td class="org-left">when a resource is successful created using POST or PUT request. Return link to newly created resource using location header.</td>
</tr>

<tr>
<td class="org-right">304</td>
<td class="org-left">NOT MODIFIED</td>
<td class="org-left">used to reduce network bandwidth usage in case of conditional GET requests. Response body should be empty. Headers should have date, location etc.</td>
</tr>

<tr>
<td class="org-right">400</td>
<td class="org-left">BAD REQUEST</td>
<td class="org-left">states that invalid input is provided e.g. validation error, missing data.</td>
</tr>

<tr>
<td class="org-right">401</td>
<td class="org-left">FORBIDDEN</td>
<td class="org-left">states that user is not having access to method being used for example, delete access without admin rights.</td>
</tr>

<tr>
<td class="org-right">404</td>
<td class="org-left">NOT FOUND</td>
<td class="org-left">states that method is not available.</td>
</tr>

<tr>
<td class="org-right">409</td>
<td class="org-left">CONFLICT</td>
<td class="org-left">states conflict situation while executing the method for example, adding duplicate entry.</td>
</tr>

<tr>
<td class="org-right">500</td>
<td class="org-left">INTERNAL SERVER ERROR</td>
<td class="org-left">states that server has thrown some exception while executing the method.</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org75478e4" class="outline-4">
<h4 id="org75478e4"><span class="section-number-4">2.4.3</span> What is statelessness in RESTful Webservices?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-2-4-3">
<ul class="org-ul">
<li>As per REST architecture, a RESTful web service should not keep a client state on server.</li>
<li>This restriction is called statelessness.</li>
<li>It is responsibility of the client to pass its context to server and then server can store this context to process client's further request.</li>
<li>For example, session maintained by server is identified by session identifier passed by the client.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4610ce" class="outline-4">
<h4 id="orgf4610ce"><span class="section-number-4">2.4.4</span> What is the difference between PUT and POST?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-2-4-4">
<ul class="org-ul">
<li>PUT puts a file or resource at a particular URI and exactly at that URI. If there is already a file or resource at that URI, PUT changes that file or resource. If there is no resource or file there, PUT makes one</li>
<li>POST sends data to a particular URI and expects the resource at that URI to deal with the request. The web server at this point can decide what to do with the data in the context of specified resource</li>
<li>PUT is idempotent meaning, invoking it any number of times will not have an impact on resources.</li>
<li>However, POST is not idempotent, meaning if you invoke POST multiple times it keeps creating more resources</li>
</ul>
</div>
</div>
<div id="outline-container-org77ce5f3" class="outline-4">
<h4 id="org77ce5f3"><span class="section-number-4">2.4.5</span> <span class="todo TODO">TODO</span> HATEOAS</h4>
</div>
</div>
<div id="outline-container-org52dd963" class="outline-3">
<h3 id="org52dd963"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> GraphQL</h3>
</div>
<div id="outline-container-org540b12c" class="outline-3">
<h3 id="org540b12c"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> 12 Factor Apps</h3>
</div>
<div id="outline-container-org36e7055" class="outline-3">
<h3 id="org36e7055"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> 3Factor Apps</h3>
</div>
<div id="outline-container-org8df916e" class="outline-3">
<h3 id="org8df916e"><span class="section-number-3">2.8</span> <span class="todo WIP">WIP</span> OpenApiSpec / Open API 3.0 / Swagger</h3>
<div class="outline-text-3" id="text-2-8">
<pre class="example">
learning: https://app.swaggerhub.com/help/tutorials/openapi-3-tutorial
</pre>
</div>
