README.org
*** What Is OpenAPI?
:ANSWER:
- OpenAPI Specification (formerly known as Swagger Specification) is an open-source format for describing and documenting APIs. The Specification was originally developed in 2010 by Reverb Technologies (formerly Wordnik) as a way to keep the API design and documentation in sync. It has since become a de-facto standard for designing and describing RESTful APIs, and is used by millions of developers and organizations for developing their APIs, be it internal or client facing.

- The latest version of OpenAPI is 3.0. OpenAPI definitions can be written in JSON or YAML. We recommend YAML, because it is easier to read and write.

- A simple OpenAPI 3.0 specification looks like this:
#+begin_src yaml
  openapi: 3.0.0
  info:
    version: 1.0.0
    title: Sample API
    description: A sample API to illustrate OpenAPI concepts
  paths:
    /list:
      get:
        description: Returns a list of stuff              
        responses:
          '200':
            description: Successful response
#+end_src
:END:

** WIP micro-service-architecture
** WIP Enterprise Architecture Integration Patterns
*** orchestration
*** choreography
** TODO Event Sourcing
** TODO CQRS
** TODO CRUD
** WIP Pragmatic Design principes
*** DRY                                                           :TOPIC:
*** KISS                                                          :TOPIC:
*** YAGNI                                                         :TOPIC:
*** SOLID
*** open-close principal                                          :TOPIC:
*** High cohesion                                                 :TOPIC:
*** Low coupling                                                  :TOPIC:
**** What is temporal coupling?                                 :QUESTION:
** TODO Antifragile architecture
** WIP Evolutionary database design
:PROPERTIES:
:lerning:  https://martinfowler.com/articles/evodb.html
:END:

* WIP Data                                                           :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: DATA
:END:
** WIP background                                                    :TOPIC:
*** What does ACID mean?                                      :QUESTION:
:ANSWER:
- atomicity
- consistency
- isolation
- durability
:END:
*** WIP BASE
**** what does it mean?                                         :QUESTION:
:ANSWER:
- Basic Availability
- Soft-state
- Eventual consistency
:END:
*** ORM
**** What ORM (object-relational-mapping ) means                :QUESTION:
**** What is object relation impedance mismatch                 :QUESTION:
:PROPERTIES:
:learning: https://en.wikipedia.org/wiki/Object-relational_impedance_mismatch
:END:
:ANSWER:
- The object-relational impedance mismatch is a set of conceptual and technical difficulties that are often encountered when a relational database management system (RDBMS) is being served by an application program (or multiple application programs) written in an object-oriented programming language or style.
- particularly because objects or class definitions must be mapped to database tables defined by a relational schema.
:END:
**** bottom up                                                  :QUESTION:
**** tom down                                                   :QUESTION:
**** meet in the middle                                         :QUESTION:
*** CAP theorem
:PROPERTIES:
:learning: https://towardsdatascience.com/cap-theorem-and-distributed-database-management-systems-5c2be977950e
:END:
:ANSWER:
- CAP Theorem is a concept that a distributed database system can only have 2 of the 3: Consistency, Availability and Partition Tolerance.
- CAP Theorem is very important in the Big Data world, especially when we need to make trade off's between the three, based on our unique use case.
:END:
**** Beyond CAP database systems
:PROPERTIES:
:learning: http://www.grokkingsystemdesigns.com/beyond-cap-theorem/
:END:
*** Wall: Write Ahead Logs
**** what it is good for
*** Eventual Consistency
*** Multi master replication
*** OLAP
#+BEGIN_NOTE
- OnLine Transactional Processing
#+END_NOTE
*** OLTP
- OnLine Analytical Processing
*** Slowly Moving Dimensions
