public/fullstack.html
<div id="outline-container-orga5f3ee2" class="outline-4">
<h4 id="orga5f3ee2"><span class="section-number-4">2.8.1</span> What Is OpenAPI?</h4>
<div class="outline-text-4" id="text-2-8-1">
<ul class="org-ul">
<li>OpenAPI Specification (formerly known as Swagger Specification) is an open-source format for describing and documenting APIs. The Specification was originally developed in 2010 by Reverb Technologies (formerly Wordnik) as a way to keep the API design and documentation in sync. It has since become a de-facto standard for designing and describing RESTful APIs, and is used by millions of developers and organizations for developing their APIs, be it internal or client facing.</li>

<li>The latest version of OpenAPI is 3.0. OpenAPI definitions can be written in JSON or YAML. We recommend YAML, because it is easier to read and write.</li>

<li>A simple OpenAPI 3.0 specification looks like this:</li>
</ul>
<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #BA36A5;">openapi</span>: 3.0.0
<span style="color: #BA36A5;">info</span>:
  <span style="color: #BA36A5;">version</span>: 1.0.0
  <span style="color: #BA36A5;">title</span>: Sample API
  <span style="color: #BA36A5;">description</span>: A sample API to illustrate OpenAPI concepts
<span style="color: #BA36A5;">paths</span>:
  <span style="color: #BA36A5;">/list</span>:
    <span style="color: #BA36A5;">get</span>:
      <span style="color: #BA36A5;">description</span>: Returns a list of stuff              
      <span style="color: #BA36A5;">responses</span>:
        <span style="color: #008000;">'200'</span>:
          <span style="color: #BA36A5;">description</span>: Successful response
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbd465bc" class="outline-3">
<h3 id="orgbd465bc"><span class="section-number-3">2.9</span> <span class="todo WIP">WIP</span> micro-service-architecture</h3>
</div>
<div id="outline-container-org84eb218" class="outline-3">
<h3 id="org84eb218"><span class="section-number-3">2.10</span> <span class="todo WIP">WIP</span> Enterprise Architecture Integration Patterns</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-orgfbf14df" class="outline-4">
<h4 id="orgfbf14df"><span class="section-number-4">2.10.1</span> orchestration</h4>
</div>
<div id="outline-container-org9e116bd" class="outline-4">
<h4 id="org9e116bd"><span class="section-number-4">2.10.2</span> choreography</h4>
</div>
</div>
<div id="outline-container-org9b22e55" class="outline-3">
<h3 id="org9b22e55"><span class="section-number-3">2.11</span> <span class="todo TODO">TODO</span> Event Sourcing</h3>
</div>
<div id="outline-container-org81756e3" class="outline-3">
<h3 id="org81756e3"><span class="section-number-3">2.12</span> <span class="todo TODO">TODO</span> CQRS</h3>
</div>
<div id="outline-container-orgef73d14" class="outline-3">
<h3 id="orgef73d14"><span class="section-number-3">2.13</span> <span class="todo TODO">TODO</span> CRUD</h3>
</div>
<div id="outline-container-org5a622a4" class="outline-3">
<h3 id="org5a622a4"><span class="section-number-3">2.14</span> <span class="todo WIP">WIP</span> Pragmatic Design principes</h3>
<div class="outline-text-3" id="text-2-14">
</div>
<div id="outline-container-org5344665" class="outline-4">
<h4 id="org5344665"><span class="section-number-4">2.14.1</span> DRY&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org8e37c19" class="outline-4">
<h4 id="org8e37c19"><span class="section-number-4">2.14.2</span> KISS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org47597b9" class="outline-4">
<h4 id="org47597b9"><span class="section-number-4">2.14.3</span> YAGNI&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orgc52e4c8" class="outline-4">
<h4 id="orgc52e4c8"><span class="section-number-4">2.14.4</span> SOLID</h4>
</div>
<div id="outline-container-org9088c26" class="outline-4">
<h4 id="org9088c26"><span class="section-number-4">2.14.5</span> open-close principal&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org74dc5e5" class="outline-4">
<h4 id="org74dc5e5"><span class="section-number-4">2.14.6</span> High cohesion&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org657b1a3" class="outline-4">
<h4 id="org657b1a3"><span class="section-number-4">2.14.7</span> Low coupling&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-2-14-7">
</div>
<div id="outline-container-orgeab7e54" class="outline-5">
<h5 id="orgeab7e54"><span class="section-number-5">2.14.7.1</span> What is temporal coupling?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
</div>
</div>
<div id="outline-container-org74a25b5" class="outline-3">
<h3 id="org74a25b5"><span class="section-number-3">2.15</span> <span class="todo TODO">TODO</span> Antifragile architecture</h3>
</div>
<div id="outline-container-orgcca380b" class="outline-3">
<h3 id="orgcca380b"><span class="section-number-3">2.16</span> <span class="todo WIP">WIP</span> Evolutionary database design</h3>
<div class="outline-text-3" id="text-2-16">
<pre class="example">
lerning: https://martinfowler.com/articles/evodb.html
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb26eaac" class="outline-2">
<h2 id="DATA"><span class="section-number-2">3</span> <span class="todo WIP">WIP</span> Data&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-DATA">
<pre class="example">
CUSTOM_ID: DATA
</pre>
</div>
<div id="outline-container-org628d1d6" class="outline-3">
<h3 id="org628d1d6"><span class="section-number-3">3.1</span> <span class="todo WIP">WIP</span> background&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org59d0f57" class="outline-4">
<h4 id="org59d0f57"><span class="section-number-4">3.1.1</span> What does ACID mean?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-3-1-1">
<ul class="org-ul">
<li>atomicity</li>
<li>consistency</li>
<li>isolation</li>
<li>durability</li>
</ul>
</div>
</div>
<div id="outline-container-org921e552" class="outline-4">
<h4 id="org921e552"><span class="section-number-4">3.1.2</span> <span class="todo WIP">WIP</span> BASE</h4>
<div class="outline-text-4" id="text-3-1-2">
</div>
<div id="outline-container-orgd026896" class="outline-5">
<h5 id="orgd026896"><span class="section-number-5">3.1.2.1</span> what does it mean?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-2-1">
<ul class="org-ul">
<li>Basic Availability</li>
<li>Soft-state</li>
<li>Eventual consistency</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgf395ab7" class="outline-4">
<h4 id="orgf395ab7"><span class="section-number-4">3.1.3</span> ORM</h4>
<div class="outline-text-4" id="text-3-1-3">
</div>
<div id="outline-container-orgba5679b" class="outline-5">
<h5 id="orgba5679b"><span class="section-number-5">3.1.3.1</span> What ORM (object-relational-mapping ) means&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org99be721" class="outline-5">
<h5 id="org99be721"><span class="section-number-5">3.1.3.2</span> What is object relation impedance mismatch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-3-2">
<pre class="example">
learning: https://en.wikipedia.org/wiki/Object-relational_impedance_mismatch
</pre>
<ul class="org-ul">
<li>The object-relational impedance mismatch is a set of conceptual and technical difficulties that are often encountered when a relational database management system (RDBMS) is being served by an application program (or multiple application programs) written in an object-oriented programming language or style.</li>
<li>particularly because objects or class definitions must be mapped to database tables defined by a relational schema.</li>
</ul>
</div>
</div>
<div id="outline-container-orge1c7218" class="outline-5">
<h5 id="orge1c7218"><span class="section-number-5">3.1.3.3</span> bottom up&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org255cbd9" class="outline-5">
<h5 id="org255cbd9"><span class="section-number-5">3.1.3.4</span> tom down&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-orgc613fd2" class="outline-5">
<h5 id="orgc613fd2"><span class="section-number-5">3.1.3.5</span> meet in the middle&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
</div>
<div id="outline-container-orgda58aaa" class="outline-4">
<h4 id="orgda58aaa"><span class="section-number-4">3.1.4</span> CAP theorem</h4>
<div class="outline-text-4" id="text-3-1-4">
<pre class="example">
learning: https://towardsdatascience.com/cap-theorem-and-distributed-database-management-systems-5c2be977950e
</pre>
<ul class="org-ul">
<li>CAP Theorem is a concept that a distributed database system can only have 2 of the 3: Consistency, Availability and Partition Tolerance.</li>
<li>CAP Theorem is very important in the Big Data world, especially when we need to make trade off's between the three, based on our unique use case.</li>
</ul>
</div>
<div id="outline-container-orgd06a3de" class="outline-5">
<h5 id="orgd06a3de"><span class="section-number-5">3.1.4.1</span> Beyond CAP database systems</h5>
<div class="outline-text-5" id="text-3-1-4-1">
<pre class="example">
learning: http://www.grokkingsystemdesigns.com/beyond-cap-theorem/
</pre>
</div>
</div>
</div>
<div id="outline-container-org8dfada8" class="outline-4">
<h4 id="org8dfada8"><span class="section-number-4">3.1.5</span> Wall: Write Ahead Logs</h4>
<div class="outline-text-4" id="text-3-1-5">
</div>
<div id="outline-container-orgb79ff4c" class="outline-5">
<h5 id="orgb79ff4c"><span class="section-number-5">3.1.5.1</span> what it is good for</h5>
</div>
</div>
<div id="outline-container-orged76fed" class="outline-4">
<h4 id="orged76fed"><span class="section-number-4">3.1.6</span> eventual consistency</h4>
</div>
<div id="outline-container-org3732033" class="outline-4">
<h4 id="org3732033"><span class="section-number-4">3.1.7</span> Multi master replication</h4>
</div>
<div id="outline-container-org8872360" class="outline-4">
<h4 id="org8872360"><span class="section-number-4">3.1.8</span> OLAP</h4>
<div class="outline-text-4" id="text-3-1-8">
<div class="NOTE">
<ul class="org-ul">
<li>OnLine Transactional Processing</li>
</ul>

</div>
</div>
</div>
<div id="outline-container-org4b10881" class="outline-4">
<h4 id="org4b10881"><span class="section-number-4">3.1.9</span> OLTP</h4>
<div class="outline-text-4" id="text-3-1-9">
<ul class="org-ul">
<li>OnLine Analytical Processing</li>
</ul>
</div>
</div>
<div id="outline-container-org90d17e3" class="outline-4">
<h4 id="org90d17e3"><span class="section-number-4">3.1.10</span> Slowly Moving Dimensions</h4>
<div class="outline-text-4" id="text-3-1-10">
</div>
