README.org
**** What is it?                                                :QUESTION:
:ANSWER:
- Type 0 - The passive method
- Type 1 - Overwriting the old value
- Type 2 - Creating a new additional record
- Type 3 - Adding a new column
- Type 4 - Using historical table
- Type 6 - Combine approaches of types 1,2,3 (1+2+3=6)
:END:
**** Type 0 - The passive method.                               :QUESTION:
:ANSWER:
- In this method no special action is performed upon dimensional changes.
- Some dimension data can remain the same as it was first time inserted, others may be overwritten.
:END:
**** Type 1 - Overwriting the old value.                        :QUESTION:
:ANSWER:
- In this method no history of dimension changes is kept in the database.
- The old dimension value is simply overwritten be the new one.
- This type is easy to maintain and is often use for data which changes are caused by processing corrections (e.g. removal special characters, correcting spelling errors).
:END:
**** Type 2 - Creating a new additional record.                 :QUESTION:
:ANSWER:
- In this methodology all history of dimension changes is kept in the database.
- You capture attribute change by adding a new row with a new surrogate key to the dimension table.
- Both the prior and new rows contain as attributes the natural key(or other durable identifier).
- Also 'effective date' and 'current indicator' columns are used in this method. There could be only one record with current indicator set to 'Y'. For 'effective date' columns, i.e. start_date and end_date, the end_date for current record usually is set to value 9999-12-31. Introducing changes to the dimensional model in type 2 could be very expensive database operation so it is not recommended to use it in dimensions where a new attribute could be added in the future.
:END:
**** Type 3 - Adding a new column.                              :QUESTION:
:ANSWER:
- In this type usually only the current and previous value of dimension is kept in the database.
- The new value is loaded into 'current/new' column and the old one into 'old/previous' column.
- Generally speaking the history is limited to the number of column created for storing historical data. This is the least commonly needed technique.
:END:
**** Type 4 - Using historical table.                           :QUESTION:
:ANSWER:
- In this method a separate historical table is used to track all dimension's attribute historical changes for each of the dimension.
- The 'main' dimension table keeps only the current data e.g. customer and customer_history tables.
:END:
**** Type 6 - Combine approaches of types 1,2,3 (1+2+3=6).      :QUESTION:
:ANSWER:
- In this type we have in dimension table such additional columns as:

- current_type - for keeping current value of the attribute. All history records for given item of attribute have the same current value.
- historical_type - for keeping historical value of the attribute. All history records for given item of attribute could have different values.
- start_date - for keeping start date of 'effective date' of attribute's history.
- end_date - for keeping end date of 'effective date' of attribute's history.
- current_flag - for keeping information about the most recent record.

- In this method to capture attribute change we add a new record as in type 2. The current_type information is overwritten with the new one as in type 1. We store the history in a historical_column as in type 3.
:END:
*** Backup strategy
**** full vs incremental backup
**** snapshots
**** on-line replica
** WIP SQL
*** partitionning
- co to je?  rozdělení tabulek na více částí, může být vertikální či horizontální
- proč se to používá?  např. zvýšení výkonu (nevypisuji z celé tabulky ale jen z jedné partition) / zátěž rozložena na více disků  rychlejší čtení, velké tabulky které se nevejdou na disk -> vice partiton
*** inner vs outher join  
- typy spojení DB tabulek,
  - inner:  výsledek musí obsahovat průnik obou tabulek,
  - outer:  výsledek obsahuje data z jedné či druhé, případně z obou tabulek pokud klíč existuje v obou tabulkách …
- záleží na typu outer joinu - Full/left/right
*** DB Index 
- Druhy  primary/unique/(secondary) index …. Speciální: partial (na části dat definovaný where condition) / functional (nepoužívá atribut, ale funkci nad atributem/atributy) / spatial (prostorový index nad geografickými daty)
 k čemu slouží? K rychlejšímu vyhledávání v tabulce, v případě unique/primary zamezuje vložení duplicity
*** Constraint
- Omezení hodnoty vkládané do atribut, foreign key constraint  hodnota musí existovat v referenční tabulce, primary key constaint  unikátní hodnota v tabulce
*** Agregace (group by)
*** Co jsou window funkce?                                       :QUESTION:
- kalkulace/agregace nad množinou dat, přičemž každý prvek množiny může mít výsledek agregace jiný ….
- Např funkce lead/lag/rank/row_number/first/last/
*** what is a defference between CTE and temp table?             :QUESTION:
:ANSWER:
- A CTE is just that -- Common Table Expression, that is, only a syntax construct. The result set described by a CTE may never be materialized in the specified form.
- A temporary table, on the other hand, is a real database object that is initialized with the structure described by its DDL statement and possibly populated by actual rows.
:END:
*** CTE (with)  
- syntaxe pro vytvoření dočasné tabulky, kterou mohu použít v následujícím sql dotazu,
- lze pomocí ní dělat rekurzivní dotazy, výsledek je jen v paměti a neukládá se na disk (pokud mám dostatek working memory 😊 )
