public/fullstack.html
<div id="outline-container-orge1cb8d0" class="outline-5">
<h5 id="orge1cb8d0"><span class="section-number-5">3.1.10.1</span> What is it?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-1">
<ul class="org-ul">
<li>Type 0 - The passive method</li>
<li>Type 1 - Overwriting the old value</li>
<li>Type 2 - Creating a new additional record</li>
<li>Type 3 - Adding a new column</li>
<li>Type 4 - Using historical table</li>
<li>Type 6 - Combine approaches of types 1,2,3 (1+2+3=6)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc71b747" class="outline-5">
<h5 id="orgc71b747"><span class="section-number-5">3.1.10.2</span> Type 0 - The passive method.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-2">
<ul class="org-ul">
<li>In this method no special action is performed upon dimensional changes.</li>
<li>Some dimension data can remain the same as it was first time inserted, others may be overwritten.</li>
</ul>
</div>
</div>
<div id="outline-container-org7668d81" class="outline-5">
<h5 id="org7668d81"><span class="section-number-5">3.1.10.3</span> Type 1 - Overwriting the old value.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-3">
<ul class="org-ul">
<li>In this method no history of dimension changes is kept in the database.</li>
<li>The old dimension value is simply overwritten be the new one.</li>
<li>This type is easy to maintain and is often use for data which changes are caused by processing corrections (e.g. removal special characters, correcting spelling errors).</li>
</ul>
</div>
</div>
<div id="outline-container-org85cd09f" class="outline-5">
<h5 id="org85cd09f"><span class="section-number-5">3.1.10.4</span> Type 2 - Creating a new additional record.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-4">
<ul class="org-ul">
<li>In this methodology all history of dimension changes is kept in the database.</li>
<li>You capture attribute change by adding a new row with a new surrogate key to the dimension table.</li>
<li>Both the prior and new rows contain as attributes the natural key(or other durable identifier).</li>
<li>Also 'effective date' and 'current indicator' columns are used in this method. There could be only one record with current indicator set to 'Y'. For 'effective date' columns, i.e. start_date and end_date, the end_date for current record usually is set to value 9999-12-31. Introducing changes to the dimensional model in type 2 could be very expensive database operation so it is not recommended to use it in dimensions where a new attribute could be added in the future.</li>
</ul>
</div>
</div>
<div id="outline-container-org7364868" class="outline-5">
<h5 id="org7364868"><span class="section-number-5">3.1.10.5</span> Type 3 - Adding a new column.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-5">
<ul class="org-ul">
<li>In this type usually only the current and previous value of dimension is kept in the database.</li>
<li>The new value is loaded into 'current/new' column and the old one into 'old/previous' column.</li>
<li>Generally speaking the history is limited to the number of column created for storing historical data. This is the least commonly needed technique.</li>
</ul>
</div>
</div>
<div id="outline-container-org2e10c3a" class="outline-5">
<h5 id="org2e10c3a"><span class="section-number-5">3.1.10.6</span> Type 4 - Using historical table.&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-6">
<ul class="org-ul">
<li>In this method a separate historical table is used to track all dimension's attribute historical changes for each of the dimension.</li>
<li>The 'main' dimension table keeps only the current data e.g. customer and customer_history tables.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd55e672" class="outline-5">
<h5 id="orgd55e672"><span class="section-number-5">3.1.10.7</span> Type 6 - Combine approaches of types 1,2,3 (1+2+3=6).&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-1-10-7">
<ul class="org-ul">
<li>In this type we have in dimension table such additional columns as:</li>

<li>current_type - for keeping current value of the attribute. All history records for given item of attribute have the same current value.</li>
<li>historical_type - for keeping historical value of the attribute. All history records for given item of attribute could have different values.</li>
<li>start_date - for keeping start date of 'effective date' of attribute's history.</li>
<li>end_date - for keeping end date of 'effective date' of attribute's history.</li>
<li>current_flag - for keeping information about the most recent record.</li>

<li>In this method to capture attribute change we add a new record as in type 2. The current_type information is overwritten with the new one as in type 1. We store the history in a historical_column as in type 3.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgc270fc4" class="outline-4">
<h4 id="orgc270fc4"><span class="section-number-4">3.1.11</span> Backup strategy</h4>
<div class="outline-text-4" id="text-3-1-11">
</div>
<div id="outline-container-orgd3dc6e0" class="outline-5">
<h5 id="orgd3dc6e0"><span class="section-number-5">3.1.11.1</span> full vs incremental backup</h5>
</div>
<div id="outline-container-org51f106e" class="outline-5">
<h5 id="org51f106e"><span class="section-number-5">3.1.11.2</span> snapshots</h5>
</div>
<div id="outline-container-org0ac6071" class="outline-5">
<h5 id="org0ac6071"><span class="section-number-5">3.1.11.3</span> on-line replica</h5>
</div>
</div>
</div>
<div id="outline-container-orgb63c01d" class="outline-3">
<h3 id="orgb63c01d"><span class="section-number-3">3.2</span> <span class="todo WIP">WIP</span> SQL</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orgf4cb08c" class="outline-4">
<h4 id="orgf4cb08c"><span class="section-number-4">3.2.1</span> partitionning</h4>
<div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>co to je?  rozdělení tabulek na více částí, může být vertikální či horizontální</li>
<li>proč se to používá?  např. zvýšení výkonu (nevypisuji z celé tabulky ale jen z jedné partition) / zátěž rozložena na více disků  rychlejší čtení, velké tabulky které se nevejdou na disk -&gt; vice partiton</li>
</ul>
</div>
</div>
<div id="outline-container-orgf42c917" class="outline-4">
<h4 id="orgf42c917"><span class="section-number-4">3.2.2</span> inner vs outher join</h4>
<div class="outline-text-4" id="text-3-2-2">
<ul class="org-ul">
<li>typy spojení DB tabulek,
<ul class="org-ul">
<li>inner:  výsledek musí obsahovat průnik obou tabulek,</li>
<li>outer:  výsledek obsahuje data z jedné či druhé, případně z obou tabulek pokud klíč existuje v obou tabulkách …</li>
</ul></li>
<li>záleží na typu outer joinu - Full/left/right</li>
</ul>
</div>
</div>
<div id="outline-container-org231732d" class="outline-4">
<h4 id="org231732d"><span class="section-number-4">3.2.3</span> DB Index</h4>
<div class="outline-text-4" id="text-3-2-3">
<ul class="org-ul">
<li>Druhy  primary/unique/(secondary) index …. Speciální: partial (na části dat definovaný where condition) / functional (nepoužívá atribut, ale funkci nad atributem/atributy) / spatial (prostorový index nad geografickými daty)
k čemu slouží? K rychlejšímu vyhledávání v tabulce, v případě unique/primary zamezuje vložení duplicity</li>
</ul>
</div>
</div>
<div id="outline-container-org71625c8" class="outline-4">
<h4 id="org71625c8"><span class="section-number-4">3.2.4</span> Constraint</h4>
<div class="outline-text-4" id="text-3-2-4">
<ul class="org-ul">
<li>Omezení hodnoty vkládané do atribut, foreign key constraint  hodnota musí existovat v referenční tabulce, primary key constaint  unikátní hodnota v tabulce</li>
</ul>
</div>
</div>
<div id="outline-container-org7c60b54" class="outline-4">
<h4 id="org7c60b54"><span class="section-number-4">3.2.5</span> Agregace (group by)</h4>
</div>
<div id="outline-container-org02cfdb9" class="outline-4">
<h4 id="org02cfdb9"><span class="section-number-4">3.2.6</span> Co jsou window funkce?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-3-2-6">
<ul class="org-ul">
<li>kalkulace/agregace nad množinou dat, přičemž každý prvek množiny může mít výsledek agregace jiný ….</li>
<li>Např funkce lead/lag/rank/row_number/first/last/</li>
</ul>
</div>
</div>
<div id="outline-container-org1f501c6" class="outline-4">
<h4 id="org1f501c6"><span class="section-number-4">3.2.7</span> what is a defference between CTE and temp table?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-3-2-7">
<ul class="org-ul">
<li>A CTE is just that &#x2013; Common Table Expression, that is, only a syntax construct. The result set described by a CTE may never be materialized in the specified form.</li>
<li>A temporary table, on the other hand, is a real database object that is initialized with the structure described by its DDL statement and possibly populated by actual rows.</li>
</ul>
</div>
</div>
<div id="outline-container-org0ade0f2" class="outline-4">
<h4 id="org0ade0f2"><span class="section-number-4">3.2.8</span> CTE (with)</h4>
<div class="outline-text-4" id="text-3-2-8">
<ul class="org-ul">
<li>syntaxe pro vytvoření dočasné tabulky, kterou mohu použít v následujícím sql dotazu,</li>
<li>lze pomocí ní dělat rekurzivní dotazy, výsledek je jen v paměti a neukládá se na disk (pokud mám dostatek working memory 😊 )</li>
</ul>
</div>
</div>
