README.org
*** DML/DDL
- manipuklace s daty v tabulce (insert/delete/update) / definuje datové struktury (db,schema, tabulka) (create / drop / alter / rename)

** WIP Distributed consensus: 
*** Paxos                                                           :TOPIC:
:PROPERTIES:
:learning: https://en.wikipedia.org/wiki/Paxos_(computer_science)
:END:
- Paxos is a family of protocols for solving consensus in a network of unreliable or fallible processors. Consensus is the process of agreeing on one result among a group of participants. This problem becomes difficult when the participants or their communications may experience failures.[1]

- Consensus protocols are the basis for the state machine replication approach to distributed computing, as suggested by Leslie Lamport[2] and surveyed by Fred Schneider.[3] State machine replication is a technique for converting an algorithm into a fault-tolerant, distributed implementation. Ad-hoc techniques may leave important cases of failures unresolved. The principled approach proposed by Lamport et al. ensures all cases are handled safely.

- The Paxos protocol was first submitted in 1989 and named after a fictional legislative consensus system used on the Paxos island in Greece, where Lamport wrote that the parliament had to function "even though legislators continually wandered in and out of the parliamentary Chamber".[4] It was later published as a journal article in 1998.[5]

- The Paxos family of protocols includes a spectrum of trade-offs between the number of processors, number of message delays before learning the agreed value, the activity level of individual participants, number of messages sent, and types of failures. Although no deterministic fault-tolerant consensus protocol can guarantee progress in an asynchronous network (a result proved in a paper by Fischer, Lynch and Paterson[6]), Paxos guarantees safety (consistency), and the conditions that could prevent it from making progress are difficult to provoke.

- Paxos is usually used where durability is required (for example, to replicate a file or a database), in which the amount of durable state could be large. The protocol attempts to make progress even during periods when some bounded number of replicas are unresponsive. There is also a mechanism to drop a permanently failed replica or to add a new replica.
*** Raft                                                            :TOPIC:
*** Zab                                                             :TOPIC:
** WIP Transactions
*** transaction problems that are prevented by isolation:
**** What are they and what they mean?
:ASWER:
- Dirty reads
- non-repeatable reads
- phantom reads
:END:
*** JDBC transaction isolation levels
**** what are they and what they prevent from?
:ANSWER:
- TRANSACTION_READ_UNCOMMITTED
  - Dirty reads, non-repeatable reads and phantom reads can occur.
- TRANSACTION_READ_COMMITTED
  - Dirty reads are prevented; non-repeatable reads and phantom reads can occur.
- TRANSACTION_REPEATABLE_READ
  - Dirty reads and non-repeatable reads are prevented; phantom reads can occur.
- TRANSACTION_SERIALIZABLE
  - Dirty reads, non-repeatable reads and phantom reads are prevented. 
:END:
*** ANSI/ISO levels - 
**** what they are
:ANSWER:
- serializable
- repeatable read
- read committed
- read uncommitted
:END:
**** define some
:ANSWER:
- The Serializable isolation level guarantees that concurrent transactions run as they would if you would run sequentially one by one in order.
- One step weaker is the Read Repeatable isolation level that allows Phantom Reads to happen in the transaction. Contrary to transactions running in the Serializable mode, the set of rows that is returned by two consecutive select queries in a transaction can differ. This can happen if another transaction adds or removes rows from the table we are querying.
- Even weaker is the Read Commited isolation level. Two consecutive select statements in a transaction can return different data. Contrary to the Read Repeatable level, this level allows not only the set of rows to change, but also the data that those rows contain. This can happen if another transaction modifies the rows.
- The weakest isolation level is Read Uncommitted where dirty reads can occur. That means that non-committed changes from other transactions can affect a transaction.
:END:
** WIP Datawarehouse?  
- úložiště dat,
- organizovaných do určité struktury,
- pro účely analýzy dat … podpora business procesů organizace
** WIP Star schema  structure
- tvořené faktovou tabulkou (jednotlivá měření) a dimenzemi (entity popisující fakta); dimenze mohou být denormalizovánay
** WIP Snowflake schema  structure
- faktová tabulka (jednotlivá měření) + dimenze jsou normalizovány (jedna dimenze může být  složena z více tabulek)  3NF
** WIP WAL  / transactional log?  
- log kde je historie všech provedených DB operací nad danou instancí/databází.
- Z logu se zapisují záznamy do datových souborů.
- Z logu se dá obnovit databáze do určitého časového okamžiku (PITR-Point In Time Recovery);
- u postgre se dá použít například i k replikaci databáze
** WIP Tools
*** PostgreSQL
**** What is the current version of PostgreSQL                  :QUESTION:
**** Explain about Multi version concurrency control?           :QUESTION:
:ANSWER:
- Multi version concurrency control or MVCC is used to avoid unnecessary locking of the database.
- This removes the time lag for the user to log into his database.
- This feature or time lag occurs when some one else is on the content. All the transactions are kept as a record.
:END:
**** TODO psql
