public/fullstack.html
<div id="outline-container-orgba1d869" class="outline-4">
<h4 id="orgba1d869"><span class="section-number-4">3.2.9</span> DML/DDL</h4>
<div class="outline-text-4" id="text-3-2-9">
<ul class="org-ul">
<li>manipuklace s daty v tabulce (insert/delete/update) / definuje datové struktury (db,schema, tabulka) (create / drop / alter / rename)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org7e006d6" class="outline-3">
<h3 id="org7e006d6"><span class="section-number-3">3.3</span> <span class="todo WIP">WIP</span> Distributed consensus:</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org302c3b7" class="outline-4">
<h4 id="org302c3b7"><span class="section-number-4">3.3.1</span> Paxos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-3-3-1">
<pre class="example">
learning: https://en.wikipedia.org/wiki/Paxos_(computer_science)
</pre>
<ul class="org-ul">
<li>Paxos is a family of protocols for solving consensus in a network of unreliable or fallible processors. Consensus is the process of agreeing on one result among a group of participants. This problem becomes difficult when the participants or their communications may experience failures.[1]</li>

<li>Consensus protocols are the basis for the state machine replication approach to distributed computing, as suggested by Leslie Lamport[2] and surveyed by Fred Schneider.[3] State machine replication is a technique for converting an algorithm into a fault-tolerant, distributed implementation. Ad-hoc techniques may leave important cases of failures unresolved. The principled approach proposed by Lamport et al. ensures all cases are handled safely.</li>

<li>The Paxos protocol was first submitted in 1989 and named after a fictional legislative consensus system used on the Paxos island in Greece, where Lamport wrote that the parliament had to function "even though legislators continually wandered in and out of the parliamentary Chamber".[4] It was later published as a journal article in 1998.[5]</li>

<li>The Paxos family of protocols includes a spectrum of trade-offs between the number of processors, number of message delays before learning the agreed value, the activity level of individual participants, number of messages sent, and types of failures. Although no deterministic fault-tolerant consensus protocol can guarantee progress in an asynchronous network (a result proved in a paper by Fischer, Lynch and Paterson[6]), Paxos guarantees safety (consistency), and the conditions that could prevent it from making progress are difficult to provoke.</li>

<li>Paxos is usually used where durability is required (for example, to replicate a file or a database), in which the amount of durable state could be large. The protocol attempts to make progress even during periods when some bounded number of replicas are unresponsive. There is also a mechanism to drop a permanently failed replica or to add a new replica.</li>
</ul>
</div>
</div>
<div id="outline-container-org1dde2f0" class="outline-4">
<h4 id="org1dde2f0"><span class="section-number-4">3.3.2</span> Raft&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orga655291" class="outline-4">
<h4 id="orga655291"><span class="section-number-4">3.3.3</span> Zab&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
</div>
<div id="outline-container-org4075ec3" class="outline-3">
<h3 id="org4075ec3"><span class="section-number-3">3.4</span> <span class="todo WIP">WIP</span> Transactions</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org072461b" class="outline-4">
<h4 id="org072461b"><span class="section-number-4">3.4.1</span> transaction problems that are prevented by isolation:</h4>
<div class="outline-text-4" id="text-3-4-1">
</div>
<div id="outline-container-org55259d6" class="outline-5">
<h5 id="org55259d6"><span class="section-number-5">3.4.1.1</span> What are they and what they mean?</h5>
<div class="outline-text-5" id="text-3-4-1-1">
<ul class="org-ul">
<li>Dirty reads</li>
<li>non-repeatable reads</li>
<li>phantom reads</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orge0ae0c8" class="outline-4">
<h4 id="orge0ae0c8"><span class="section-number-4">3.4.2</span> JDBC transaction isolation levels</h4>
<div class="outline-text-4" id="text-3-4-2">
</div>
<div id="outline-container-org2d4d982" class="outline-5">
<h5 id="org2d4d982"><span class="section-number-5">3.4.2.1</span> what are they and what they prevent from?</h5>
<div class="outline-text-5" id="text-3-4-2-1">
<ul class="org-ul">
<li>TRANSACTION_READ_UNCOMMITTED
<ul class="org-ul">
<li>Dirty reads, non-repeatable reads and phantom reads can occur.</li>
</ul></li>
<li>TRANSACTION_READ_COMMITTED
<ul class="org-ul">
<li>Dirty reads are prevented; non-repeatable reads and phantom reads can occur.</li>
</ul></li>
<li>TRANSACTION_REPEATABLE_READ
<ul class="org-ul">
<li>Dirty reads and non-repeatable reads are prevented; phantom reads can occur.</li>
</ul></li>
<li>TRANSACTION_SERIALIZABLE
<ul class="org-ul">
<li>Dirty reads, non-repeatable reads and phantom reads are prevented.</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9dd5d5a" class="outline-4">
<h4 id="org9dd5d5a"><span class="section-number-4">3.4.3</span> ANSI/ISO levels -</h4>
<div class="outline-text-4" id="text-3-4-3">
</div>
<div id="outline-container-orgbdb0862" class="outline-5">
<h5 id="orgbdb0862"><span class="section-number-5">3.4.3.1</span> what they are</h5>
<div class="outline-text-5" id="text-3-4-3-1">
<ul class="org-ul">
<li>serializable</li>
<li>repeatable read</li>
<li>read committed</li>
<li>read uncommitted</li>
</ul>
</div>
</div>
<div id="outline-container-org2c3ddfa" class="outline-5">
<h5 id="org2c3ddfa"><span class="section-number-5">3.4.3.2</span> define some</h5>
<div class="outline-text-5" id="text-3-4-3-2">
<ul class="org-ul">
<li>The Serializable isolation level guarantees that concurrent transactions run as they would if you would run sequentially one by one in order.</li>
<li>One step weaker is the Read Repeatable isolation level that allows Phantom Reads to happen in the transaction. Contrary to transactions running in the Serializable mode, the set of rows that is returned by two consecutive select queries in a transaction can differ. This can happen if another transaction adds or removes rows from the table we are querying.</li>
<li>Even weaker is the Read Commited isolation level. Two consecutive select statements in a transaction can return different data. Contrary to the Read Repeatable level, this level allows not only the set of rows to change, but also the data that those rows contain. This can happen if another transaction modifies the rows.</li>
<li>The weakest isolation level is Read Uncommitted where dirty reads can occur. That means that non-committed changes from other transactions can affect a transaction.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orga186ff1" class="outline-3">
<h3 id="orga186ff1"><span class="section-number-3">3.5</span> <span class="todo WIP">WIP</span> Datawarehouse?</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>úložiště dat,</li>
<li>organizovaných do určité struktury,</li>
<li>pro účely analýzy dat … podpora business procesů organizace</li>
</ul>
</div>
</div>
<div id="outline-container-orgafc4c99" class="outline-3">
<h3 id="orgafc4c99"><span class="section-number-3">3.6</span> <span class="todo WIP">WIP</span> Star schema  structure</h3>
<div class="outline-text-3" id="text-3-6">
<ul class="org-ul">
<li>tvořené faktovou tabulkou (jednotlivá měření) a dimenzemi (entity popisující fakta); dimenze mohou být denormalizovánay</li>
</ul>
</div>
</div>
<div id="outline-container-org265673b" class="outline-3">
<h3 id="org265673b"><span class="section-number-3">3.7</span> <span class="todo WIP">WIP</span> Snowflake schema  structure</h3>
<div class="outline-text-3" id="text-3-7">
<ul class="org-ul">
<li>faktová tabulka (jednotlivá měření) + dimenze jsou normalizovány (jedna dimenze může být  složena z více tabulek)  3NF</li>
</ul>
</div>
</div>
<div id="outline-container-org9cec340" class="outline-3">
<h3 id="org9cec340"><span class="section-number-3">3.8</span> <span class="todo WIP">WIP</span> WAL  / transactional log?</h3>
<div class="outline-text-3" id="text-3-8">
<ul class="org-ul">
<li>log kde je historie všech provedených DB operací nad danou instancí/databází.</li>
<li>Z logu se zapisují záznamy do datových souborů.</li>
<li>Z logu se dá obnovit databáze do určitého časového okamžiku (PITR-Point In Time Recovery);</li>
<li>u postgre se dá použít například i k replikaci databáze</li>
</ul>
</div>
</div>
<div id="outline-container-org2e8fba7" class="outline-3">
<h3 id="org2e8fba7"><span class="section-number-3">3.9</span> <span class="todo WIP">WIP</span> Tools</h3>
<div class="outline-text-3" id="text-3-9">
</div>
<div id="outline-container-org6b0aeb2" class="outline-4">
<h4 id="org6b0aeb2"><span class="section-number-4">3.9.1</span> PostgreSQL</h4>
<div class="outline-text-4" id="text-3-9-1">
</div>
<div id="outline-container-orgff50610" class="outline-5">
<h5 id="orgff50610"><span class="section-number-5">3.9.1.1</span> What is the current version of PostgreSQL&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org5a1303c" class="outline-5">
<h5 id="org5a1303c"><span class="section-number-5">3.9.1.2</span> Explain about Multi version concurrency control?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-3-9-1-2">
<ul class="org-ul">
<li>Multi version concurrency control or MVCC is used to avoid unnecessary locking of the database.</li>
<li>This removes the time lag for the user to log into his database.</li>
<li>This feature or time lag occurs when some one else is on the content. All the transactions are kept as a record.</li>
</ul>
</div>
</div>
</div>
