README.org
*** ORACLE:
:ANSWER:
- READ COMMITTED (the default)
- SERIALIZABLE.
  - that what Oracle call SERIALIZABLE is actually snapshot isolation.
:END:
*** Big Table
*** Big Query
*** Elastic Search
**** Bloom Filter
*** MongoDB
*** Liquibase
- open source
- tracks DB chanegs
- allows work with data as well as with the schema
- *changeset*:
  - XML, JSON, YAML, SQL
- can use context and label for filteriing chich chnages slould be applied where
*** Apache Drill
*** Apache Cassandra
- *Open Source:* Modern software development organizations have overwhelmingly moved to adopt open source technologies, starting with the Linux operating system and progressing into infrastructure for managing data. Open source technologies are attractive because of their affordability and extensibility, as well as the flexibility to avoid vendor lock-in. Organizations adopting open source report higher speed of innovation and faster adoption.
- *Flexible, Familiar Interface:* The Cassandra Query Language (CQL) is similar to SQL, meaning most developers should have a fairly easy time becoming familiar with it. (Here’s an introduction to CQL if you need some help).
- *High Performance:* The majority of traditional databases feature a primary / secondary architecture. In these configurations, a single primary replica performs read and write operations, while secondary replicas are only able to perform read operations. Downsides to this architecture include increased latency, as well as higher costs and lower availability at scale. In Cassandra, no single node is in charge of replicating data across a cluster. Instead, every node is capable of performing all read and write operations. This improves performance and adds resiliency to the database.
- *Active Everywhere / Zero-Downtime:* Since every Cassandra node is capable of performing read and write operations, data is quickly replicated across hybrid cloud environments and geographies. In the event a node fails, users are automatically routed to the nearest healthy node. They won’t even notice that a node has been knocked offline because applications behave as designed even in the event of failure. As a result, applications are always available and data is always accessible and never lost. What’s more, Cassandra’s built-in repair services fix problems immediately after they occur—without any manual intervention. Productivity doesn’t even need to take a hit should nodes fail.
- *Scalability:* In traditional environments, scaling applications is a time-consuming and costly process typically accomplished by scaling vertically with more expensive machines. Cassandra enables you to scale horizontally by simply adding more nodes to the cluster. If, for example, four nodes can handle 200,000 transactions/second, eight nodes will be able to handle 400,000 transactions/second. (source)
- *Seamless Replication:* Today’s leading enterprises are increasingly moving to multi-data center, hybrid cloud and even multi-cloud deployments to take advantage of the strengths of various deployments without getting locked into any single provider’s ecosystem. Getting the most out of multi-cloud environments, however, starts with having an underlying cloud database that offers: scalability, security, performance, and availability. For these reasons, it should come as no surprise that the cloud database market is expected to grow nearly 65% each year and reach $68.9 billion by 2022.
* WIP Methodology                                                    :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: METHODOLOGY
:END:
** Scrum                                                             :TOPIC:
** Kanban                                                            :TOPIC:
** XP                                                                :TOPIC:
** Lean                                                              :TOPIC:
** Jira                                                              :TOPIC:
** Confluence                                                        :TOPIC:
** MOSCOW                                                            :TOPIC:
** DoD                                                               :TOPIC:
** DoR                                                               :TOPIC:
** Uml                                                               :TOPIC:
** C4                                                                :TOPIC:
** Org42                                                             :TOPIC:
* WIP Cloud                                                          :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: CLOUD
:END:
** TODO Cloud native architecture
** TODO Open Policy Agent
** TODO IaaS
** TODO PaaS
** TODO SaaS
** WIP AWS Concepts                                                  :TOPIC:
