public/fullstack.html
<div id="outline-container-orge9e7495" class="outline-4">
<h4 id="orge9e7495"><span class="section-number-4">3.9.2</span> ORACLE:</h4>
<div class="outline-text-4" id="text-3-9-2">
<ul class="org-ul">
<li>READ COMMITTED (the default)</li>
<li>SERIALIZABLE.
<ul class="org-ul">
<li>that what Oracle call SERIALIZABLE is actually snapshot isolation.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org2394632" class="outline-4">
<h4 id="org2394632"><span class="section-number-4">3.9.3</span> Big Table</h4>
</div>
<div id="outline-container-org202c585" class="outline-4">
<h4 id="org202c585"><span class="section-number-4">3.9.4</span> Big Query</h4>
</div>
<div id="outline-container-org5a0ec25" class="outline-4">
<h4 id="org5a0ec25"><span class="section-number-4">3.9.5</span> Elastic Search</h4>
<div class="outline-text-4" id="text-3-9-5">
</div>
<div id="outline-container-orgf9f188b" class="outline-5">
<h5 id="orgf9f188b"><span class="section-number-5">3.9.5.1</span> Bloom Filter</h5>
</div>
</div>
<div id="outline-container-org10061cd" class="outline-4">
<h4 id="org10061cd"><span class="section-number-4">3.9.6</span> MongoDB</h4>
</div>
<div id="outline-container-orgfad2189" class="outline-4">
<h4 id="orgfad2189"><span class="section-number-4">3.9.7</span> Liquibase</h4>
<div class="outline-text-4" id="text-3-9-7">
<ul class="org-ul">
<li>open source</li>
<li>tracks DB chanegs</li>
<li>allows work with data as well as with the schema</li>
<li><b>changeset</b>:
<ul class="org-ul">
<li>XML, JSON, YAML, SQL</li>
</ul></li>
<li>can use context and label for filteriing chich chnages slould be applied where</li>
</ul>
</div>
</div>
<div id="outline-container-orgef928f5" class="outline-4">
<h4 id="orgef928f5"><span class="section-number-4">3.9.8</span> Apache Drill</h4>
</div>
<div id="outline-container-org52cd471" class="outline-4">
<h4 id="org52cd471"><span class="section-number-4">3.9.9</span> Apache Cassandra</h4>
<div class="outline-text-4" id="text-3-9-9">
<ul class="org-ul">
<li><b>Open Source:</b> Modern software development organizations have overwhelmingly moved to adopt open source technologies, starting with the Linux operating system and progressing into infrastructure for managing data. Open source technologies are attractive because of their affordability and extensibility, as well as the flexibility to avoid vendor lock-in. Organizations adopting open source report higher speed of innovation and faster adoption.</li>
<li><b>Flexible, Familiar Interface:</b> The Cassandra Query Language (CQL) is similar to SQL, meaning most developers should have a fairly easy time becoming familiar with it. (Here’s an introduction to CQL if you need some help).</li>
<li><b>High Performance:</b> The majority of traditional databases feature a primary / secondary architecture. In these configurations, a single primary replica performs read and write operations, while secondary replicas are only able to perform read operations. Downsides to this architecture include increased latency, as well as higher costs and lower availability at scale. In Cassandra, no single node is in charge of replicating data across a cluster. Instead, every node is capable of performing all read and write operations. This improves performance and adds resiliency to the database.</li>
<li><b>Active Everywhere / Zero-Downtime:</b> Since every Cassandra node is capable of performing read and write operations, data is quickly replicated across hybrid cloud environments and geographies. In the event a node fails, users are automatically routed to the nearest healthy node. They won’t even notice that a node has been knocked offline because applications behave as designed even in the event of failure. As a result, applications are always available and data is always accessible and never lost. What’s more, Cassandra’s built-in repair services fix problems immediately after they occur—without any manual intervention. Productivity doesn’t even need to take a hit should nodes fail.</li>
<li><b>Scalability:</b> In traditional environments, scaling applications is a time-consuming and costly process typically accomplished by scaling vertically with more expensive machines. Cassandra enables you to scale horizontally by simply adding more nodes to the cluster. If, for example, four nodes can handle 200,000 transactions/second, eight nodes will be able to handle 400,000 transactions/second. (source)</li>
<li><b>Seamless Replication:</b> Today’s leading enterprises are increasingly moving to multi-data center, hybrid cloud and even multi-cloud deployments to take advantage of the strengths of various deployments without getting locked into any single provider’s ecosystem. Getting the most out of multi-cloud environments, however, starts with having an underlying cloud database that offers: scalability, security, performance, and availability. For these reasons, it should come as no surprise that the cloud database market is expected to grow nearly 65% each year and reach $68.9 billion by 2022.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfab851d" class="outline-2">
<h2 id="METHODOLOGY"><span class="section-number-2">4</span> <span class="todo WIP">WIP</span> Methodology&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-METHODOLOGY">
<pre class="example">
CUSTOM_ID: METHODOLOGY
</pre>
</div>
<div id="outline-container-orgc37ef73" class="outline-3">
<h3 id="orgc37ef73"><span class="section-number-3">4.1</span> Scrum&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orgc60f615" class="outline-3">
<h3 id="orgc60f615"><span class="section-number-3">4.2</span> Kanban&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orgdc70b35" class="outline-3">
<h3 id="orgdc70b35"><span class="section-number-3">4.3</span> XP&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org6ac8f42" class="outline-3">
<h3 id="org6ac8f42"><span class="section-number-3">4.4</span> Lean&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org1020c3c" class="outline-3">
<h3 id="org1020c3c"><span class="section-number-3">4.5</span> Jira&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org5fe0e61" class="outline-3">
<h3 id="org5fe0e61"><span class="section-number-3">4.6</span> Confluence&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orga62a8d0" class="outline-3">
<h3 id="orga62a8d0"><span class="section-number-3">4.7</span> MOSCOW&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org1c8594b" class="outline-3">
<h3 id="org1c8594b"><span class="section-number-3">4.8</span> DoD&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orgbefa26e" class="outline-3">
<h3 id="orgbefa26e"><span class="section-number-3">4.9</span> DoR&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org6f080c4" class="outline-3">
<h3 id="org6f080c4"><span class="section-number-3">4.10</span> Uml&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org9fda5ba" class="outline-3">
<h3 id="org9fda5ba"><span class="section-number-3">4.11</span> C4&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orgc2b7b2e" class="outline-3">
<h3 id="orgc2b7b2e"><span class="section-number-3">4.12</span> Org42&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
</div>
<div id="outline-container-org7732d34" class="outline-2">
<h2 id="CLOUD"><span class="section-number-2">5</span> <span class="todo WIP">WIP</span> Cloud&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-CLOUD">
<pre class="example">
CUSTOM_ID: CLOUD
</pre>
</div>
<div id="outline-container-org86edb01" class="outline-3">
<h3 id="org86edb01"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Cloud native architecture</h3>
</div>
<div id="outline-container-orgc6128cb" class="outline-3">
<h3 id="orgc6128cb"><span class="section-number-3">5.2</span> <span class="todo TODO">TODO</span> Open Policy Agent</h3>
</div>
