README.org
*** Regions
- Each Amazon EC2 Region is designed to be isolated from the other Amazon EC2 Regions. This achieves the greatest possible fault tolerance and stability.
- When you view your resources, you see only the resources that are tied to the Region that you specified. This is because Regions are isolated from each other, and we don't automatically replicate resources across Regions.
- When you launch an instance, you must select an AMI that's in the same Region. If the AMI is in another Region, you can copy the AMI to the Region you're using. For more information, see Copying an AMI.

| Code           | Name                       | Opt-in Status | Local Zone        |
| us-east-2      | US East (Ohio)             | Not required  | Not available     |
| us-east-1      | US East (N. Virginia)      | Not required  | Not available     |
| us-west-1      | US West (N. California)    | Not required  | Not available     |
| us-west-2      | US West (Oregon)           | Not required  | us-west-2-lax-1a  |
| us-west-2      | US West (Oregon)           | Not required  | aus-west-2-lax-1b |
| af-south-1     | Africa (Cape Town)         | Required      | Not available     |
| ap-east-1      | Asia Pacific (Hong Kong)   | Required      | Not available     |
| ap-south-1     | Asia Pacific (Mumbai)      | Not required  | Not available     |
| ap-northeast-3 | Asia Pacific (Osaka-Local) | Not required  | Not available     |
| ap-northeast-2 | Asia Pacific (Seoul)       | Not required  | Not available     |
| ap-southeast-1 | Asia Pacific (Singapore)   | Not required  | Not available     |
| ap-southeast-2 | Asia Pacific (Sydney)      | Not required  | Not available     |
| ap-northeast-1 | Asia Pacific (Tokyo)       | Not required  | Not available     |
| ca-central-1   | Canada (Central)           | Not required  | Not available     |   
| eu-central-1   | Europe (Frankfurt)         | Not required  | Not available     |   
| eu-west-1      | Europe (Ireland)           | Not required  | Not available     |   
| eu-west-2      | Europe (London)            | Not required  | Not available     |   
| eu-south-1     | Europe (Milan)             | Required      | Not available     |   
| eu-west-3      | Europe (Paris)             | Not required  | Not available     |   
| eu-north-1     | Europe (Stockholm)         | Not required  | Not available     |   
| me-south-1     | Middle East (Bahrain)      | Required      | Not available     |   
| sa-east-1      | South America (São Paulo)  | Not required  | Not available     |  

*** Availability Zones
- Each Region has multiple, isolated locations known as Availability Zones. - When you launch an instance, you can select an Availability Zone or let us choose one for you. If you distribute your instances across multiple Availability Zones and one instance fails, you can design your application so that an instance in another Availability Zone can handle requests.
** WIP AWS Services                                                  :TOPIC:
*** EC2 (Amazon Elastic Compute Cloud)
**** AMI
*** ELB CLB ALB
*** EFS
*** Route53
*** Beanstalk
*** RDS
*** AWS Wavelength
- AWS Wavelength allows developers to build applications that deliver ultra-low latencies to mobile devices and end users. Wavelength deploys standard AWS compute and storage services to the edge of telecommunication carriers' 5G networks. Developers can extend an Amazon Virtual Private Cloud (VPC) to one or more Wavelength Zones, and then use AWS resources like Amazon Elastic Compute Cloud (EC2) instances to run applications that require ultra-low latency and a connection to AWS services in the Region.
** AWS cli 
- boto3
- aws-shell
** GCP Services                                                      :TOPIC:
*** TODO bigquery
*** TODO composer
*** TODO dataflow
*** TODO firestore
*** TODO automl
*** TODO dataproc
*** TODO secretmanager
*** TODO pubsub
*** TODO iam
*** WIP aim:service accounts
:PROPERTIES:
:learning: https://cloud.google.com/iam/docs/understanding-service-accounts
:END:
- A service account is a special type of Google account intended to represent a non-human user that needs to authenticate and be authorized to access data in Google APIs.
- Typically, service accounts are used in scenarios such as:
  - Running workloads on virtual machines (VMs).
  - Running workloads on on-premises workstations or data centers that call Google APIs.
  - Running workloads which are not tied to the lifecycle of a human user.
- Your application assumes the identity of the service account to call Google APIs, so that the users aren't directly involved.

** GCP CLI                                                           :TOPIC:
- gcloud

** FINOPS                                                            :TOPIC:
*** GCP Cost Model
*** AWS Cost Model
