public/fullstack.html
<div id="outline-container-org2c7c5c3" class="outline-3">
<h3 id="org2c7c5c3"><span class="section-number-3">5.3</span> <span class="todo TODO">TODO</span> IaaS</h3>
</div>
<div id="outline-container-org243cb0a" class="outline-3">
<h3 id="org243cb0a"><span class="section-number-3">5.4</span> <span class="todo TODO">TODO</span> PaaS</h3>
</div>
<div id="outline-container-orgeedad8c" class="outline-3">
<h3 id="orgeedad8c"><span class="section-number-3">5.5</span> <span class="todo TODO">TODO</span> SaaS</h3>
</div>
<div id="outline-container-org579b3d5" class="outline-3">
<h3 id="org579b3d5"><span class="section-number-3">5.6</span> <span class="todo WIP">WIP</span> AWS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-5-6">
</div>
<div id="outline-container-org7deb3df" class="outline-4">
<h4 id="org7deb3df"><span class="section-number-4">5.6.1</span> EC2 (Amazon Elastic Compute Cloud)</h4>
<div class="outline-text-4" id="text-5-6-1">
</div>
<div id="outline-container-orgcabb379" class="outline-5">
<h5 id="orgcabb379"><span class="section-number-5">5.6.1.1</span> AMI</h5>
</div>
</div>
<div id="outline-container-orgcf41495" class="outline-4">
<h4 id="orgcf41495"><span class="section-number-4">5.6.2</span> Regions</h4>
<div class="outline-text-4" id="text-5-6-2">
<ul class="org-ul">
<li>Each Amazon EC2 Region is designed to be isolated from the other Amazon EC2 Regions. This achieves the greatest possible fault tolerance and stability.</li>
<li>When you view your resources, you see only the resources that are tied to the Region that you specified. This is because Regions are isolated from each other, and we don't automatically replicate resources across Regions.</li>
<li>When you launch an instance, you must select an AMI that's in the same Region. If the AMI is in another Region, you can copy the AMI to the Region you're using. For more information, see Copying an AMI.</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Code</td>
<td class="org-left">Name</td>
<td class="org-left">Opt-in Status</td>
<td class="org-left">Local Zone</td>
</tr>

<tr>
<td class="org-left">us-east-2</td>
<td class="org-left">US East (Ohio)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">us-east-1</td>
<td class="org-left">US East (N. Virginia)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">us-west-1</td>
<td class="org-left">US West (N. California)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">us-west-2</td>
<td class="org-left">US West (Oregon)</td>
<td class="org-left">Not required</td>
<td class="org-left">us-west-2-lax-1a</td>
</tr>

<tr>
<td class="org-left">us-west-2</td>
<td class="org-left">US West (Oregon)</td>
<td class="org-left">Not required</td>
<td class="org-left">aus-west-2-lax-1b</td>
</tr>

<tr>
<td class="org-left">af-south-1</td>
<td class="org-left">Africa (Cape Town)</td>
<td class="org-left">Required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-east-1</td>
<td class="org-left">Asia Pacific (Hong Kong)</td>
<td class="org-left">Required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-south-1</td>
<td class="org-left">Asia Pacific (Mumbai)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-northeast-3</td>
<td class="org-left">Asia Pacific (Osaka-Local)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-northeast-2</td>
<td class="org-left">Asia Pacific (Seoul)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-southeast-1</td>
<td class="org-left">Asia Pacific (Singapore)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-southeast-2</td>
<td class="org-left">Asia Pacific (Sydney)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ap-northeast-1</td>
<td class="org-left">Asia Pacific (Tokyo)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">ca-central-1</td>
<td class="org-left">Canada (Central)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-central-1</td>
<td class="org-left">Europe (Frankfurt)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-west-1</td>
<td class="org-left">Europe (Ireland)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-west-2</td>
<td class="org-left">Europe (London)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-south-1</td>
<td class="org-left">Europe (Milan)</td>
<td class="org-left">Required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-west-3</td>
<td class="org-left">Europe (Paris)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">eu-north-1</td>
<td class="org-left">Europe (Stockholm)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">me-south-1</td>
<td class="org-left">Middle East (Bahrain)</td>
<td class="org-left">Required</td>
<td class="org-left">Not available</td>
</tr>

<tr>
<td class="org-left">sa-east-1</td>
<td class="org-left">South America (São Paulo)</td>
<td class="org-left">Not required</td>
<td class="org-left">Not available</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgc962156" class="outline-4">
<h4 id="orgc962156"><span class="section-number-4">5.6.3</span> Availability Zones</h4>
<div class="outline-text-4" id="text-5-6-3">
<ul class="org-ul">
<li>Each Region has multiple, isolated locations known as Availability Zones. - When you launch an instance, you can select an Availability Zone or let us choose one for you. If you distribute your instances across multiple Availability Zones and one instance fails, you can design your application so that an instance in another Availability Zone can handle requests.</li>
</ul>
</div>
</div>
<div id="outline-container-org6cdc10f" class="outline-4">
<h4 id="org6cdc10f"><span class="section-number-4">5.6.4</span> ELB CLB ALB</h4>
</div>
<div id="outline-container-org5c2547c" class="outline-4">
<h4 id="org5c2547c"><span class="section-number-4">5.6.5</span> EFS</h4>
</div>
<div id="outline-container-orgee6b2a0" class="outline-4">
<h4 id="orgee6b2a0"><span class="section-number-4">5.6.6</span> Route53</h4>
</div>
<div id="outline-container-org809fc00" class="outline-4">
<h4 id="org809fc00"><span class="section-number-4">5.6.7</span> Beanstalk</h4>
</div>
<div id="outline-container-org75677bd" class="outline-4">
<h4 id="org75677bd"><span class="section-number-4">5.6.8</span> RDS</h4>
</div>
<div id="outline-container-org3ce50cb" class="outline-4">
<h4 id="org3ce50cb"><span class="section-number-4">5.6.9</span> AWS Wavelength</h4>
<div class="outline-text-4" id="text-5-6-9">
<ul class="org-ul">
<li>AWS Wavelength allows developers to build applications that deliver ultra-low latencies to mobile devices and end users. Wavelength deploys standard AWS compute and storage services to the edge of telecommunication carriers' 5G networks. Developers can extend an Amazon Virtual Private Cloud (VPC) to one or more Wavelength Zones, and then use AWS resources like Amazon Elastic Compute Cloud (EC2) instances to run applications that require ultra-low latency and a connection to AWS services in the Region.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3d666a7" class="outline-3">
<h3 id="org3d666a7"><span class="section-number-3">5.7</span> GCP Services&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-5-7">
</div>
<div id="outline-container-org1bb4c22" class="outline-4">
<h4 id="org1bb4c22"><span class="section-number-4">5.7.1</span> <span class="todo TODO">TODO</span> bigquery</h4>
</div>
<div id="outline-container-org898dd26" class="outline-4">
<h4 id="org898dd26"><span class="section-number-4">5.7.2</span> <span class="todo TODO">TODO</span> composer</h4>
</div>
<div id="outline-container-org8ab69b5" class="outline-4">
<h4 id="org8ab69b5"><span class="section-number-4">5.7.3</span> <span class="todo TODO">TODO</span> dataflow</h4>
</div>
<div id="outline-container-org13c1b97" class="outline-4">
<h4 id="org13c1b97"><span class="section-number-4">5.7.4</span> <span class="todo TODO">TODO</span> firestore</h4>
</div>
<div id="outline-container-orgbcdee4b" class="outline-4">
<h4 id="orgbcdee4b"><span class="section-number-4">5.7.5</span> <span class="todo TODO">TODO</span> automl</h4>
</div>
<div id="outline-container-org939f515" class="outline-4">
<h4 id="org939f515"><span class="section-number-4">5.7.6</span> <span class="todo TODO">TODO</span> dataproc</h4>
</div>
<div id="outline-container-org941272f" class="outline-4">
<h4 id="org941272f"><span class="section-number-4">5.7.7</span> <span class="todo TODO">TODO</span> secretmanager</h4>
</div>
<div id="outline-container-orgc624797" class="outline-4">
<h4 id="orgc624797"><span class="section-number-4">5.7.8</span> <span class="todo TODO">TODO</span> pubsub</h4>
</div>
<div id="outline-container-orge5e2ca6" class="outline-4">
<h4 id="orge5e2ca6"><span class="section-number-4">5.7.9</span> <span class="todo TODO">TODO</span> iam</h4>
</div>
<div id="outline-container-org09f278c" class="outline-4">
<h4 id="org09f278c"><span class="section-number-4">5.7.10</span> <span class="todo WIP">WIP</span> aim:service accounts</h4>
<div class="outline-text-4" id="text-5-7-10">
<pre class="example">
learning: https://cloud.google.com/iam/docs/understanding-service-accounts
</pre>
<ul class="org-ul">
<li>A service account is a special type of Google account intended to represent a non-human user that needs to authenticate and be authorized to access data in Google APIs.</li>
<li>Typically, service accounts are used in scenarios such as:
<ul class="org-ul">
<li>Running workloads on virtual machines (VMs).</li>
<li>Running workloads on on-premises workstations or data centers that call Google APIs.</li>
<li>Running workloads which are not tied to the lifecycle of a human user.</li>
</ul></li>
<li>Your application assumes the identity of the service account to call Google APIs, so that the users aren't directly involved.</li>
</ul>
</div>
</div>
</div>
