public/fullstack.html
<div id="outline-container-org20a0d3a" class="outline-3">
<h3 id="org20a0d3a"><span class="section-number-3">5.8</span> FINOPS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-5-8">
</div>
<div id="outline-container-org529048f" class="outline-4">
<h4 id="org529048f"><span class="section-number-4">5.8.1</span> GCP Cost Model</h4>
</div>
<div id="outline-container-org20f2cc1" class="outline-4">
<h4 id="org20f2cc1"><span class="section-number-4">5.8.2</span> AWS Cost Model</h4>
</div>
<div id="outline-container-orgfb4d985" class="outline-4">
<h4 id="orgfb4d985"><span class="section-number-4">5.8.3</span> data at rest cost</h4>
</div>
<div id="outline-container-org42dba4a" class="outline-4">
<h4 id="org42dba4a"><span class="section-number-4">5.8.4</span> transfer cost</h4>
</div>
<div id="outline-container-orgc3b0cd1" class="outline-4">
<h4 id="orgc3b0cd1"><span class="section-number-4">5.8.5</span> CPU cost</h4>
</div>
</div>
<div id="outline-container-org0edace8" class="outline-3">
<h3 id="org0edace8"><span class="section-number-3">5.9</span> Storage:</h3>
<div class="outline-text-3" id="text-5-9">
</div>
<div id="outline-container-orgff0bc40" class="outline-4">
<h4 id="orgff0bc40"><span class="section-number-4">5.9.1</span> AWS S3</h4>
</div>
<div id="outline-container-org3c53e0d" class="outline-4">
<h4 id="org3c53e0d"><span class="section-number-4">5.9.2</span> GCS bucket</h4>
<div class="outline-text-4" id="text-5-9-2">
</div>
<div id="outline-container-org7e9df74" class="outline-5">
<h5 id="org7e9df74"><span class="section-number-5">5.9.2.1</span> api</h5>
</div>
<div id="outline-container-org513cf7c" class="outline-5">
<h5 id="org513cf7c"><span class="section-number-5">5.9.2.2</span> what it is good for</h5>
</div>
</div>
<div id="outline-container-org670b02f" class="outline-4">
<h4 id="org670b02f"><span class="section-number-4">5.9.3</span> <span class="todo WIP">WIP</span> MinIO Object Storage</h4>
<div class="outline-text-4" id="text-5-9-3">
<pre class="example">
learning: https://min.io/product/overview
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1e5c78b" class="outline-2">
<h2 id="DEVOPS"><span class="section-number-2">6</span> <span class="todo WIP">WIP</span> DEVOPS / SRE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-DEVOPS">
<pre class="example">
CUSTOM_ID: DEVOPS
</pre>
</div>
<div id="outline-container-org38d060b" class="outline-3">
<h3 id="org38d060b"><span class="section-number-3">6.1</span> Culture</h3>
<div class="outline-text-3" id="text-6-1">
<pre class="example">
lerning: https://blog.sonatype.com/principle-based-devops-frameworks-three-ways
</pre>
</div>
<div id="outline-container-orge852fbf" class="outline-4">
<h4 id="orge852fbf"><span class="section-number-4">6.1.1</span> <span class="todo TODO">TODO</span> The Three Ways</h4>
<div class="outline-text-4" id="text-6-1-1">
<pre class="example">
lerning: https://blog.sonatype.com/principle-based-devops-frameworks-three-ways
</pre>

<p>
The Phoenix Project/DevOps Handbook’s Three Ways
If you’ve read either The Phoenix Project or The DevOps Handbook, you’ve been introduced to The Three Ways framework for DevOps:
</p>

<ul class="org-ul">
<li>The First Way: Principles of Flow</li>
<li>The Second Way: Principles of Feedback</li>
<li>The Third Way: Principles of Continuous Learning</li>
</ul>
</div>

<div id="outline-container-org139fc6c" class="outline-5">
<h5 id="org139fc6c"><span class="section-number-5">6.1.1.1</span> The First Way: Principles of Flow</h5>
<div class="outline-text-5" id="text-6-1-1-1">
<p>
The First Way is mostly concerned with accelerating the “flow” of work throughout a process. Gene Kim also refers to the First Way as Systems Thinking in his article The Three Ways: Principles Underpinning DevOps. Whether you’re calling it Flow or Systems Thinking, the principles underpinning the First Way are working toward the same end: viewing the flow of work as one continuous system (unsiloed) that can be continually refined and optimized.
</p>

<p>
Some of the key principles of the First Way are:
</p>
<ul class="org-ul">
<li><b>Making work “visible”.</b> Unlike manufacturing processes, which are easily observable on a plant floor, the flow of software through its development lifecycle is not easily seen. Using methods such as Kanban boards can surface the activities going on behind the scenes, by showing the left-to-right movement of a user story through the development phases.</li>
<li><b>Limiting work-in-progress (WIP).</b> Keeping work-in-progress to a minimum has also been shown to accelerate work flow, because it minimizes multi-tasking and context-switching.</li>
<li><b>Reducing batch sizes</b>. “Chunking” work into smaller pieces like a two-week sprint can also help deliver features (albeit smaller ones) and bug fixes to the customer faster. Issues are often caught earlier when those updates and additions are released sooner.</li>
<li><b>Reducing hand-offs between teams.</b> The risk of “dropping the baton” increases as the hand-offs do. Although hand-offs can’t be completely minimized, the key is to keep the teams in tight communication with one another so that the hand-off itself is almost a non-event rather than a large ordeal with the potential for communication missteps along the way.</li>
<li><b>Identifying and removing constraints and waste.</b> Constraints might be bottlenecks in the process, such as environments, test setup, and overly tight architecture, while waste includes things like manual work, heroics, and context-switching.</li>
</ul>
</div>
</div>
<div id="outline-container-org07138f8" class="outline-5">
<h5 id="org07138f8"><span class="section-number-5">6.1.1.2</span> The Second Way: Principles of Feedback</h5>
<div class="outline-text-5" id="text-6-1-1-2">
<p>
The Second Way works to enable fast and constant feedback cycles throughout all stages of a development cycle.
</p>

<p>
Some of the key principles of the Second Way are:
</p>
<ul class="org-ul">
<li><b>Swarming and solving problems to build new knowledge.</b> This principle fits into the “fail fast” mentality, so that teams can find issues with an implementation as soon as possible and address them early and often as iterations continue.</li>
<li><b>Pushing quality closer to source.</b> This principle is at the core of the DevSecOps movement, which is concerned with addressing security concerns during the development cycle, instead of at the end, when rework to remediate is more difficult and costly.</li>
<li><b>Optimizing for downstream work centers.</b>  This principle works against the “throw it over the wall” mentality, by underscoring that development should be just as invested in their application being deployable, working with operations to bridge that gap (and vice versa).</li>
</ul>
</div>
</div>
<div id="outline-container-orgf350bec" class="outline-5">
<h5 id="orgf350bec"><span class="section-number-5">6.1.1.3</span> The Third Way: Principles of Continuous Learning</h5>
<div class="outline-text-5" id="text-6-1-1-3">
<p>
The Third Way seeks to create a culture of continual learning and experimentation within the development organization.
</p>

<p>
Some of the key principles of the Third Way are:
</p>
<ul class="org-ul">
<li><b>Enabling organizational learning and a safety culture.</b> Leaders must help “set the tone” for the organization, making it okay to learn, make mistakes, and try again.</li>
<li><b>Institutionalizing the improvement of daily work.</b> Improving what you do and how you accomplish it should be part of everyone’s daily thinking and call to action.</li>
<li><b>Transforming local discoveries to global improvements.</b> Surfacing and sharing improvements at all levels will help enable a “bubble up” culture of continuous improvement.</li>
<li><b>Injecting resilience patterns into daily work.</b> Some examples might include rehearsing failures, and working toward improving key metrics for deployment.</li>
<li><b>Leaders enforcing a learning culture.</b> Organization-wide learning is unlikely to take hold and become pervasive unless it is sanctioned and exemplified by its leaders. So being intentional about communicating the value of learning and problem-solving is crucial to building that culture.</li>
</ul>
</div>
</div>
</div>
