README.org
*** CALMS (Culture, Automation, Lean, Measurement, Sharing)
:PROPERTIES:
:lerning:  https://blog.sonatype.com/principle-based-devops-frameworks-calms
:END:
Created by Jez Humble, co-author of The DevOps Handbook and Accelerate, the CALMS framework is used as a means of assessing whether an organization is ready to adopt DevOps processes, or how an organization is progressing in their DevOps transformation. It is based on the following five pillars:

- *Culture.* Before silos can be torn down, there needs to be a culture of shared responsibility, or at least a group of people devoted to establishing that culture in a grassroots type of way, with management approval and support.
- *Automation.* Similar to the technical practices centered around continuous delivery mentioned above, teams undertaking a DevOps transformation should be devoted to automating as many manual tasks as possible, especially with respect to continuous integration and test automation.
- *Lean.* Development teams are making use of lean principles to eliminate waste and optimize the value stream, such as minimizing WIP, making work visible, and reducing hand-off complexity and wait times.
- *Measurement.* The organization is devoted to collecting data on their processes, deployments, etc., in order to understand their current capabilities and where improvements could be achieved.
- *Sharing.* A culture of openness and sharing within and between teams (and enabled with the proper tools) keeps everyone working toward the same goals and eases friction with hand-offs when issues arise.
** Tools
*** DNS
:PROPERTIES:
:learning: https://www.freshersemploy.com/dns-interview-questions-answers/
:END:
**** What is DNS?
- Domain Name Systems(DNS) maps domain names with Internet Protocol(IP) address, thus helping computer for translating human-readable(domain name) to machine-readable language(IP address).
**** What is Nameserver?
- It is used for storing the information for the domain name to IP and IP to the domain name. In other words, the name server is used for storing records of the domain names, Name servers help for convert domain name to IP address.
**** What is DNS Spoofing?
- DNS Spoofing occurs when a hacker is redirecting website traffic maliciously to spread the malware or to compromise the user's data through forged DNS record.

- When a user visits a website(like freshersemploy.com) in a browser, it needs to be resolved from human-readable to machine-readable(i.e. IP addresses) using DNS resolver. To decrease the time and resolve faster, DNS resolvers cache the data and store for a specific time(until it expires). An attacker can inject forged DNS entry, thus causing DNS Cache Poisoning and instead of freshersemploy.com, the attacker will redirect it to the wrong domain or fake website.
**** How can we prevent DNS Spoofing?

DNS Spoofing or DNS Cache Poisoning can be avoided by following guidelines:

- From a users point of view, it is almost impossible for users to detect whether the DNS records are compromised, but users should be alerted when accessing the sites like banking, payment website where credit card details are used by checking the domain name in the browser and does it have a valid SSL certificate.
- Domain owner and DNS provider cannot avoid DNS Spoofing but surely can take protective measures to avoid the compromise of DNS records.
  - Using Domain Name System Security Extensions(DNSSEC) which helps in determining the DNS records authenticity by signing each request with certified signature and this is recommended by ICANN. Still this in process of implementation.
**** What is Round Robin DNS? What is the purpose of it?

Round Robin DNS is a technique for load distribution, load balancing, fault-tolerance service such as mail server, FTP server etc. which enables
distribution of load evenly among multiple servers using various DNS A addresses.

Suppose a domain abc.com is configured with Round robin DNS which has 3 potential IP mapping to the same domain(i.e. freshersemploy.com) as follows:

- freshersemploy.com -- 104.28.26.01
- freshersemploy.com -- 104.28.26.02
- freshersemploy.com -- 104.28.26.03

Then the first request will go to 104.28.26.01, the second request will go to 104.28.26.02 and the third request will go to 104.28.26.03, thus DNS
queries are responded by returning IP addresses in a rotation.
**** What is primary and secondary name server?
- Primary name server reads the data from the domain zone, it has DNS records of domain names and it replicates the data with the secondary name server.
- A secondary name server is the back up of primary name server which is used for high reliability, in case the primary name server is having an issue or not reachable.
**** What is DNS resolver?
- DNS resolvers are being used by ISP (Internet service provider) for the user request to resolve the domain name. If a user request for google.com, DNS resolver needs to contact TLD(Top Level Domain) i.e. .com, for translation of domain name to IP address and it caches the data if the user again queries for the same domain, thus reducing the loads on the server and response time.
**** What is the difference between URL and Domain?
- URL stands for Uniform Resource Locator. URL specifies the full address of a webpage. It consists of three components: protocol(like HTTP, mailto, ftp), domain name(like freshersemploy.com) and file name(eg. homepage.html)
- e.g.:
  - [[https://www.freshersemploy.com/]]
  - [[https://www.freshersemploy.com/html-interview-questions-answers/]]
  - [[mailto:admin@freshersemploy.com]]

- A domain is the name of a website with the top-level domain(like .com, .org etc.). A domain is a part of URL.
- e.g.:
  - [[https://www.freshersemploy.com/]]
  - [[mailto:admin@freshersemploy.com][admin@freshersemploy.com]]

**** What is DNS server?
- DNS servers resolve IP address to respective hostnames and it maintains directory or database to store the information.
- When we try to access the website (like /*freshersemploy.com)*/, DNS servers help to translate to machine-readable language i.e. IP address (like /*104.28.27.67*/).
**** What are the different types of records in DNS?
- Some of commonly used of DNS records are A, CNAME, NS, MX, PTR, SOA etc.
