public/fullstack.html
<div id="outline-container-orgd75e4c4" class="outline-4">
<h4 id="orgd75e4c4"><span class="section-number-4">6.1.2</span> ACCELERATE</h4>
</div>
<div id="outline-container-org2bb1527" class="outline-4">
<h4 id="org2bb1527"><span class="section-number-4">6.1.3</span> CALMS (Culture, Automation, Lean, Measurement, Sharing)</h4>
<div class="outline-text-4" id="text-6-1-3">
<pre class="example">
lerning: https://blog.sonatype.com/principle-based-devops-frameworks-calms
</pre>
<p>
Created by Jez Humble, co-author of The DevOps Handbook and Accelerate, the CALMS framework is used as a means of assessing whether an organization is ready to adopt DevOps processes, or how an organization is progressing in their DevOps transformation. It is based on the following five pillars:
</p>

<ul class="org-ul">
<li><b>Culture.</b> Before silos can be torn down, there needs to be a culture of shared responsibility, or at least a group of people devoted to establishing that culture in a grassroots type of way, with management approval and support.</li>
<li><b>Automation.</b> Similar to the technical practices centered around continuous delivery mentioned above, teams undertaking a DevOps transformation should be devoted to automating as many manual tasks as possible, especially with respect to continuous integration and test automation.</li>
<li><b>Lean.</b> Development teams are making use of lean principles to eliminate waste and optimize the value stream, such as minimizing WIP, making work visible, and reducing hand-off complexity and wait times.</li>
<li><b>Measurement.</b> The organization is devoted to collecting data on their processes, deployments, etc., in order to understand their current capabilities and where improvements could be achieved.</li>
<li><b>Sharing.</b> A culture of openness and sharing within and between teams (and enabled with the proper tools) keeps everyone working toward the same goals and eases friction with hand-offs when issues arise.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org4039459" class="outline-3">
<h3 id="org4039459"><span class="section-number-3">6.2</span> Tools</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-orgd33d65c" class="outline-4">
<h4 id="orgd33d65c"><span class="section-number-4">6.2.1</span> DNS</h4>
<div class="outline-text-4" id="text-6-2-1">
<pre class="example">
learning: https://www.freshersemploy.com/dns-interview-questions-answers/
</pre>
</div>
<div id="outline-container-orgc18dcaa" class="outline-5">
<h5 id="orgc18dcaa"><span class="section-number-5">6.2.1.1</span> What is DNS?</h5>
<div class="outline-text-5" id="text-6-2-1-1">
<ul class="org-ul">
<li>Domain Name Systems(DNS) maps domain names with Internet Protocol(IP) address, thus helping computer for translating human-readable(domain name) to machine-readable language(IP address).</li>
</ul>
</div>
</div>
<div id="outline-container-org2e0e9bd" class="outline-5">
<h5 id="org2e0e9bd"><span class="section-number-5">6.2.1.2</span> What is Nameserver?</h5>
<div class="outline-text-5" id="text-6-2-1-2">
<ul class="org-ul">
<li>It is used for storing the information for the domain name to IP and IP to the domain name. In other words, the name server is used for storing records of the domain names, Name servers help for convert domain name to IP address.</li>
</ul>
</div>
</div>
<div id="outline-container-org52a5274" class="outline-5">
<h5 id="org52a5274"><span class="section-number-5">6.2.1.3</span> What is DNS Spoofing?</h5>
<div class="outline-text-5" id="text-6-2-1-3">
<ul class="org-ul">
<li>DNS Spoofing occurs when a hacker is redirecting website traffic maliciously to spread the malware or to compromise the user's data through forged DNS record.</li>

<li>When a user visits a website(like freshersemploy.com) in a browser, it needs to be resolved from human-readable to machine-readable(i.e. IP addresses) using DNS resolver. To decrease the time and resolve faster, DNS resolvers cache the data and store for a specific time(until it expires). An attacker can inject forged DNS entry, thus causing DNS Cache Poisoning and instead of freshersemploy.com, the attacker will redirect it to the wrong domain or fake website.</li>
</ul>
</div>
</div>
<div id="outline-container-org03cfcbb" class="outline-5">
<h5 id="org03cfcbb"><span class="section-number-5">6.2.1.4</span> How can we prevent DNS Spoofing?</h5>
<div class="outline-text-5" id="text-6-2-1-4">
<p>
DNS Spoofing or DNS Cache Poisoning can be avoided by following guidelines:
</p>

<ul class="org-ul">
<li>From a users point of view, it is almost impossible for users to detect whether the DNS records are compromised, but users should be alerted when accessing the sites like banking, payment website where credit card details are used by checking the domain name in the browser and does it have a valid SSL certificate.</li>
<li>Domain owner and DNS provider cannot avoid DNS Spoofing but surely can take protective measures to avoid the compromise of DNS records.
<ul class="org-ul">
<li>Using Domain Name System Security Extensions(DNSSEC) which helps in determining the DNS records authenticity by signing each request with certified signature and this is recommended by ICANN. Still this in process of implementation.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge8b36f4" class="outline-5">
<h5 id="orge8b36f4"><span class="section-number-5">6.2.1.5</span> What is Round Robin DNS? What is the purpose of it?</h5>
<div class="outline-text-5" id="text-6-2-1-5">
<p>
Round Robin DNS is a technique for load distribution, load balancing, fault-tolerance service such as mail server, FTP server etc. which enables
distribution of load evenly among multiple servers using various DNS A addresses.
</p>

<p>
Suppose a domain abc.com is configured with Round robin DNS which has 3 potential IP mapping to the same domain(i.e. freshersemploy.com) as follows:
</p>

<ul class="org-ul">
<li>freshersemploy.com &#x2013; 104.28.26.01</li>
<li>freshersemploy.com &#x2013; 104.28.26.02</li>
<li>freshersemploy.com &#x2013; 104.28.26.03</li>
</ul>

<p>
Then the first request will go to 104.28.26.01, the second request will go to 104.28.26.02 and the third request will go to 104.28.26.03, thus DNS
queries are responded by returning IP addresses in a rotation.
</p>
</div>
</div>
<div id="outline-container-org6320977" class="outline-5">
<h5 id="org6320977"><span class="section-number-5">6.2.1.6</span> What is primary and secondary name server?</h5>
<div class="outline-text-5" id="text-6-2-1-6">
<ul class="org-ul">
<li>Primary name server reads the data from the domain zone, it has DNS records of domain names and it replicates the data with the secondary name server.</li>
<li>A secondary name server is the back up of primary name server which is used for high reliability, in case the primary name server is having an issue or not reachable.</li>
</ul>
</div>
</div>
<div id="outline-container-org61aa14e" class="outline-5">
<h5 id="org61aa14e"><span class="section-number-5">6.2.1.7</span> What is DNS resolver?</h5>
<div class="outline-text-5" id="text-6-2-1-7">
<ul class="org-ul">
<li>DNS resolvers are being used by ISP (Internet service provider) for the user request to resolve the domain name. If a user request for google.com, DNS resolver needs to contact TLD(Top Level Domain) i.e. .com, for translation of domain name to IP address and it caches the data if the user again queries for the same domain, thus reducing the loads on the server and response time.</li>
</ul>
</div>
</div>
<div id="outline-container-orgec3b96c" class="outline-5">
<h5 id="orgec3b96c"><span class="section-number-5">6.2.1.8</span> What is the difference between URL and Domain?</h5>
<div class="outline-text-5" id="text-6-2-1-8">
<ul class="org-ul">
<li>URL stands for Uniform Resource Locator. URL specifies the full address of a webpage. It consists of three components: protocol(like HTTP, mailto, ftp), domain name(like freshersemploy.com) and file name(eg. homepage.html)</li>
<li>e.g.:
<ul class="org-ul">
<li><a href="https://www.freshersemploy.com/">https://www.freshersemploy.com/</a></li>
<li><a href="https://www.freshersemploy.com/html-interview-questions-answers/">https://www.freshersemploy.com/html-interview-questions-answers/</a></li>
<li><a href="mailto:admin@freshersemploy.com">mailto:admin@freshersemploy.com</a></li>
</ul></li>

<li>A domain is the name of a website with the top-level domain(like .com, .org etc.). A domain is a part of URL.</li>
<li>e.g.:
<ul class="org-ul">
<li><a href="https://www.freshersemploy.com/">https://www.freshersemploy.com/</a></li>
<li><a href="mailto:admin@freshersemploy.com">admin@freshersemploy.com</a></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfb6365" class="outline-5">
<h5 id="orgcfb6365"><span class="section-number-5">6.2.1.9</span> What is DNS server?</h5>
<div class="outline-text-5" id="text-6-2-1-9">
<ul class="org-ul">
<li>DNS servers resolve IP address to respective hostnames and it maintains directory or database to store the information.</li>
<li>When we try to access the website (like <i><b>freshersemploy.com)</b></i>, DNS servers help to translate to machine-readable language i.e. IP address (like <i><b>104.28.27.67</b></i>).</li>
</ul>
</div>
</div>
<div id="outline-container-org87d2a6b" class="outline-5">
<h5 id="org87d2a6b"><span class="section-number-5">6.2.1.10</span> What are the different types of records in DNS?</h5>
<div class="outline-text-5" id="text-6-2-1-10">
<ul class="org-ul">
<li>Some of commonly used of DNS records are A, CNAME, NS, MX, PTR, SOA etc.</li>
</ul>
</div>
</div>
