README.org
**** Explain SOA record?
- Start of Authority(SOA) records stores essential information(like refresh rate, expiry, TTL etc) in domain name system(DNS) in a zone file.

; name TTL class rr Nameserver email-address freshersemploy.com. 12000 IN SOA ns.nameserver.com. root.ns.nameserver.com. ( 2098163206 ; Serial number
12000 ; Refresh rate in seconds 3600 ; Update Retry in seconds 5788864; Expiry in seconds 100 ; minimum in seconds )

#+begin_src dns
; name TTL class rr Nameserver email-address   
freshersemploy.com. 12000 IN SOA               
ns.nameserver.com. root.ns.nameserver.com.     
(                                              
    2098163206 ; Serial number                     
    12000 ; Refresh rate in seconds                
    3600 ; Update Retry in seconds                 
    5788864; Expiry in seconds                     
    100 ; minimum in seconds )
#+end_src
                                                      

- *Serial Number:* It has the serial number, which gets increments whenever there is a change in the DNS records.
- *Refresh interval:* It gets refresh at the specific interval and if there any changes in the records, data is replicated.
- *Retry:* If the propagation gets failed, it will retry after specific time which is defined in the zone file.
- *Expire:* It is set to have an expiry date, as specified in the zone file. Also used for secondary server how long it should be active in case the primary DNS server is down.
- *TTL:* It has the default time-to-live(TTL),

A zone file should have only one SOA record and it must be at the top of it.

**** What is the use of PTR in DNS?

PTR(Pointer) records are used for mapping IP addresses which are associated with hostname name. It is also called has reverse DNS lookup as it
resolves IP address to domain or hostname. There must be A record for every PTR record. PTR is mainly used for the mail server.

**** Explain CNAME record?
- CNAME record stands for Canonical Name record. It used as the alias for domain or the Canonical name(another name) for a domain.
- For example, suppose someone incorrectly types(or misspelled the website name) like fresher*s*employ.com as fresheremploy.com(we should also own this domain), then using CNAME record, we can redirect to fresher*s*employ.com
- It is a type of resource record in DNS which is specified in the zone file. CNAME records should always point to another domain and never directly points to IP address.

**** Explain Dynamic DNS
- Dynamic DNS helps for automatically updating the name servers whenever there is a change in the IP address in the Domain Name System(DNS).

**** What is Resource Record?
- Resource Record(RR) defines the elements or attributes of a domain name in DNS zone file like Address(A) record, Mail Exchange(MX) record etc. which helps in name resolutions.
- Some of the most common Resource Records are:

- A -- IPv4 Address record
- AAAA -- IPv6 Address record
- CNAME -- Canonical Name
- MX -- Mail Exchange
- PTR -- Pointer
- SOA -- Start of Authority
- NS -- Name Server

**** What is DNS Zone?
- A DNS zone file contains the mapping between a domain name, IP address, recourse records etc. in text representative format. Also, DNS zone refers to the administrative responsibility in the DNS.

**** Define TTL
- Time-to-live caches the DNS records for a specific period of time(when TTL expires, it has to query new record). It helps in queries the records faster, eventually reducing the load on the DNS server.

**** Explain MX record?
- Mail Exchange(MX) record is a type of resource record which is used for email sending and delivery. It must be specified in the DNS zone files mails for the domain.

**** What is Forward Lookup
- Forward Lookup is used to find the IP address through the domain name.

**** What is Reverse Lookup
- Reverse Lookup is used for finding the domain name through it IP.


**** TODO What is  DKIM

*** Git                                                             :TOPIC:
**** What is the use of Staging area or Indexing in Git?        :QUESTION:
:ANSWER:
From Git’s perspective, there are three areas where the file changes can be kept i.e.:
- working directory,
- staging area, and
- repository.


- First, you make changes in your project’s working directory stored on your computer file system.
- All the changes remain here until you add them to an intermediate area called staging area.

- You can stage the changes by executing ~git add .~
- This staging area gives you a preview of your next commit and basically lets you fine-tune your commits.
- You can add or remove changes in the staging area until you are satisfied with the version you are going to commit.

- Once you verify your changes and sign off the stage changed, then you can finally commit the changes.
- Upon commit, they go the local repository i.e. into ~.git/objects~ directory.

- If you use Git GUI, then you will see the option to stage your changes.

- In the below screenshot, the file sample.txt is under unstaged changes area which means that it’s in your working directory.

- Staging is also referred to as indexing because git maintains an index file to keep track of your file changes across these three areas.
- The files which are staged are currently in your index.
- When you add changes to the staging area, then the information in the index gets updated.
- When you do a commit, its actually what’s in the index that gets committed, and not what’s in the working directory.
- You can use the git status command to see what’s in the index.
:END:
**** TODO squash? Waht it is? whan to use it awht it is good for? 
**** TODO pull-request
**** TODO cherry pick
**** TODO flow
**** TODO git push
