public/fullstack.html
<div id="outline-container-orge868b06" class="outline-5">
<h5 id="orge868b06"><span class="section-number-5">6.2.1.11</span> Explain SOA record?</h5>
<div class="outline-text-5" id="text-6-2-1-11">
<ul class="org-ul">
<li>Start of Authority(SOA) records stores essential information(like refresh rate, expiry, TTL etc) in domain name system(DNS) in a zone file.</li>
</ul>

<p>
; name TTL class rr Nameserver email-address freshersemploy.com. 12000 IN SOA ns.nameserver.com. root.ns.nameserver.com. ( 2098163206 ; Serial number
12000 ; Refresh rate in seconds 3600 ; Update Retry in seconds 5788864; Expiry in seconds 100 ; minimum in seconds )
</p>

<div class="org-src-container">
<pre class="src src-dns"><span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">name TTL class rr Nameserver email-address   </span>
freshersemploy.com. 12000 <span style="color: #D0372D;">IN</span> <span style="color: #6434A3;">SOA</span>               
ns.nameserver.com. root.ns.nameserver.com.     
(                                              
    2098163206 <span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">Serial number                     </span>
    12000 <span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">Refresh rate in seconds                </span>
    3600 <span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">Update Retry in seconds                 </span>
    5788864<span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">Expiry in seconds                     </span>
    100 <span style="color: #8D8D84;">; </span><span style="color: #8D8D84; font-style: italic;">minimum in seconds )</span>
</pre>
</div>


<ul class="org-ul">
<li><b>Serial Number:</b> It has the serial number, which gets increments whenever there is a change in the DNS records.</li>
<li><b>Refresh interval:</b> It gets refresh at the specific interval and if there any changes in the records, data is replicated.</li>
<li><b>Retry:</b> If the propagation gets failed, it will retry after specific time which is defined in the zone file.</li>
<li><b>Expire:</b> It is set to have an expiry date, as specified in the zone file. Also used for secondary server how long it should be active in case the primary DNS server is down.</li>
<li><b>TTL:</b> It has the default time-to-live(TTL),</li>
</ul>

<p>
A zone file should have only one SOA record and it must be at the top of it.
</p>
</div>
</div>

<div id="outline-container-orgb429633" class="outline-5">
<h5 id="orgb429633"><span class="section-number-5">6.2.1.12</span> What is the use of PTR in DNS?</h5>
<div class="outline-text-5" id="text-6-2-1-12">
<p>
PTR(Pointer) records are used for mapping IP addresses which are associated with hostname name. It is also called has reverse DNS lookup as it
resolves IP address to domain or hostname. There must be A record for every PTR record. PTR is mainly used for the mail server.
</p>
</div>
</div>

<div id="outline-container-org5c47031" class="outline-5">
<h5 id="org5c47031"><span class="section-number-5">6.2.1.13</span> Explain CNAME record?</h5>
<div class="outline-text-5" id="text-6-2-1-13">
<ul class="org-ul">
<li>CNAME record stands for Canonical Name record. It used as the alias for domain or the Canonical name(another name) for a domain.</li>
<li>For example, suppose someone incorrectly types(or misspelled the website name) like fresher*s*employ.com as fresheremploy.com(we should also own this domain), then using CNAME record, we can redirect to fresher*s*employ.com</li>
<li>It is a type of resource record in DNS which is specified in the zone file. CNAME records should always point to another domain and never directly points to IP address.</li>
</ul>
</div>
</div>

<div id="outline-container-org9370c4c" class="outline-5">
<h5 id="org9370c4c"><span class="section-number-5">6.2.1.14</span> Explain Dynamic DNS</h5>
<div class="outline-text-5" id="text-6-2-1-14">
<ul class="org-ul">
<li>Dynamic DNS helps for automatically updating the name servers whenever there is a change in the IP address in the Domain Name System(DNS).</li>
</ul>
</div>
</div>

<div id="outline-container-org284fc71" class="outline-5">
<h5 id="org284fc71"><span class="section-number-5">6.2.1.15</span> What is Resource Record?</h5>
<div class="outline-text-5" id="text-6-2-1-15">
<ul class="org-ul">
<li>Resource Record(RR) defines the elements or attributes of a domain name in DNS zone file like Address(A) record, Mail Exchange(MX) record etc. which helps in name resolutions.</li>
<li>Some of the most common Resource Records are:</li>

<li>A &#x2013; IPv4 Address record</li>
<li>AAAA &#x2013; IPv6 Address record</li>
<li>CNAME &#x2013; Canonical Name</li>
<li>MX &#x2013; Mail Exchange</li>
<li>PTR &#x2013; Pointer</li>
<li>SOA &#x2013; Start of Authority</li>
<li>NS &#x2013; Name Server</li>
</ul>
</div>
</div>

<div id="outline-container-orgf7df6af" class="outline-5">
<h5 id="orgf7df6af"><span class="section-number-5">6.2.1.16</span> What is DNS Zone?</h5>
<div class="outline-text-5" id="text-6-2-1-16">
<ul class="org-ul">
<li>A DNS zone file contains the mapping between a domain name, IP address, recourse records etc. in text representative format. Also, DNS zone refers to the administrative responsibility in the DNS.</li>
</ul>
</div>
</div>

<div id="outline-container-orga470f99" class="outline-5">
<h5 id="orga470f99"><span class="section-number-5">6.2.1.17</span> Define TTL</h5>
<div class="outline-text-5" id="text-6-2-1-17">
<ul class="org-ul">
<li>Time-to-live caches the DNS records for a specific period of time(when TTL expires, it has to query new record). It helps in queries the records faster, eventually reducing the load on the DNS server.</li>
</ul>
</div>
</div>

<div id="outline-container-org00570cf" class="outline-5">
<h5 id="org00570cf"><span class="section-number-5">6.2.1.18</span> Explain MX record?</h5>
<div class="outline-text-5" id="text-6-2-1-18">
<ul class="org-ul">
<li>Mail Exchange(MX) record is a type of resource record which is used for email sending and delivery. It must be specified in the DNS zone files mails for the domain.</li>
</ul>
</div>
</div>

<div id="outline-container-org2545542" class="outline-5">
<h5 id="org2545542"><span class="section-number-5">6.2.1.19</span> What is Forward Lookup</h5>
<div class="outline-text-5" id="text-6-2-1-19">
<ul class="org-ul">
<li>Forward Lookup is used to find the IP address through the domain name.</li>
</ul>
</div>
</div>

<div id="outline-container-org10b303f" class="outline-5">
<h5 id="org10b303f"><span class="section-number-5">6.2.1.20</span> What is Reverse Lookup</h5>
<div class="outline-text-5" id="text-6-2-1-20">
<ul class="org-ul">
<li>Reverse Lookup is used for finding the domain name through it IP.</li>
</ul>
</div>
</div>


<div id="outline-container-org0918964" class="outline-5">
<h5 id="org0918964"><span class="section-number-5">6.2.1.21</span> <span class="todo TODO">TODO</span> What is  DKIM</h5>
</div>
</div>

<div id="outline-container-org04398af" class="outline-4">
<h4 id="org04398af"><span class="section-number-4">6.2.2</span> Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-6-2-2">
</div>
<div id="outline-container-org57e4e99" class="outline-5">
<h5 id="org57e4e99"><span class="section-number-5">6.2.2.1</span> What is the use of Staging area or Indexing in Git?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-2-1">
<p>
From Git’s perspective, there are three areas where the file changes can be kept i.e.:
</p>
<ul class="org-ul">
<li>working directory,</li>
<li>staging area, and</li>
<li>repository.</li>
</ul>


<ul class="org-ul">
<li>First, you make changes in your project’s working directory stored on your computer file system.</li>
<li>All the changes remain here until you add them to an intermediate area called staging area.</li>

<li>You can stage the changes by executing <code>git add .</code></li>
<li>This staging area gives you a preview of your next commit and basically lets you fine-tune your commits.</li>
<li>You can add or remove changes in the staging area until you are satisfied with the version you are going to commit.</li>

<li>Once you verify your changes and sign off the stage changed, then you can finally commit the changes.</li>
<li>Upon commit, they go the local repository i.e. into <code>.git/objects</code> directory.</li>

<li>If you use Git GUI, then you will see the option to stage your changes.</li>

<li>In the below screenshot, the file sample.txt is under unstaged changes area which means that it’s in your working directory.</li>

<li>Staging is also referred to as indexing because git maintains an index file to keep track of your file changes across these three areas.</li>
<li>The files which are staged are currently in your index.</li>
<li>When you add changes to the staging area, then the information in the index gets updated.</li>
<li>When you do a commit, its actually what’s in the index that gets committed, and not what’s in the working directory.</li>
<li>You can use the git status command to see what’s in the index.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfd2f396" class="outline-5">
<h5 id="orgfd2f396"><span class="section-number-5">6.2.2.2</span> <span class="todo TODO">TODO</span> squash? Waht it is? whan to use it awht it is good for?</h5>
</div>
<div id="outline-container-orgcda91a9" class="outline-5">
<h5 id="orgcda91a9"><span class="section-number-5">6.2.2.3</span> <span class="todo TODO">TODO</span> pull-request</h5>
</div>
<div id="outline-container-org4fa814e" class="outline-5">
<h5 id="org4fa814e"><span class="section-number-5">6.2.2.4</span> <span class="todo TODO">TODO</span> cherry pick</h5>
</div>
