README.org
**** TODO rebase vs merge - semantical and syntactical diff
**** TODO stash
*** Artifactory
*** Nexus ... sunset
*** Docker                                                          :TOPIC:
**** TODO dockerhub :-)
**** TODO docker file
**** TODO docker image
**** TODO docker compose
**** TODO docker swarm
**** TODO linux namespaces 
**** TODO cgroups
**** TODO OCI
**** TODO volumes
**** TODO networks
**** TODO BuildKit
**** TODO DTR - docker trusted registry

*** K8S / Kubernetes:                                               :TOPIC:
**** What is a service                                          :QUESTION:
**** What are network policies?                                 :QUESTION:
:PROPERTIES:
:learning: https://github.com/ahmetb/kubernetes-network-policy-recipes
:learning: https://www.infoq.com/news/2019/12/network-isolation-kubernetes/
:END:
:ANSWER:
- firewall on the  pod level
:END:
**** what are labels?
:ANSWER:
- key value pairs that can be assigned to majority of Kubernetes objects
:END:
**** What are network policies rules?                           :QUESTION:
:ANSWER:
1) traffic is allowed unless there is a network policy that blocks it
2) rules apply as soon as pod is selected and it is deny by default unless stated differently
3) you then only write rules that allow (whitelist)
4) rules are aditive "ored" i.e. or is applied and single allow rule is enough to open the flow
5) network policies are scoped to a namespace they are deployed to
6) ports in rules are ports on pods not ports of services
:END:
**** what are podSelectors?                                     :QUESTION:
:PROPERTIES:
:lerning:  https://medium.com/@zwhitchcox/matchlabels-labels-and-selectors-explained-in-detail-for-beginners-d421bdd05362
:END:
:ANSWER:
matchLabels: 
:END:
**** what is namespaceSelector?                                 :QUESTION:
:ANSWER:
:END:
**** what is empty selector:                                    :QUESTION:
:ANSWER:
example: matchLabels:{}
:END:
**** what ipBlock and hwhat are they good for?
**** what is a network policy plugin and how you enable that?
:answer:
- Calico,  for example
- iptables vs overlay network (calico is iptables based)
:end:
**** network policy API
**** whats is kube-dns
**** helm
**** chart
**** template
**** cluster
**** pod
**** node
**** service mesh
**** ingress controller
**** ingress and exgress?
**** etcd
**** secret
**** operator
**** CRD / Custom Resources
:answer:
- A resource is an endpoint in the Kubernetes API that stores a collection of API objects of a certain kind; for example, the built-in pods resource contains a collection of Pod objects.
- A custom resource is an extension of the Kubernetes API that is not necessarily available in a default Kubernetes installation. It represents a customization of a particular Kubernetes installation. However, many core Kubernetes functions are now built using custom resources, making Kubernetes more modular.
- Custom resources can appear and disappear in a running cluster through dynamic registration, and cluster admins can update custom resources independently of the cluster itself. Once a custom resource is installed, users can create and access its objects using kubectl, just as they do for built-in resources like Pods.
:end:
**** liveness/readines probes
**** kubectl
**** CNCF

*** Terraform                                                       :TOPIC:
**** resource
**** module
**** state
**** backend
*** Chef                                                            :TOPIC:
*** Puppet                                                          :TOPIC:
*** Ansible                                                         :TOPIC:
