public/fullstack.html
<div id="outline-container-org01d9981" class="outline-5">
<h5 id="org01d9981"><span class="section-number-5">6.2.2.5</span> <span class="todo TODO">TODO</span> flow</h5>
</div>
<div id="outline-container-org162621c" class="outline-5">
<h5 id="org162621c"><span class="section-number-5">6.2.2.6</span> <span class="todo TODO">TODO</span> git push</h5>
</div>
<div id="outline-container-org314b9f4" class="outline-5">
<h5 id="org314b9f4"><span class="section-number-5">6.2.2.7</span> <span class="todo TODO">TODO</span> rebase vs merge - semantical and syntactical diff</h5>
</div>
<div id="outline-container-orgb6999dd" class="outline-5">
<h5 id="orgb6999dd"><span class="section-number-5">6.2.2.8</span> <span class="todo TODO">TODO</span> stash</h5>
</div>
</div>
<div id="outline-container-org43e15a8" class="outline-4">
<h4 id="org43e15a8"><span class="section-number-4">6.2.3</span> Artifactory</h4>
</div>
<div id="outline-container-org1307d72" class="outline-4">
<h4 id="org1307d72"><span class="section-number-4">6.2.4</span> Nexus &#x2026; sunset</h4>
</div>
<div id="outline-container-org913dbcd" class="outline-4">
<h4 id="org913dbcd"><span class="section-number-4">6.2.5</span> Docker&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-6-2-5">
</div>
<div id="outline-container-org127c129" class="outline-5">
<h5 id="org127c129"><span class="section-number-5">6.2.5.1</span> <span class="todo TODO">TODO</span> dockerhub :-)</h5>
</div>
<div id="outline-container-org465d88b" class="outline-5">
<h5 id="org465d88b"><span class="section-number-5">6.2.5.2</span> <span class="todo TODO">TODO</span> docker file</h5>
</div>
<div id="outline-container-orgf2c8bfa" class="outline-5">
<h5 id="orgf2c8bfa"><span class="section-number-5">6.2.5.3</span> <span class="todo TODO">TODO</span> docker image</h5>
</div>
<div id="outline-container-org10179d2" class="outline-5">
<h5 id="org10179d2"><span class="section-number-5">6.2.5.4</span> <span class="todo TODO">TODO</span> docker compose</h5>
</div>
<div id="outline-container-org36a6b02" class="outline-5">
<h5 id="org36a6b02"><span class="section-number-5">6.2.5.5</span> <span class="todo TODO">TODO</span> docker swarm</h5>
</div>
<div id="outline-container-org54bfdd2" class="outline-5">
<h5 id="org54bfdd2"><span class="section-number-5">6.2.5.6</span> <span class="todo TODO">TODO</span> linux namespaces</h5>
</div>
<div id="outline-container-org2f7c005" class="outline-5">
<h5 id="org2f7c005"><span class="section-number-5">6.2.5.7</span> <span class="todo TODO">TODO</span> cgroups</h5>
</div>
<div id="outline-container-org5bca044" class="outline-5">
<h5 id="org5bca044"><span class="section-number-5">6.2.5.8</span> <span class="todo TODO">TODO</span> OCI</h5>
</div>
<div id="outline-container-org188017d" class="outline-5">
<h5 id="org188017d"><span class="section-number-5">6.2.5.9</span> <span class="todo TODO">TODO</span> volumes</h5>
</div>
<div id="outline-container-org5a55460" class="outline-5">
<h5 id="org5a55460"><span class="section-number-5">6.2.5.10</span> <span class="todo TODO">TODO</span> networks</h5>
</div>
<div id="outline-container-org7258310" class="outline-5">
<h5 id="org7258310"><span class="section-number-5">6.2.5.11</span> <span class="todo TODO">TODO</span> BuildKit</h5>
</div>
<div id="outline-container-org9e0c370" class="outline-5">
<h5 id="org9e0c370"><span class="section-number-5">6.2.5.12</span> <span class="todo TODO">TODO</span> DTR - docker trusted registry</h5>
</div>
</div>

<div id="outline-container-org4008b0c" class="outline-4">
<h4 id="org4008b0c"><span class="section-number-4">6.2.6</span> K8S / Kubernetes:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-6-2-6">
</div>
<div id="outline-container-orgfdd2607" class="outline-5">
<h5 id="orgfdd2607"><span class="section-number-5">6.2.6.1</span> What is a service&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org62aadd4" class="outline-5">
<h5 id="org62aadd4"><span class="section-number-5">6.2.6.2</span> What are network policies?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-6-2">
<pre class="example">
learning: https://github.com/ahmetb/kubernetes-network-policy-recipes
learning: https://www.infoq.com/news/2019/12/network-isolation-kubernetes/
</pre>
<ul class="org-ul">
<li>firewall on the  pod level</li>
</ul>
</div>
</div>
<div id="outline-container-org70d2d6e" class="outline-5">
<h5 id="org70d2d6e"><span class="section-number-5">6.2.6.3</span> what are labels?</h5>
<div class="outline-text-5" id="text-6-2-6-3">
<ul class="org-ul">
<li>key value pairs that can be assigned to majority of Kubernetes objects</li>
</ul>
</div>
</div>
<div id="outline-container-orgac268e4" class="outline-5">
<h5 id="orgac268e4"><span class="section-number-5">6.2.6.4</span> What are network policies rules?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-6-4">
<ol class="org-ol">
<li>traffic is allowed unless there is a network policy that blocks it</li>
<li>rules apply as soon as pod is selected and it is deny by default unless stated differently</li>
<li>you then only write rules that allow (whitelist)</li>
<li>rules are aditive "ored" i.e. or is applied and single allow rule is enough to open the flow</li>
<li>network policies are scoped to a namespace they are deployed to</li>
<li>ports in rules are ports on pods not ports of services</li>
</ol>
</div>
</div>
<div id="outline-container-orgb79096a" class="outline-5">
<h5 id="orgb79096a"><span class="section-number-5">6.2.6.5</span> what are podSelectors?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-6-5">
<pre class="example">
lerning: https://medium.com/@zwhitchcox/matchlabels-labels-and-selectors-explained-in-detail-for-beginners-d421bdd05362
</pre>
<p>
matchLabels: 
</p>
</div>
</div>
<div id="outline-container-orgf4321d5" class="outline-5">
<h5 id="orgf4321d5"><span class="section-number-5">6.2.6.6</span> what is namespaceSelector?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-6-6">
</div>
</div>
<div id="outline-container-orgcbd1cbc" class="outline-5">
<h5 id="orgcbd1cbc"><span class="section-number-5">6.2.6.7</span> what is empty selector:&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-6-2-6-7">
<p>
example: matchLabels:{}
</p>
</div>
</div>
<div id="outline-container-org40a9eb0" class="outline-5">
<h5 id="org40a9eb0"><span class="section-number-5">6.2.6.8</span> what ipBlock and hwhat are they good for?</h5>
</div>
<div id="outline-container-org64fbc26" class="outline-5">
<h5 id="org64fbc26"><span class="section-number-5">6.2.6.9</span> what is a network policy plugin and how you enable that?</h5>
<div class="outline-text-5" id="text-6-2-6-9">
<ul class="org-ul">
<li>Calico,  for example</li>
<li>iptables vs overlay network (calico is iptables based)</li>
</ul>
</div>
</div>
<div id="outline-container-org2cfb6b6" class="outline-5">
<h5 id="org2cfb6b6"><span class="section-number-5">6.2.6.10</span> network policy API</h5>
</div>
<div id="outline-container-orgc959f95" class="outline-5">
<h5 id="orgc959f95"><span class="section-number-5">6.2.6.11</span> whats is kube-dns</h5>
</div>
<div id="outline-container-org7001d64" class="outline-5">
<h5 id="org7001d64"><span class="section-number-5">6.2.6.12</span> helm</h5>
</div>
<div id="outline-container-org20d1655" class="outline-5">
<h5 id="org20d1655"><span class="section-number-5">6.2.6.13</span> chart</h5>
</div>
<div id="outline-container-org4758f22" class="outline-5">
<h5 id="org4758f22"><span class="section-number-5">6.2.6.14</span> template</h5>
</div>
<div id="outline-container-org09de285" class="outline-5">
<h5 id="org09de285"><span class="section-number-5">6.2.6.15</span> cluster</h5>
</div>
<div id="outline-container-org18e17c5" class="outline-5">
<h5 id="org18e17c5"><span class="section-number-5">6.2.6.16</span> pod</h5>
</div>
<div id="outline-container-orge4b3921" class="outline-5">
<h5 id="orge4b3921"><span class="section-number-5">6.2.6.17</span> node</h5>
</div>
<div id="outline-container-orge2bd955" class="outline-5">
<h5 id="orge2bd955"><span class="section-number-5">6.2.6.18</span> service mesh</h5>
</div>
<div id="outline-container-orgce8a0cb" class="outline-5">
<h5 id="orgce8a0cb"><span class="section-number-5">6.2.6.19</span> ingress controller</h5>
</div>
<div id="outline-container-org8ce7d1c" class="outline-5">
<h5 id="org8ce7d1c"><span class="section-number-5">6.2.6.20</span> ingress and exgress?</h5>
</div>
<div id="outline-container-org87c804d" class="outline-5">
<h5 id="org87c804d"><span class="section-number-5">6.2.6.21</span> etcd</h5>
</div>
<div id="outline-container-org0fa89eb" class="outline-5">
<h5 id="org0fa89eb"><span class="section-number-5">6.2.6.22</span> secret</h5>
</div>
<div id="outline-container-orgaaaa589" class="outline-5">
<h5 id="orgaaaa589"><span class="section-number-5">6.2.6.23</span> operator</h5>
</div>
<div id="outline-container-orgc7824dd" class="outline-5">
<h5 id="orgc7824dd"><span class="section-number-5">6.2.6.24</span> CRD / Custom Resources</h5>
<div class="outline-text-5" id="text-6-2-6-24">
<ul class="org-ul">
<li>A resource is an endpoint in the Kubernetes API that stores a collection of API objects of a certain kind; for example, the built-in pods resource contains a collection of Pod objects.</li>
<li>A custom resource is an extension of the Kubernetes API that is not necessarily available in a default Kubernetes installation. It represents a customization of a particular Kubernetes installation. However, many core Kubernetes functions are now built using custom resources, making Kubernetes more modular.</li>
<li>Custom resources can appear and disappear in a running cluster through dynamic registration, and cluster admins can update custom resources independently of the cluster itself. Once a custom resource is installed, users can create and access its objects using kubectl, just as they do for built-in resources like Pods.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb96c785" class="outline-5">
<h5 id="orgb96c785"><span class="section-number-5">6.2.6.25</span> liveness/readines probes</h5>
</div>
<div id="outline-container-org7843c1d" class="outline-5">
<h5 id="org7843c1d"><span class="section-number-5">6.2.6.26</span> kubectl</h5>
</div>
<div id="outline-container-org05f892d" class="outline-5">
<h5 id="org05f892d"><span class="section-number-5">6.2.6.27</span> CNCF</h5>
</div>
</div>

<div id="outline-container-org46ffed3" class="outline-4">
<h4 id="org46ffed3"><span class="section-number-4">6.2.7</span> Terraform&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-6-2-7">
</div>
