README.org
*** Cloud Formation                                                 :TOPIC:
*** Hashicorp consul                                                :TOPIC:
*** Hashicorp vault                                                 :TOPIC:
*** zookeeper                                                       :TOPIC:
*** kibana                                                          :TOPIC:
*** graphana                                                        :TOPIC:
*** ELK                                                             :TOPIC:
*** DynaTrace                                                       :TOPIC:
*** Piwik                                                           :TOPIC:
** Linux
*** cron
*** runlevel / init / inittab 
*** systemd
*** snap
*** apt
*** ssh 
**** how to create trust between computers
*** awk 
:PROPERTIES:
:learning: https://www.digitalocean.com/community/tutorials/how-to-use-the-awk-language-to-manipulate-text-in-linux
:learning: https://linuxhint.com/20_awk_examples/
:END:
*** sed 
*** grep 
*** tail
*** head
*** rsync
*** mount
*** ls / ps / htop
*** bash                                                          :TOPIC:
**** co je to here doc?                                         :QUESTION:
*** co je to regexp
*** list open ports
*** iptables
*** BPF
*** list open files
*** stdin stdout stderr
*** NFS
*** file types: 
**** block device
**** character device
**** named pipe
**** symlink
*** etc/nsswitch./conf
*** etc/resolv.conf
*** ip
#+begin_src bash
ip addr sh
ip route sh
#+end_src
*** nmap
*** nc
*** socat
*** chmod
*** dd
*** tar
*** apt-get apt
*** wget
*** curl
*** find
** Observability
*** 3 pillars
**** logs
**** metrics
**** traces
*** Tail Latency
* WIP Web Front End                                                  :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: WEB
:END:
** React
*** React 
*** React Native
*** react-hooks
** Angular
** PWA
*** app-shell model 

** HTML + CSS
*** Chrome Development Tools
