public/fullstack.html
<div id="outline-container-orgfa180c7" class="outline-5">
<h5 id="orgfa180c7"><span class="section-number-5">6.2.7.1</span> resource</h5>
</div>
<div id="outline-container-orgd717294" class="outline-5">
<h5 id="orgd717294"><span class="section-number-5">6.2.7.2</span> module</h5>
</div>
<div id="outline-container-org6982f7d" class="outline-5">
<h5 id="org6982f7d"><span class="section-number-5">6.2.7.3</span> state</h5>
</div>
<div id="outline-container-org6fb62d6" class="outline-5">
<h5 id="org6fb62d6"><span class="section-number-5">6.2.7.4</span> backend</h5>
</div>
</div>
<div id="outline-container-org55f6479" class="outline-4">
<h4 id="org55f6479"><span class="section-number-4">6.2.8</span> Chef&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org569fd5c" class="outline-4">
<h4 id="org569fd5c"><span class="section-number-4">6.2.9</span> Puppet&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org3efad75" class="outline-4">
<h4 id="org3efad75"><span class="section-number-4">6.2.10</span> Ansible&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orgf2fab9e" class="outline-4">
<h4 id="orgf2fab9e"><span class="section-number-4">6.2.11</span> Cloud Formation&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org1cca176" class="outline-4">
<h4 id="org1cca176"><span class="section-number-4">6.2.12</span> Hashicorp consul&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org5ef251e" class="outline-4">
<h4 id="org5ef251e"><span class="section-number-4">6.2.13</span> Hashicorp vault&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orgea00468" class="outline-4">
<h4 id="orgea00468"><span class="section-number-4">6.2.14</span> zookeeper&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orgb2b90f4" class="outline-4">
<h4 id="orgb2b90f4"><span class="section-number-4">6.2.15</span> kibana&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org4c713be" class="outline-4">
<h4 id="org4c713be"><span class="section-number-4">6.2.16</span> graphana&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orga687ac6" class="outline-4">
<h4 id="orga687ac6"><span class="section-number-4">6.2.17</span> ELK&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-orge99949a" class="outline-4">
<h4 id="orge99949a"><span class="section-number-4">6.2.18</span> DynaTrace&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
<div id="outline-container-org8ab9488" class="outline-4">
<h4 id="org8ab9488"><span class="section-number-4">6.2.19</span> Piwik&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
</div>
<div id="outline-container-orgd14b69f" class="outline-3">
<h3 id="orgd14b69f"><span class="section-number-3">6.3</span> Linux</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-orge812262" class="outline-4">
<h4 id="orge812262"><span class="section-number-4">6.3.1</span> cron</h4>
</div>
<div id="outline-container-orgb158ae4" class="outline-4">
<h4 id="orgb158ae4"><span class="section-number-4">6.3.2</span> runlevel / init / inittab</h4>
</div>
<div id="outline-container-org5878891" class="outline-4">
<h4 id="org5878891"><span class="section-number-4">6.3.3</span> systemd</h4>
</div>
<div id="outline-container-orgf137f5d" class="outline-4">
<h4 id="orgf137f5d"><span class="section-number-4">6.3.4</span> snap</h4>
</div>
<div id="outline-container-org466ff23" class="outline-4">
<h4 id="org466ff23"><span class="section-number-4">6.3.5</span> apt</h4>
</div>
<div id="outline-container-org6384e74" class="outline-4">
<h4 id="org6384e74"><span class="section-number-4">6.3.6</span> ssh</h4>
<div class="outline-text-4" id="text-6-3-6">
</div>
<div id="outline-container-org59bf78f" class="outline-5">
<h5 id="org59bf78f"><span class="section-number-5">6.3.6.1</span> how to create trust between computers</h5>
</div>
</div>
<div id="outline-container-org91233c2" class="outline-4">
<h4 id="org91233c2"><span class="section-number-4">6.3.7</span> awk</h4>
<div class="outline-text-4" id="text-6-3-7">
<pre class="example">
learning: https://www.digitalocean.com/community/tutorials/how-to-use-the-awk-language-to-manipulate-text-in-linux
learning: https://linuxhint.com/20_awk_examples/
</pre>
</div>
</div>
<div id="outline-container-org1baf003" class="outline-4">
<h4 id="org1baf003"><span class="section-number-4">6.3.8</span> sed</h4>
</div>
<div id="outline-container-org908c0c5" class="outline-4">
<h4 id="org908c0c5"><span class="section-number-4">6.3.9</span> grep</h4>
</div>
<div id="outline-container-orgbd3c139" class="outline-4">
<h4 id="orgbd3c139"><span class="section-number-4">6.3.10</span> tail</h4>
</div>
<div id="outline-container-org041efb0" class="outline-4">
<h4 id="org041efb0"><span class="section-number-4">6.3.11</span> head</h4>
</div>
<div id="outline-container-orgf84db2c" class="outline-4">
<h4 id="orgf84db2c"><span class="section-number-4">6.3.12</span> rsync</h4>
</div>
<div id="outline-container-orgdac36cc" class="outline-4">
<h4 id="orgdac36cc"><span class="section-number-4">6.3.13</span> mount</h4>
</div>
<div id="outline-container-org1e69311" class="outline-4">
<h4 id="org1e69311"><span class="section-number-4">6.3.14</span> ls / ps / htop</h4>
</div>
<div id="outline-container-org1f854a3" class="outline-4">
<h4 id="org1f854a3"><span class="section-number-4">6.3.15</span> bash&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-6-3-15">
</div>
<div id="outline-container-orgad5d332" class="outline-5">
<h5 id="orgad5d332"><span class="section-number-5">6.3.15.1</span> co je to here doc?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
</div>
<div id="outline-container-org288fd64" class="outline-4">
<h4 id="org288fd64"><span class="section-number-4">6.3.16</span> co je to regexp</h4>
</div>
<div id="outline-container-org5f4a003" class="outline-4">
<h4 id="org5f4a003"><span class="section-number-4">6.3.17</span> list open ports</h4>
</div>
<div id="outline-container-org77ab9f0" class="outline-4">
<h4 id="org77ab9f0"><span class="section-number-4">6.3.18</span> iptables</h4>
</div>
<div id="outline-container-org291ae8e" class="outline-4">
<h4 id="org291ae8e"><span class="section-number-4">6.3.19</span> BPF</h4>
</div>
<div id="outline-container-org8f8f750" class="outline-4">
<h4 id="org8f8f750"><span class="section-number-4">6.3.20</span> list open files</h4>
</div>
<div id="outline-container-org8106c97" class="outline-4">
<h4 id="org8106c97"><span class="section-number-4">6.3.21</span> stdin stdout stderr</h4>
</div>
<div id="outline-container-orgfa434c2" class="outline-4">
<h4 id="orgfa434c2"><span class="section-number-4">6.3.22</span> NFS</h4>
</div>
<div id="outline-container-org9f37c3e" class="outline-4">
<h4 id="org9f37c3e"><span class="section-number-4">6.3.23</span> file types:</h4>
<div class="outline-text-4" id="text-6-3-23">
</div>
<div id="outline-container-org07cfa3d" class="outline-5">
<h5 id="org07cfa3d"><span class="section-number-5">6.3.23.1</span> block device</h5>
</div>
<div id="outline-container-org2da07c4" class="outline-5">
<h5 id="org2da07c4"><span class="section-number-5">6.3.23.2</span> character device</h5>
</div>
<div id="outline-container-org6fda3cb" class="outline-5">
<h5 id="org6fda3cb"><span class="section-number-5">6.3.23.3</span> named pipe</h5>
</div>
<div id="outline-container-orgb41e5ce" class="outline-5">
<h5 id="orgb41e5ce"><span class="section-number-5">6.3.23.4</span> symlink</h5>
</div>
</div>
<div id="outline-container-orgdcaee2e" class="outline-4">
<h4 id="orgdcaee2e"><span class="section-number-4">6.3.24</span> etc/nsswitch./conf</h4>
</div>
<div id="outline-container-org288d272" class="outline-4">
<h4 id="org288d272"><span class="section-number-4">6.3.25</span> etc/resolv.conf</h4>
</div>
<div id="outline-container-org4b9e7a7" class="outline-4">
<h4 id="org4b9e7a7"><span class="section-number-4">6.3.26</span> ip</h4>
<div class="outline-text-4" id="text-6-3-26">
<div class="org-src-container">
<pre class="src src-bash">ip addr sh
ip route sh
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb603351" class="outline-4">
<h4 id="orgb603351"><span class="section-number-4">6.3.27</span> nmap</h4>
</div>
<div id="outline-container-orgfcfa124" class="outline-4">
<h4 id="orgfcfa124"><span class="section-number-4">6.3.28</span> nc</h4>
</div>
<div id="outline-container-orgf978c1c" class="outline-4">
<h4 id="orgf978c1c"><span class="section-number-4">6.3.29</span> socat</h4>
</div>
<div id="outline-container-org2b22834" class="outline-4">
<h4 id="org2b22834"><span class="section-number-4">6.3.30</span> chmod</h4>
</div>
<div id="outline-container-orgae94187" class="outline-4">
<h4 id="orgae94187"><span class="section-number-4">6.3.31</span> dd</h4>
</div>
<div id="outline-container-orgfae050a" class="outline-4">
<h4 id="orgfae050a"><span class="section-number-4">6.3.32</span> tar</h4>
</div>
<div id="outline-container-org9d377d7" class="outline-4">
<h4 id="org9d377d7"><span class="section-number-4">6.3.33</span> apt-get apt</h4>
</div>
<div id="outline-container-org862b8a2" class="outline-4">
<h4 id="org862b8a2"><span class="section-number-4">6.3.34</span> wget</h4>
</div>
<div id="outline-container-org1d92941" class="outline-4">
<h4 id="org1d92941"><span class="section-number-4">6.3.35</span> curl</h4>
</div>
<div id="outline-container-org0f94046" class="outline-4">
<h4 id="org0f94046"><span class="section-number-4">6.3.36</span> find</h4>
</div>
</div>
<div id="outline-container-orge322841" class="outline-3">
<h3 id="orge322841"><span class="section-number-3">6.4</span> Observability</h3>
<div class="outline-text-3" id="text-6-4">
</div>
<div id="outline-container-org0f38b7b" class="outline-4">
<h4 id="org0f38b7b"><span class="section-number-4">6.4.1</span> 3 pillars</h4>
<div class="outline-text-4" id="text-6-4-1">
</div>
<div id="outline-container-org33385d3" class="outline-5">
<h5 id="org33385d3"><span class="section-number-5">6.4.1.1</span> logs</h5>
</div>
<div id="outline-container-orgb75948a" class="outline-5">
<h5 id="orgb75948a"><span class="section-number-5">6.4.1.2</span> metrics</h5>
</div>
<div id="outline-container-org8490420" class="outline-5">
<h5 id="org8490420"><span class="section-number-5">6.4.1.3</span> traces</h5>
</div>
</div>
<div id="outline-container-org36d3d48" class="outline-4">
<h4 id="org36d3d48"><span class="section-number-4">6.4.2</span> Tail Latency</h4>
</div>
</div>
</div>
<div id="outline-container-org5c15582" class="outline-2">
<h2 id="WEB"><span class="section-number-2">7</span> <span class="todo WIP">WIP</span> Web Front End&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-WEB">
<pre class="example">
CUSTOM_ID: WEB
</pre>
</div>
<div id="outline-container-org069e303" class="outline-3">
<h3 id="org069e303"><span class="section-number-3">7.1</span> React</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-orgb180cf2" class="outline-4">
<h4 id="orgb180cf2"><span class="section-number-4">7.1.1</span> React</h4>
</div>
<div id="outline-container-orge66532c" class="outline-4">
<h4 id="orge66532c"><span class="section-number-4">7.1.2</span> React Native</h4>
</div>
<div id="outline-container-org4788150" class="outline-4">
<h4 id="org4788150"><span class="section-number-4">7.1.3</span> react-hooks</h4>
</div>
</div>
<div id="outline-container-org91bd42a" class="outline-3">
<h3 id="org91bd42a"><span class="section-number-3">7.2</span> Angular</h3>
</div>
<div id="outline-container-org2aa311d" class="outline-3">
<h3 id="org2aa311d"><span class="section-number-3">7.3</span> PWA</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgf4f20dc" class="outline-4">
<h4 id="orgf4f20dc"><span class="section-number-4">7.3.1</span> app-shell model</h4>
</div>
</div>

<div id="outline-container-org5132467" class="outline-3">
<h3 id="org5132467"><span class="section-number-3">7.4</span> HTML + CSS</h3>
<div class="outline-text-3" id="text-7-4">
</div>
<div id="outline-container-orgc55c55b" class="outline-4">
<h4 id="orgc55c55b"><span class="section-number-4">7.4.1</span> Chrome Development Tools</h4>
</div>
