README.org
*** HTML5 Layout 
:ANSWER:
#+begin_src html
<header> It is used to define a header for a document or a section.
<nav> It is used to define a container for navigation links
<section> It is used to define a section in a document
<article> It is used to define an independent, self-contained article
<aside> It is used to define content aside from the content (like a sidebar)
<footer> It is used to define a footer for a document or a section
#+end_src
:END:
*** What is iframe good for?                                     :QUESTION:
:ANSWER:
An iframe is used to display a web page within a web page.
Syntax:
#+begin_src html
<iframe src="URL"></iframe>  
#+end_src
Example:
#+begin_src html
<iframe src="demo_iframe.html" width="200px" height="200px"></iframe>  
#+end_src
Target to a link:
#+begin_src html
<iframe src="http://www.javatpoint.com" name="iframe_a"></iframe>  
#+end_src
:END:
*** WIP Cookies
:PROPERTIES:
:lerning:  https://tools.ietf.org/id/draft-ietf-httpbis-rfc6265bis-03.html
:END:
*** WIP Cookies / SameSite
:PROPERTIES:
:lerning:  https://web.dev/samesite-cookies-explained/
:END:
*** Less
*** Sass
*** CORS
:PROPERTIES:
:learning: https://www.codecademy.com/articles/what-is-cors
:END:
**** why is CORS necessary?                                     :QUESTION:
**** How Does CORS Manage Requests From External Resources?     :QUESTION:
**** What http headers were added by CORS?                      :QUESTION:
:ANSWER:
#+begin_src html
Access-Control-Allow-Origin
Access-Control-Allow-Credentials
Access-Control-Allow-Headers
Access-Control-Allow-Methods
Access-Control-Expose-Headers
Access-Control-Max-Age
Access-Control-Request-Headers
Access-Control-Request-Method
Origin
#+end_src
:END:
** The Elm Architecture (TEA)
* WIP Security                                                       :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: SECURITY
:END:
** SPIFFE                                                            :TOPIC:
*** what is spiffe
:PROPERTIES:
:lerning:  https://spiffe.io/docs/latest/spiffe/overview/
:END:
:ANSWER:
- SPIFFE, the Secure Production Identity Framework for Everyone, is a set of open-source standards for securely identifying software systems in dynamic and heterogeneous environments. Systems that adopt SPIFFE can easily and reliably mutually authenticate wherever they are running.
- Distributed design patterns and practices such as micro-services, container orchestrators, and cloud computing have led to production environments that are increasingly dynamic and heterogeneous. Conventional security practices (such as network policies that only allow traffic between particular IP addresses) struggle to scale under this complexity. A first-class identity framework for workloads in an organization becomes necessary.
- Further, modern developers are expected to understand and play a role in how applications are deployed and managed in production environments. Operations teams require deeper visibility into the applications they are managing. As we move to a more evolved security stance, we must offer better tools to both teams so they can play an active role in building secure, distributed applications.
- SPIFFE is a set of open-source specifications for a framework capable of bootstrapping and issuing identity to services across heterogeneous environments and organizational boundaries. The heart of these specifications is the one that defines short lived cryptographic identity documents – called SVIDs via a simple API. Workloads can then use these identity documents when authenticating to other workloads, for example by establishing a TLS connection or by signing and verifying a JWT token.
:END:
** Oauth2/OIDC                                                       :TOPIC:
*** grant (flow) types:
**** Authorization Code Flow
**** Client Credentials Flow
**** Device Code
**** Refresh Token
**** PKCE
**** (Implicit Flow)
**** (Password Grant)
*** Scope
:answer:
A mechanism that defines the specific actions applications can be allowed to do or information that they can request on a user’s behalf. 
Often, applications will want to make use of the information that has already been created in an online resource.
To do so, the application must ask for authorization to access this information on a user’s behalf. 
When an app requests permission to access a resource through an authorization server, it uses the Scope parameter to specify what access it needs,
and the authorization server uses the Scope parameter to respond with the access that was actually granted.
:end:
