public/fullstack.html
<div id="outline-container-org5270f1f" class="outline-4">
<h4 id="org5270f1f"><span class="section-number-4">7.4.2</span> HTML5 Layout</h4>
<div class="outline-text-4" id="text-7-4-2">
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">header</span>&gt; It is used to define a header for a document or a section.
&lt;<span style="color: #006699;">nav</span>&gt; It is used to define a container for navigation links
&lt;<span style="color: #006699;">section</span>&gt; It is used to define a section in a document
&lt;<span style="color: #006699;">article</span>&gt; It is used to define an independent, self-contained article
&lt;<span style="color: #006699;">aside</span>&gt; It is used to define content aside from the content (like a sidebar)
&lt;<span style="color: #006699;">footer</span>&gt; It is used to define a footer for a document or a section
</pre>
</div>
</div>
</div>
<div id="outline-container-org7803a5f" class="outline-4">
<h4 id="org7803a5f"><span class="section-number-4">7.4.3</span> What is iframe good for?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-7-4-3">
<p>
An iframe is used to display a web page within a web page.
Syntax:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">iframe</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"URL"</span>&gt;&lt;/<span style="color: #006699;">iframe</span>&gt;  
</pre>
</div>
<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">iframe</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"demo_iframe.html"</span> <span style="color: #BA36A5;">width</span>=<span style="color: #008000;">"200px"</span> <span style="color: #BA36A5;">height</span>=<span style="color: #008000;">"200px"</span>&gt;&lt;/<span style="color: #006699;">iframe</span>&gt;  
</pre>
</div>
<p>
Target to a link:
</p>
<div class="org-src-container">
<pre class="src src-html">&lt;<span style="color: #006699;">iframe</span> <span style="color: #BA36A5;">src</span>=<span style="color: #008000;">"http://www.javatpoint.com"</span> <span style="color: #BA36A5;">name</span>=<span style="color: #008000;">"iframe_a"</span>&gt;&lt;/<span style="color: #006699;">iframe</span>&gt;  
</pre>
</div>
</div>
</div>
<div id="outline-container-org8bd97a3" class="outline-4">
<h4 id="org8bd97a3"><span class="section-number-4">7.4.4</span> <span class="todo WIP">WIP</span> Cookies</h4>
<div class="outline-text-4" id="text-7-4-4">
<pre class="example">
lerning: https://tools.ietf.org/id/draft-ietf-httpbis-rfc6265bis-03.html
</pre>
</div>
</div>
<div id="outline-container-orgc0ea479" class="outline-4">
<h4 id="orgc0ea479"><span class="section-number-4">7.4.5</span> <span class="todo WIP">WIP</span> Cookies / SameSite</h4>
<div class="outline-text-4" id="text-7-4-5">
<pre class="example">
lerning: https://web.dev/samesite-cookies-explained/
</pre>
</div>
</div>
<div id="outline-container-org3a95a92" class="outline-4">
<h4 id="org3a95a92"><span class="section-number-4">7.4.6</span> Less</h4>
</div>
<div id="outline-container-org23bf1c1" class="outline-4">
<h4 id="org23bf1c1"><span class="section-number-4">7.4.7</span> Sass</h4>
</div>
<div id="outline-container-orgbb5066d" class="outline-4">
<h4 id="orgbb5066d"><span class="section-number-4">7.4.8</span> CORS</h4>
<div class="outline-text-4" id="text-7-4-8">
<pre class="example">
learning: https://www.codecademy.com/articles/what-is-cors
</pre>
</div>
<div id="outline-container-org67c748b" class="outline-5">
<h5 id="org67c748b"><span class="section-number-5">7.4.8.1</span> why is CORS necessary?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org85f9d60" class="outline-5">
<h5 id="org85f9d60"><span class="section-number-5">7.4.8.2</span> How Does CORS Manage Requests From External Resources?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org2000e5c" class="outline-5">
<h5 id="org2000e5c"><span class="section-number-5">7.4.8.3</span> What http headers were added by CORS?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-7-4-8-3">
<div class="org-src-container">
<pre class="src src-html">Access-Control-Allow-Origin
Access-Control-Allow-Credentials
Access-Control-Allow-Headers
Access-Control-Allow-Methods
Access-Control-Expose-Headers
Access-Control-Max-Age
Access-Control-Request-Headers
Access-Control-Request-Method
Origin
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org5227429" class="outline-3">
<h3 id="org5227429"><span class="section-number-3">7.5</span> The Elm Architecture (TEA)</h3>
</div>
</div>
<div id="outline-container-org846e816" class="outline-2">
<h2 id="SECURITY"><span class="section-number-2">8</span> <span class="todo WIP">WIP</span> Security&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-SECURITY">
<pre class="example">
CUSTOM_ID: SECURITY
</pre>
</div>
<div id="outline-container-org68b2ca3" class="outline-3">
<h3 id="org68b2ca3"><span class="section-number-3">8.1</span> SPIFFE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org745fd5b" class="outline-4">
<h4 id="org745fd5b"><span class="section-number-4">8.1.1</span> what is spiffe</h4>
<div class="outline-text-4" id="text-8-1-1">
<pre class="example">
lerning: https://spiffe.io/docs/latest/spiffe/overview/
</pre>
<ul class="org-ul">
<li>SPIFFE, the Secure Production Identity Framework for Everyone, is a set of open-source standards for securely identifying software systems in dynamic and heterogeneous environments. Systems that adopt SPIFFE can easily and reliably mutually authenticate wherever they are running.</li>
<li>Distributed design patterns and practices such as micro-services, container orchestrators, and cloud computing have led to production environments that are increasingly dynamic and heterogeneous. Conventional security practices (such as network policies that only allow traffic between particular IP addresses) struggle to scale under this complexity. A first-class identity framework for workloads in an organization becomes necessary.</li>
<li>Further, modern developers are expected to understand and play a role in how applications are deployed and managed in production environments. Operations teams require deeper visibility into the applications they are managing. As we move to a more evolved security stance, we must offer better tools to both teams so they can play an active role in building secure, distributed applications.</li>
<li>SPIFFE is a set of open-source specifications for a framework capable of bootstrapping and issuing identity to services across heterogeneous environments and organizational boundaries. The heart of these specifications is the one that defines short lived cryptographic identity documents – called SVIDs via a simple API. Workloads can then use these identity documents when authenticating to other workloads, for example by establishing a TLS connection or by signing and verifying a JWT token.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org92b0039" class="outline-3">
<h3 id="org92b0039"><span class="section-number-3">8.2</span> Oauth2/OIDC&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org93084a0" class="outline-4">
<h4 id="org93084a0"><span class="section-number-4">8.2.1</span> grant (flow) types:</h4>
<div class="outline-text-4" id="text-8-2-1">
</div>
<div id="outline-container-org102800a" class="outline-5">
<h5 id="org102800a"><span class="section-number-5">8.2.1.1</span> Authorization Code Flow</h5>
</div>
<div id="outline-container-orgfd1bdf0" class="outline-5">
<h5 id="orgfd1bdf0"><span class="section-number-5">8.2.1.2</span> Client Credentials Flow</h5>
</div>
<div id="outline-container-org965fd29" class="outline-5">
<h5 id="org965fd29"><span class="section-number-5">8.2.1.3</span> Device Code</h5>
</div>
<div id="outline-container-orgfc6a8fe" class="outline-5">
<h5 id="orgfc6a8fe"><span class="section-number-5">8.2.1.4</span> Refresh Token</h5>
</div>
<div id="outline-container-orgca876d8" class="outline-5">
<h5 id="orgca876d8"><span class="section-number-5">8.2.1.5</span> PKCE</h5>
</div>
<div id="outline-container-orgfb569b1" class="outline-5">
<h5 id="orgfb569b1"><span class="section-number-5">8.2.1.6</span> (Implicit Flow)</h5>
</div>
<div id="outline-container-org9de3696" class="outline-5">
<h5 id="org9de3696"><span class="section-number-5">8.2.1.7</span> (Password Grant)</h5>
</div>
</div>
<div id="outline-container-orgb934c5e" class="outline-4">
<h4 id="orgb934c5e"><span class="section-number-4">8.2.2</span> Scope</h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
A mechanism that defines the specific actions applications can be allowed to do or information that they can request on a user’s behalf. 
Often, applications will want to make use of the information that has already been created in an online resource.
To do so, the application must ask for authorization to access this information on a user’s behalf. 
When an app requests permission to access a resource through an authorization server, it uses the Scope parameter to specify what access it needs,
and the authorization server uses the Scope parameter to respond with the access that was actually granted.
</p>
</div>
</div>
