README.org
*** What is acr_values
:PROPERTIES:
:lerning:  https://ldapwiki.com/wiki/Acr_values
:END:
:ANSWER:
- Acr_values is an OPTIONAL parameter that is a Space-separated string that specifies the Authentication Context Class Values within the Authentication Request that the Authorization Server is being requested to use for processing requests from this Client, with the values appearing in order of preference.
- Acr_values was originally specified within the JSON Web Token (JWT) Profile for OAuth 2.0 Client Authentication and Authorization Grants (RFC 7523)

- The Authentication Context Class Reference values actually utilized by the Authorization Server is returned within the Identity Token in the acr parameter.
:END:
** JWT
:PROPERTIES:
:learning:    https://tools.ietf.org/html/rfc7519
:END:
*** What are the registered claim names?                        :QUESTION:
*** What is registered claim name "iss" (Issuer) Claim?          :QUESTION:
:ANSWER:
- The "iss" (issuer) claim identifies the principal that issued the JWT.
- The processing of this claim is generally application specific.
- The "iss" value is a case-sensitive string containing a StringOrURI value.
- Use of this claim is OPTIONAL.
:END:
*** What is registered claim name "sub" (Subject) Claim          :QUESTION:
:ANSWER:
- The "sub" (subject) claim identifies the principal that is the subject of the JWT.
- The claims in a JWT are normally statements about the subject.
- The subject value MUST either be scoped to be locally unique in the context of the issuer or be globally unique.
- The processing of this claim is generally application specific.
- The "sub" value is a case-sensitive string containing a StringOrURI value.
- Use of this claim is OPTIONAL.
:END:
*** What is registered claim name "aud" (Audience) Claim         :QUESTION:
:ANSWER:
- The "aud" (audience) claim identifies the recipients that the JWT is intended for.
- Each principal intended to process the JWT MUST identify itself with a value in the audience claim.
- If the principal processing the claim does not identify itself with a value in the "aud" claim when this claim is present, then the JWT MUST be rejected.
- In the general case, the "aud" value is an array of case-sensitive strings, each containing a StringOrURI value.
- In the special case when the JWT has one audience, the "aud" value MAY be a single case-sensitive string containing a StringOrURI value.
- The interpretation of audience values is generally application specific.
- Use of this claim is OPTIONAL.
:END:
*** What is registered claim name "exp" (Expiration Time) Claim  :QUESTION:
:ANSWER:
- The "exp" (expiration time) claim identifies the expiration time on or after which the JWT MUST NOT be accepted for processing.
- The processing of the "exp" claim requires that the current date/time MUST be before the expiration date/time listed in the "exp" claim.
- Implementers MAY provide for some small leeway, usually no more than a few minutes, to account for clock skew.
- Its value MUST be a number containing a NumericDate value.
- Use of this claim is OPTIONAL. 
:END:
*** What is registered claim name "nbf" (Not Before) Claim       :QUESTION:
:ANSWER:
- The "nbf" (not before) claim identifies the time before which the JWT MUST NOT be accepted for processing.
- The processing of the "nbf" claim requires that the current date/time MUST be after or equal to the not-before date/time listed in the "nbf" claim.
- Implementers MAY provide for some small leeway, usually no more than a few minutes, to account for clock skew.
- Its value MUST be a number containing a NumericDate value.
- Use of this claim is OPTIONAL.
*** What is registered claim name "iat" (Issued At) Claim        :QUESTION:
- The "iat" (issued at) claim identifies the time at which the JWT was issued.
- This claim can be used to determine the age of the JWT.
- Its value MUST be a number containing a NumericDate value.
- Use of this claim is OPTIONAL.
:END:
*** What is registered claim name "jti" (JWT ID) Claim           :QUESTION:
:ANSWER:
- The "jti" (JWT ID) claim provides a unique identifier for the JWT.
- The identifier value MUST be assigned in a manner that ensures that there is a negligible probability that the same value will be accidentally assigned to a different data object;
- if the application uses multiple issuers, collisions MUST be prevented among values produced by different issuers as well.
- The "jti" claim can be used to prevent the JWT from being replayed.
- The "jti" value is a case-sensitive string.
- Use of this claim is OPTIONAL.
:END:
*** What are Public Claim Names                                  :QUESTION:
:ANSWER:
- Claim Names can be defined at will by those using JWTs.
- However, in order to prevent collisions, any new Claim Name should either be registered in the IANA "JSON Web Token Claims" registry established by Section 10.1 or be a Public Name:
  - a value that contains a Collision-Resistant Name.
- In each case, the definer of the name or value needs to take reasonable precautions to make sure they are in control of the part of the namespace they use to define the Claim Name.
:END:
