public/fullstack.html
<div id="outline-container-org7f52f73" class="outline-4">
<h4 id="org7f52f73"><span class="section-number-4">8.2.3</span> What is acr_values</h4>
<div class="outline-text-4" id="text-8-2-3">
<pre class="example">
lerning: https://ldapwiki.com/wiki/Acr_values
</pre>
<ul class="org-ul">
<li>Acr_values is an OPTIONAL parameter that is a Space-separated string that specifies the Authentication Context Class Values within the Authentication Request that the Authorization Server is being requested to use for processing requests from this Client, with the values appearing in order of preference.</li>
<li>Acr_values was originally specified within the JSON Web Token (JWT) Profile for OAuth 2.0 Client Authentication and Authorization Grants (RFC 7523)</li>

<li>The Authentication Context Class Reference values actually utilized by the Authorization Server is returned within the Identity Token in the acr parameter.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga894bf5" class="outline-3">
<h3 id="orga894bf5"><span class="section-number-3">8.3</span> JWT</h3>
<div class="outline-text-3" id="text-8-3">
<pre class="example">
learning: https://tools.ietf.org/html/rfc7519
</pre>
</div>
<div id="outline-container-org1c0a5bb" class="outline-4">
<h4 id="org1c0a5bb"><span class="section-number-4">8.3.1</span> What are the registered claim names?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
</div>
<div id="outline-container-orgec9ed95" class="outline-4">
<h4 id="orgec9ed95"><span class="section-number-4">8.3.2</span> What is registered claim name "iss" (Issuer) Claim?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-2">
<ul class="org-ul">
<li>The "iss" (issuer) claim identifies the principal that issued the JWT.</li>
<li>The processing of this claim is generally application specific.</li>
<li>The "iss" value is a case-sensitive string containing a StringOrURI value.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2c09fa" class="outline-4">
<h4 id="orgc2c09fa"><span class="section-number-4">8.3.3</span> What is registered claim name "sub" (Subject) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-3">
<ul class="org-ul">
<li>The "sub" (subject) claim identifies the principal that is the subject of the JWT.</li>
<li>The claims in a JWT are normally statements about the subject.</li>
<li>The subject value MUST either be scoped to be locally unique in the context of the issuer or be globally unique.</li>
<li>The processing of this claim is generally application specific.</li>
<li>The "sub" value is a case-sensitive string containing a StringOrURI value.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb583781" class="outline-4">
<h4 id="orgb583781"><span class="section-number-4">8.3.4</span> What is registered claim name "aud" (Audience) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-4">
<ul class="org-ul">
<li>The "aud" (audience) claim identifies the recipients that the JWT is intended for.</li>
<li>Each principal intended to process the JWT MUST identify itself with a value in the audience claim.</li>
<li>If the principal processing the claim does not identify itself with a value in the "aud" claim when this claim is present, then the JWT MUST be rejected.</li>
<li>In the general case, the "aud" value is an array of case-sensitive strings, each containing a StringOrURI value.</li>
<li>In the special case when the JWT has one audience, the "aud" value MAY be a single case-sensitive string containing a StringOrURI value.</li>
<li>The interpretation of audience values is generally application specific.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb27d13c" class="outline-4">
<h4 id="orgb27d13c"><span class="section-number-4">8.3.5</span> What is registered claim name "exp" (Expiration Time) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-5">
<ul class="org-ul">
<li>The "exp" (expiration time) claim identifies the expiration time on or after which the JWT MUST NOT be accepted for processing.</li>
<li>The processing of the "exp" claim requires that the current date/time MUST be before the expiration date/time listed in the "exp" claim.</li>
<li>Implementers MAY provide for some small leeway, usually no more than a few minutes, to account for clock skew.</li>
<li>Its value MUST be a number containing a NumericDate value.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-org60bf64c" class="outline-4">
<h4 id="org60bf64c"><span class="section-number-4">8.3.6</span> What is registered claim name "nbf" (Not Before) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-6">
<p>
:ANSWER:
</p>
<ul class="org-ul">
<li>The "nbf" (not before) claim identifies the time before which the JWT MUST NOT be accepted for processing.</li>
<li>The processing of the "nbf" claim requires that the current date/time MUST be after or equal to the not-before date/time listed in the "nbf" claim.</li>
<li>Implementers MAY provide for some small leeway, usually no more than a few minutes, to account for clock skew.</li>
<li>Its value MUST be a number containing a NumericDate value.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-org96d62e0" class="outline-4">
<h4 id="org96d62e0"><span class="section-number-4">8.3.7</span> What is registered claim name "iat" (Issued At) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-7">
<ul class="org-ul">
<li>The "iat" (issued at) claim identifies the time at which the JWT was issued.</li>
<li>This claim can be used to determine the age of the JWT.</li>
<li>Its value MUST be a number containing a NumericDate value.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf53e15" class="outline-4">
<h4 id="orgaf53e15"><span class="section-number-4">8.3.8</span> What is registered claim name "jti" (JWT ID) Claim&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-8">
<ul class="org-ul">
<li>The "jti" (JWT ID) claim provides a unique identifier for the JWT.</li>
<li>The identifier value MUST be assigned in a manner that ensures that there is a negligible probability that the same value will be accidentally assigned to a different data object;</li>
<li>if the application uses multiple issuers, collisions MUST be prevented among values produced by different issuers as well.</li>
<li>The "jti" claim can be used to prevent the JWT from being replayed.</li>
<li>The "jti" value is a case-sensitive string.</li>
<li>Use of this claim is OPTIONAL.</li>
</ul>
</div>
</div>
<div id="outline-container-org9715875" class="outline-4">
<h4 id="org9715875"><span class="section-number-4">8.3.9</span> What are Public Claim Names&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-3-9">
<ul class="org-ul">
<li>Claim Names can be defined at will by those using JWTs.</li>
<li>However, in order to prevent collisions, any new Claim Name should either be registered in the IANA "JSON Web Token Claims" registry established by Section 10.1 or be a Public Name:
<ul class="org-ul">
<li>a value that contains a Collision-Resistant Name.</li>
</ul></li>
<li>In each case, the definer of the name or value needs to take reasonable precautions to make sure they are in control of the part of the namespace they use to define the Claim Name.</li>
</ul>
</div>
</div>
</div>
