README.org
** WIP JWKS
:PROPERTIES:
:lerning:  https://auth0.com/docs/tokens/json-web-tokens/json-web-key-sets
:END:
- JSON Web Key Sets:
  - The JSON Web Key Set (JWKS) is a set of keys containing the public keys used to verify any JSON Web Token (JWT) issued by the authorization server and signed using the RS256 signing algorithm.
  - When creating applications and APIs in Auth0, two algorithms are supported for signing JWTs: RS256 and HS256.
    - RS256 generates an asymmetric signature, which means a private key must be used to sign the JWT and a different public key must be used to verify the signature.
  - Auth0 uses the JSON Web Key (JWK) specification to represent the cryptographic keys used for signing RS256 tokens. This specification defines two high-level data structures: JSON Web Key (JWK) and JSON Web Key Set (JWKS). Here are the definitions from the specification:

| Item                    | Description                                                                                                                        |
| JSON Web Key (JWK)      | A JSON object that represents a cryptographic key. The members of the object represent properties of the key, including its value. |
| JSON Web Key Set (JWKS) | A JSON object that represents a set of JWKs. The JSON object MUST have a keys member, which is an array of JWKs.                   |

Auth0 exposes a JWKS endpoint for each tenant, which is found at https://YOUR_DOMAIN/.well-known/jwks.json. This endpoint will contain the JWK used to sign all Auth0-issued JWTs for this tenant.

** LDAP
*** object class
**** inetOrgPerson
*** OID
*** CN, DN, SN,
** OWASP top 10 2017
:PROPERTIES:
:learning: - https://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/
:END:
*** A1:2017-Injection
*** A2:2017-Broken Authentication
*** A3:2017-Sensitive Data Exposure
*** A4:2017-XML External Entities (XXE)
*** A5:2017-Broken Access Control
*** A6:2017-Security Misconfiguration
*** A7:2017-Cross-Site Scripting (XSS)
*** A8:2017-Insecure Deserialization
*** A9:2017-Using Components with Known Vulnerabilities
*** A10:2017-Insufficient Logging & Monitoring
** Crypto
*** Block Ciphers
**** ECB, CBC, OFB, CFB, CTR  - what they are
:PROPERTIES:
:learning:    https:/www.highgo.ca/2019/08/08/the-difference-in-five-modes-in-the-aes-encryption-algorithm//
:END:
**** RSA
**** AES
**** DES
*** Hash
***** base64
*** symetricka sifra
*** asymetricka sifra
*** HMAC
:PROPERTIES:
:learning: https://en.wikipedia.org/wiki/HMAC
:END:
:ANSWER:
- In cryptography, an HMAC (sometimes expanded as either keyed-hash message authentication code or hash-based message authentication code) is a specific type of message authentication code (MAC) involving a cryptographic hash function and a secret cryptographic key. 
- As with any MAC, it may be used to simultaneously verify both the data integrity and the authenticity of a message. 
:END:

*** RS256 vs HS256: What's the difference?
:PROPERTIES:
:learning: https://stackoverflow.com/questions/39239051/rs256-vs-hs256-whats-the-difference
:END:
:ANSWER:
- Both choices refer to what algorithm the identity provider uses to sign the JWT. Signing is a cryptographic operation that generates a "signature" (part of the JWT) that the recipient of the token can validate to ensure that the token has not been tampered with.
  - *RS256 (RSA Signature with SHA-256)* is an asymmetric algorithm, and it uses a public/private key pair: the identity provider has a private (secret) key used to generate the signature, and the consumer of the JWT gets a public key to validate the signature. Since the public key, as opposed to the private key, doesn't need to be kept secured, most identity providers make it easily available for consumers to obtain and use (usually through a metadata URL).
  - *HS256 (HMAC with SHA-256)*, on the other hand, involves a combination of a hashing function and one (secret) key that is shared between the two parties used to generate the hash that will serve as the signature. Since the same key is used both to generate the signature and to validate it, care must be taken to ensure that the key is not compromised.
- If you will be developing the application consuming the JWTs, you can safely use HS256, because you will have control on who uses the secret keys. If, on the other hand, you don't have control over the client, or you have no way of securing a secret key, RS256 will be a better fit, since the consumer only needs to know the public (shared) key.
- Since the public key is usually made available from metadata endpoints, clients can be programmed to retrieve the public key automatically. If this is the case (as it is with the .Net Core libraries), you will have less work to do on configuration (the libraries will fetch the public key from the server). Symmetric keys, on the other hand, need to be exchanged out of band (ensuring a secure communication channel), and manually updated if there is a signing key rollover.
- Auth0 provides metadata endpoints for the OIDC, SAML and WS-Fed protocols, where the public keys can be retrieved. You can see those endpoints under the "Advanced Settings" of a client.
- The OIDC metadata endpoint, for example, takes the form of https://{account domain}/.well-known/openid-configuration.
  - If you browse to that URL, you will see a JSON object with a reference to https://{account domain}/.well-known/jwks.json, which contains the public key (or keys) of the account.
- If you look at the RS256 samples, you will see that you don't need to configure the public key anywhere: it's retrieved automatically by the framework.
:END:

** bastillion.io
** PKI
** X509
