public/fullstack.html
<div id="outline-container-org1135a2f" class="outline-3">
<h3 id="org1135a2f"><span class="section-number-3">8.4</span> <span class="todo WIP">WIP</span> JWKS</h3>
<div class="outline-text-3" id="text-8-4">
<pre class="example">
lerning: https://auth0.com/docs/tokens/json-web-tokens/json-web-key-sets
</pre>
<ul class="org-ul">
<li>JSON Web Key Sets:
<ul class="org-ul">
<li>The JSON Web Key Set (JWKS) is a set of keys containing the public keys used to verify any JSON Web Token (JWT) issued by the authorization server and signed using the RS256 signing algorithm.</li>
<li>When creating applications and APIs in Auth0, two algorithms are supported for signing JWTs: RS256 and HS256.
<ul class="org-ul">
<li>RS256 generates an asymmetric signature, which means a private key must be used to sign the JWT and a different public key must be used to verify the signature.</li>
</ul></li>
<li>Auth0 uses the JSON Web Key (JWK) specification to represent the cryptographic keys used for signing RS256 tokens. This specification defines two high-level data structures: JSON Web Key (JWK) and JSON Web Key Set (JWKS). Here are the definitions from the specification:</li>
</ul></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Item</td>
<td class="org-left">Description</td>
</tr>

<tr>
<td class="org-left">JSON Web Key (JWK)</td>
<td class="org-left">A JSON object that represents a cryptographic key. The members of the object represent properties of the key, including its value.</td>
</tr>

<tr>
<td class="org-left">JSON Web Key Set (JWKS)</td>
<td class="org-left">A JSON object that represents a set of JWKs. The JSON object MUST have a keys member, which is an array of JWKs.</td>
</tr>
</tbody>
</table>

<p>
Auth0 exposes a JWKS endpoint for each tenant, which is found at <a href="https://your_domain/.well-known/jwks.json">https://your_domain/.well-known/jwks.json</a>. This endpoint will contain the JWK used to sign all Auth0-issued JWTs for this tenant.
</p>
</div>
</div>

<div id="outline-container-org657b313" class="outline-3">
<h3 id="org657b313"><span class="section-number-3">8.5</span> LDAP</h3>
<div class="outline-text-3" id="text-8-5">
</div>
<div id="outline-container-org14ffc52" class="outline-4">
<h4 id="org14ffc52"><span class="section-number-4">8.5.1</span> object class</h4>
<div class="outline-text-4" id="text-8-5-1">
</div>
<div id="outline-container-org47524c7" class="outline-5">
<h5 id="org47524c7"><span class="section-number-5">8.5.1.1</span> inetOrgPerson</h5>
</div>
</div>
<div id="outline-container-orged25d61" class="outline-4">
<h4 id="orged25d61"><span class="section-number-4">8.5.2</span> OID</h4>
</div>
<div id="outline-container-orgd94afcc" class="outline-4">
<h4 id="orgd94afcc"><span class="section-number-4">8.5.3</span> CN, DN, SN,</h4>
</div>
</div>
<div id="outline-container-org9e40089" class="outline-3">
<h3 id="org9e40089"><span class="section-number-3">8.6</span> OWASP top 10 2017</h3>
<div class="outline-text-3" id="text-8-6">
<pre class="example">
learning: - https://owasp.org/www-project-top-ten/OWASP_Top_Ten_2017/
</pre>
</div>
<div id="outline-container-org8ce73e5" class="outline-4">
<h4 id="org8ce73e5"><span class="section-number-4">8.6.1</span> A1:2017-Injection</h4>
</div>
<div id="outline-container-org24e39bb" class="outline-4">
<h4 id="org24e39bb"><span class="section-number-4">8.6.2</span> A2:2017-Broken Authentication</h4>
</div>
<div id="outline-container-orgc25ab00" class="outline-4">
<h4 id="orgc25ab00"><span class="section-number-4">8.6.3</span> A3:2017-Sensitive Data Exposure</h4>
</div>
<div id="outline-container-orge918c6b" class="outline-4">
<h4 id="orge918c6b"><span class="section-number-4">8.6.4</span> A4:2017-XML External Entities (XXE)</h4>
</div>
<div id="outline-container-org59856b3" class="outline-4">
<h4 id="org59856b3"><span class="section-number-4">8.6.5</span> A5:2017-Broken Access Control</h4>
</div>
<div id="outline-container-org6a66c29" class="outline-4">
<h4 id="org6a66c29"><span class="section-number-4">8.6.6</span> A6:2017-Security Misconfiguration</h4>
</div>
<div id="outline-container-orga6f9dda" class="outline-4">
<h4 id="orga6f9dda"><span class="section-number-4">8.6.7</span> A7:2017-Cross-Site Scripting (XSS)</h4>
</div>
<div id="outline-container-org2f99846" class="outline-4">
<h4 id="org2f99846"><span class="section-number-4">8.6.8</span> A8:2017-Insecure Deserialization</h4>
</div>
<div id="outline-container-org2ac136e" class="outline-4">
<h4 id="org2ac136e"><span class="section-number-4">8.6.9</span> A9:2017-Using Components with Known Vulnerabilities</h4>
</div>
<div id="outline-container-orgc28b317" class="outline-4">
<h4 id="orgc28b317"><span class="section-number-4">8.6.10</span> A10:2017-Insufficient Logging &amp; Monitoring</h4>
</div>
</div>
<div id="outline-container-org84ada5d" class="outline-3">
<h3 id="org84ada5d"><span class="section-number-3">8.7</span> Crypto</h3>
<div class="outline-text-3" id="text-8-7">
</div>
<div id="outline-container-orgb98ece0" class="outline-4">
<h4 id="orgb98ece0"><span class="section-number-4">8.7.1</span> Block Ciphers</h4>
<div class="outline-text-4" id="text-8-7-1">
</div>
<div id="outline-container-org989238e" class="outline-5">
<h5 id="org989238e"><span class="section-number-5">8.7.1.1</span> ECB, CBC, OFB, CFB, CTR  - what they are</h5>
<div class="outline-text-5" id="text-8-7-1-1">
<pre class="example">
learning: https:/www.highgo.ca/2019/08/08/the-difference-in-five-modes-in-the-aes-encryption-algorithm//
</pre>
</div>
</div>
<div id="outline-container-org1d1b6d5" class="outline-5">
<h5 id="org1d1b6d5"><span class="section-number-5">8.7.1.2</span> RSA</h5>
</div>
<div id="outline-container-orgc65d75d" class="outline-5">
<h5 id="orgc65d75d"><span class="section-number-5">8.7.1.3</span> AES</h5>
</div>
<div id="outline-container-org90cb979" class="outline-5">
<h5 id="org90cb979"><span class="section-number-5">8.7.1.4</span> DES</h5>
</div>
</div>
<div id="outline-container-orgef703a8" class="outline-4">
<h4 id="orgef703a8"><span class="section-number-4">8.7.2</span> Hash</h4>
<div class="outline-text-4" id="text-8-7-2">
</div>
<div id="outline-container-org5035f8c" class="outline-6">
<h6 id="org5035f8c">base64</h6>
</div>
</div>
<div id="outline-container-org80c1e91" class="outline-4">
<h4 id="org80c1e91"><span class="section-number-4">8.7.3</span> symetricka sifra</h4>
</div>
<div id="outline-container-orgcb67580" class="outline-4">
<h4 id="orgcb67580"><span class="section-number-4">8.7.4</span> asymetricka sifra</h4>
</div>
<div id="outline-container-org8811ad3" class="outline-4">
<h4 id="org8811ad3"><span class="section-number-4">8.7.5</span> RS256 vs HS256: What's the difference?</h4>
<div class="outline-text-4" id="text-8-7-5">
<pre class="example">
learning: https://stackoverflow.com/questions/39239051/rs256-vs-hs256-whats-the-difference
</pre>
<ul class="org-ul">
<li>Both choices refer to what algorithm the identity provider uses to sign the JWT. Signing is a cryptographic operation that generates a "signature" (part of the JWT) that the recipient of the token can validate to ensure that the token has not been tampered with.
<ul class="org-ul">
<li><b>RS256 (RSA Signature with SHA-256)</b> is an asymmetric algorithm, and it uses a public/private key pair: the identity provider has a private (secret) key used to generate the signature, and the consumer of the JWT gets a public key to validate the signature. Since the public key, as opposed to the private key, doesn't need to be kept secured, most identity providers make it easily available for consumers to obtain and use (usually through a metadata URL).</li>
<li><b>HS256 (HMAC with SHA-256)</b>, on the other hand, involves a combination of a hashing function and one (secret) key that is shared between the two parties used to generate the hash that will serve as the signature. Since the same key is used both to generate the signature and to validate it, care must be taken to ensure that the key is not compromised.</li>
</ul></li>
<li>If you will be developing the application consuming the JWTs, you can safely use HS256, because you will have control on who uses the secret keys. If, on the other hand, you don't have control over the client, or you have no way of securing a secret key, RS256 will be a better fit, since the consumer only needs to know the public (shared) key.</li>
<li>Since the public key is usually made available from metadata endpoints, clients can be programmed to retrieve the public key automatically. If this is the case (as it is with the .Net Core libraries), you will have less work to do on configuration (the libraries will fetch the public key from the server). Symmetric keys, on the other hand, need to be exchanged out of band (ensuring a secure communication channel), and manually updated if there is a signing key rollover.</li>
<li>Auth0 provides metadata endpoints for the OIDC, SAML and WS-Fed protocols, where the public keys can be retrieved. You can see those endpoints under the "Advanced Settings" of a client.</li>
<li>The OIDC metadata endpoint, for example, takes the form of <a href="https://{account">https://{account</a> domain}/.well-known/openid-configuration.
<ul class="org-ul">
<li>If you browse to that URL, you will see a JSON object with a reference to <a href="https://{account">https://{account</a> domain}/.well-known/jwks.json, which contains the public key (or keys) of the account.</li>
</ul></li>
<li>If you look at the RS256 samples, you will see that you don't need to configure the public key anywhere: it's retrieved automatically by the framework.</li>
</ul>
</div>
</div>
</div>
