README.org
*** Why does GoDaddy have four different certificate chain, G2, G3, G4? :QUESTION:
:ANSWER:
- "G" stands for Root certificates generation.
- Basically, it identifies the generation (version) of a Root certificate that signs the Chain of trust.
- When CA needs to get a new chain (for example, because of upgrade from SHA-1 to SHA-256), they just increment the generation number.
- This is good because obsolete certificates can be better identified.
:END:
** TODO Illumio Security
** TODO DEVSECOPS

* WIP Languages & programming                                        :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: LANGUAGES
:END:
** Functional Programming                                           :TOPIC:
*** Lambda Calculus                                                 :TOPIC:
**** α-conversion
- changing bound variables
**** β-reduction
- applying functions to their arguments;
**** η-reduction
- which captures a notion of extensionality.
*** Patterns
**** Monoid
**** Functor
**** Applicative
**** Monad
**** Kleisli Functor
**** Optics
***** Lenses
***** Prisms
**** Recursion Schemes
***** catamorphisms
***** anamorphisms
***** hylomorphisms
***** paramorphisms

***** Persistent data structure - Chris Okasaki
**** Immutability                                                  :TOPIC:
** Object Oriented Programming                                      :TOPIC:
*** Polymorphism
*** Gof Design Patterns
**** Abstract Factory 
**** Singleton
** ReasonML                                                          :TOPIC:
** JavaScript                                                       :TOPIC:
*** what is IIFE?                                                :QUESTION:
- An Immediately Invoked Function Expression is a good way at protecting the scope of your function and the variables within it.
*** inheritance model of JS
**** What is template based inheritance
*** hoisting
*** event loop
*** promisses
*** observables
*** RxJS
*** JS modular system
** TypeScript                                                        :TOPIC:
** Babel
** Java                                                              :TOPIC:
*** Basic Java
**** hashCode()
***** is this code wrong? yes / no / why                       :QUESTION:
Imagine you replace all haskCode implementation by this - what will happen
#+begin_src java
@Override
public final int hashCode() {
    int result = 17;
    return result;
}
#+end_src
**** hashCode vs equals()                                       :QUESTION:
**** what is a contract?                                        :QUESTION:
**** Java Collections Framework:
***** what is a difference between List vs Set vs Map          :QUESTION:
***** what is the difference ArrayList vs LinkedList           :QUESTION:
**** StringBuilder vs StringBuffer vs String
**** Can we have static method in the interface?                :QUESTION:
:ANSWER:
- Yes, we can have static method in the interface from Java 8.
:END:
****  You have a list of Custom objects? How can you sort them? :QUESTION:
:ANSWER:
You need to use Comparable or Comparator interface to sort list of custom objects.
:END:
