public/fullstack.html

<div id="outline-container-orge5f95ee" class="outline-3">
<h3 id="orge5f95ee"><span class="section-number-3">8.8</span> bastillion.io</h3>
</div>
<div id="outline-container-orgf2f7b93" class="outline-3">
<h3 id="orgf2f7b93"><span class="section-number-3">8.9</span> PKI</h3>
</div>
<div id="outline-container-orgd8768f2" class="outline-3">
<h3 id="orgd8768f2"><span class="section-number-3">8.10</span> X509</h3>
<div class="outline-text-3" id="text-8-10">
</div>
<div id="outline-container-org281db16" class="outline-4">
<h4 id="org281db16"><span class="section-number-4">8.10.1</span> Why does GoDaddy have four different certificate chain, G2, G3, G4?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-8-10-1">
<ul class="org-ul">
<li>"G" stands for Root certificates generation.</li>
<li>Basically, it identifies the generation (version) of a Root certificate that signs the Chain of trust.</li>
<li>When CA needs to get a new chain (for example, because of upgrade from SHA-1 to SHA-256), they just increment the generation number.</li>
<li>This is good because obsolete certificates can be better identified.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8eb877b" class="outline-3">
<h3 id="org8eb877b"><span class="section-number-3">8.11</span> <span class="todo TODO">TODO</span> Illumio Security</h3>
</div>
<div id="outline-container-org281d9d7" class="outline-3">
<h3 id="org281d9d7"><span class="section-number-3">8.12</span> <span class="todo TODO">TODO</span> DEVSECOPS</h3>
</div>
</div>

<div id="outline-container-org22496e8" class="outline-2">
<h2 id="LANGUAGES"><span class="section-number-2">9</span> <span class="todo WIP">WIP</span> Languages &amp; programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-LANGUAGES">
<pre class="example">
CUSTOM_ID: LANGUAGES
</pre>
</div>
<div id="outline-container-orgfd5e72a" class="outline-3">
<h3 id="orgfd5e72a"><span class="section-number-3">9.1</span> Functional Programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgb6fea3a" class="outline-4">
<h4 id="orgb6fea3a"><span class="section-number-4">9.1.1</span> Lambda Calculus&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
<div class="outline-text-4" id="text-9-1-1">
</div>
<div id="outline-container-org0794a1f" class="outline-5">
<h5 id="org0794a1f"><span class="section-number-5">9.1.1.1</span> α-conversion</h5>
<div class="outline-text-5" id="text-9-1-1-1">
<ul class="org-ul">
<li>changing bound variables</li>
</ul>
</div>
</div>
<div id="outline-container-orgdf19e7c" class="outline-5">
<h5 id="orgdf19e7c"><span class="section-number-5">9.1.1.2</span> β-reduction</h5>
<div class="outline-text-5" id="text-9-1-1-2">
<ul class="org-ul">
<li>applying functions to their arguments;</li>
</ul>
</div>
</div>
<div id="outline-container-org63bd884" class="outline-5">
<h5 id="org63bd884"><span class="section-number-5">9.1.1.3</span> η-reduction</h5>
<div class="outline-text-5" id="text-9-1-1-3">
<ul class="org-ul">
<li>which captures a notion of extensionality.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb99e1db" class="outline-4">
<h4 id="orgb99e1db"><span class="section-number-4">9.1.2</span> Patterns</h4>
<div class="outline-text-4" id="text-9-1-2">
</div>
<div id="outline-container-org7d1e0fd" class="outline-5">
<h5 id="org7d1e0fd"><span class="section-number-5">9.1.2.1</span> Monoid</h5>
</div>
<div id="outline-container-org1b72ddb" class="outline-5">
<h5 id="org1b72ddb"><span class="section-number-5">9.1.2.2</span> Functor</h5>
</div>
<div id="outline-container-orge858eaa" class="outline-5">
<h5 id="orge858eaa"><span class="section-number-5">9.1.2.3</span> Applicative</h5>
</div>
<div id="outline-container-org80eaf2e" class="outline-5">
<h5 id="org80eaf2e"><span class="section-number-5">9.1.2.4</span> Monad</h5>
</div>
<div id="outline-container-orgfd5d470" class="outline-5">
<h5 id="orgfd5d470"><span class="section-number-5">9.1.2.5</span> Kleisli Functor</h5>
</div>
<div id="outline-container-orgc19920d" class="outline-5">
<h5 id="orgc19920d"><span class="section-number-5">9.1.2.6</span> Optics</h5>
<div class="outline-text-5" id="text-9-1-2-6">
</div>
<div id="outline-container-org8ee7319" class="outline-6">
<h6 id="org8ee7319">Lenses</h6>
</div>
<div id="outline-container-org2129783" class="outline-6">
<h6 id="org2129783">Prisms</h6>
</div>
</div>
<div id="outline-container-org0998459" class="outline-5">
<h5 id="org0998459"><span class="section-number-5">9.1.2.7</span> Recursion Schemes</h5>
<div class="outline-text-5" id="text-9-1-2-7">
</div>
<div id="outline-container-org20908e4" class="outline-6">
<h6 id="org20908e4">catamorphisms</h6>
</div>
<div id="outline-container-org09be9a6" class="outline-6">
<h6 id="org09be9a6">anamorphisms</h6>
</div>
<div id="outline-container-org9a75cd5" class="outline-6">
<h6 id="org9a75cd5">hylomorphisms</h6>
</div>
<div id="outline-container-orgad82b97" class="outline-6">
<h6 id="orgad82b97">paramorphisms</h6>
</div>

<div id="outline-container-org91973cf" class="outline-6">
<h6 id="org91973cf">Persistent data structure - Chris Okasaki</h6>
</div>
</div>
<div id="outline-container-orgb546ea9" class="outline-5">
<h5 id="orgb546ea9"><span class="section-number-5">9.1.2.8</span> Immutability&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h5>
</div>
</div>
</div>
<div id="outline-container-org7bd3b49" class="outline-3">
<h3 id="org7bd3b49"><span class="section-number-3">9.2</span> Object Oriented Programming&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgb8e9080" class="outline-4">
<h4 id="orgb8e9080"><span class="section-number-4">9.2.1</span> Polymorphism</h4>
</div>
<div id="outline-container-org84c5128" class="outline-4">
<h4 id="org84c5128"><span class="section-number-4">9.2.2</span> Gof Design Patterns</h4>
<div class="outline-text-4" id="text-9-2-2">
</div>
<div id="outline-container-org659737e" class="outline-5">
<h5 id="org659737e"><span class="section-number-5">9.2.2.1</span> Abstract Factory</h5>
</div>
<div id="outline-container-org5155ce1" class="outline-5">
<h5 id="org5155ce1"><span class="section-number-5">9.2.2.2</span> Singleton</h5>
</div>
</div>
</div>
<div id="outline-container-org5f64b62" class="outline-3">
<h3 id="org5f64b62"><span class="section-number-3">9.3</span> ReasonML&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org6897862" class="outline-3">
<h3 id="org6897862"><span class="section-number-3">9.4</span> JavaScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-9-4">
</div>
<div id="outline-container-org9eee02c" class="outline-4">
<h4 id="org9eee02c"><span class="section-number-4">9.4.1</span> what is IIFE?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h4>
<div class="outline-text-4" id="text-9-4-1">
<ul class="org-ul">
<li>An Immediately Invoked Function Expression is a good way at protecting the scope of your function and the variables within it.</li>
</ul>
</div>
</div>
<div id="outline-container-org411f3a7" class="outline-4">
<h4 id="org411f3a7"><span class="section-number-4">9.4.2</span> inheritance model of JS</h4>
</div>
<div id="outline-container-orgee2b0aa" class="outline-4">
<h4 id="orgee2b0aa"><span class="section-number-4">9.4.3</span> hoisting</h4>
</div>
<div id="outline-container-org0cfb762" class="outline-4">
<h4 id="org0cfb762"><span class="section-number-4">9.4.4</span> event loop</h4>
</div>
<div id="outline-container-orgf0f4fe3" class="outline-4">
<h4 id="orgf0f4fe3"><span class="section-number-4">9.4.5</span> promisses</h4>
</div>
<div id="outline-container-orgac07504" class="outline-4">
<h4 id="orgac07504"><span class="section-number-4">9.4.6</span> observables</h4>
</div>
<div id="outline-container-org4c8a467" class="outline-4">
<h4 id="org4c8a467"><span class="section-number-4">9.4.7</span> RxJS</h4>
</div>
<div id="outline-container-org33b3c9b" class="outline-4">
<h4 id="org33b3c9b"><span class="section-number-4">9.4.8</span> JS modular system</h4>
</div>
</div>
<div id="outline-container-org8f81b22" class="outline-3">
<h3 id="org8f81b22"><span class="section-number-3">9.5</span> TypeScript&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org81433c4" class="outline-3">
<h3 id="org81433c4"><span class="section-number-3">9.6</span> Babel</h3>
</div>
<div id="outline-container-orge4b4a68" class="outline-3">
<h3 id="orge4b4a68"><span class="section-number-3">9.7</span> Java&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-9-7">
</div>
<div id="outline-container-orgbdad914" class="outline-4">
<h4 id="orgbdad914"><span class="section-number-4">9.7.1</span> Basic Java</h4>
<div class="outline-text-4" id="text-9-7-1">
</div>
<div id="outline-container-org59f8668" class="outline-5">
<h5 id="org59f8668"><span class="section-number-5">9.7.1.1</span> hashCode()</h5>
<div class="outline-text-5" id="text-9-7-1-1">
</div>
<div id="outline-container-orgbbdb687" class="outline-6">
<h6 id="orgbbdb687">is this code wrong? yes / no / why&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h6>
<div class="outline-text-6" id="text-orgbbdb687">
<p>
Imagine you replace all haskCode implementation by this - what will happen
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #D0372D;">@Override</span>
<span style="color: #0000FF;">public</span> <span style="color: #0000FF;">final</span> <span style="color: #6434A3;">int</span> <span style="color: #006699;">hashCode</span>() {
    <span style="color: #6434A3;">int</span> <span style="color: #BA36A5;">result</span> = 17;
    <span style="color: #0000FF;">return</span> result;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf5879be" class="outline-5">
<h5 id="orgf5879be"><span class="section-number-5">9.7.1.2</span> hashCode vs equals()&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org303eb33" class="outline-5">
<h5 id="org303eb33"><span class="section-number-5">9.7.1.3</span> what is a contract?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org5720c6a" class="outline-5">
<h5 id="org5720c6a"><span class="section-number-5">9.7.1.4</span> Java Collections Framework:</h5>
<div class="outline-text-5" id="text-9-7-1-4">
</div>
<div id="outline-container-org371152e" class="outline-6">
<h6 id="org371152e">what is a difference between List vs Set vs Map&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h6>
</div>
<div id="outline-container-orge969e54" class="outline-6">
<h6 id="orge969e54">what is the difference ArrayList vs LinkedList&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h6>
</div>
</div>
<div id="outline-container-org471b5b6" class="outline-5">
<h5 id="org471b5b6"><span class="section-number-5">9.7.1.5</span> StringBuilder vs StringBuffer vs String</h5>
</div>
<div id="outline-container-orgc58fb13" class="outline-5">
<h5 id="orgc58fb13"><span class="section-number-5">9.7.1.6</span> Can we have static method in the interface?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-6">
<ul class="org-ul">
<li>Yes, we can have static method in the interface from Java 8.</li>
</ul>
</div>
</div>
<div id="outline-container-orga24076a" class="outline-5">
<h5 id="orga24076a"><span class="section-number-5">9.7.1.7</span> You have a list of Custom objects? How can you sort them?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-7">
<p>
You need to use Comparable or Comparator interface to sort list of custom objects.
</p>
</div>
</div>
