README.org
**** How to create thread safe Singleton in Java                :QUESTION:
:ANSWER:
- use double checked locking
- use class loader
- use enum
- Read more: https://javarevisited.blogspot.com/2012/12/how-to-create-thread-safe-singleton-in-java-example.html#ixzz6Y1Y1v8C1
:END:
**** Difference between List and Set in Java?                   :QUESTION:
:ANSWER:
- hint: List is ordered and allows duplicate. Set is unordered and doesn't allow duplicate elements.
:END:
**** How do you prevent a class from being sub-classed in Java? :QUESTION:
:ANSWER:
- just make its constructor private
:END:
**** Difference between throw and throws keyword in Java?       :QUESTION:
:ANSWER:
- throws declare what exception a method can throw in case of error but throw keyword actually throws an exception. 
- See Java Fundamentals: Exception Handling to learn more about Exception handling in Java. 
:END:
**** Difference between Iterator and Enumeration in Java?       :QUESTION:
:ANSWER:
- Iterator also gives you the ability to remove an element while iterating while Enumeration doesn't allow that.
:END:
**** What is IdentityHashMap in Java?  :QUESTION:
:ANSWER:
- A Map, which uses  the == equality operator to check equality instead of the equals() method.
:END:
**** What is String pool in Java?  :QUESTION:
:ANSWER:
- A pool of String literals. Remember it's moved to heap from perm gen space in JDK 7.
:END:
**** Can a Serializable class contain a non-serializable field in Java?  :QUESTION:
:ANSWER:
- Yes, but you need to make it either static or transient.
:END:
**** Difference between this and super in Java?  :QUESTION:
:ANSWER:
- this refers to the current instance while super refers to an instance of the superclass.
:END:
**** Difference between Comparator and Comparable in Java?  :QUESTION:
:ANSWER:
- Comparator defines custom ordering while Comparable defines the natural order of objects, e.g. the alphabetic order for String. See The Complete Java MasterClass to learn more about sorting in Java. 
:END:
**** BigDecimal vs float                                        :QUESTION:
**** what is the difference betwen checked and unchecked exception? :QUESTION:
**** Co všechno je špatně na tomto kusu kódu                    :QUESTION:
#+begin_src java
try {
  // ...
} catch (Exception e) {
  log.error("Oh no!", e.getMessage());
}
#+end_src
:ANSWER:
- Zdaleka největší průšvih je, že jsme přišli o stack trace!
  - Musíme nechat zalogovat celý objekt "e" a nebo aspoň přímo jeho ST.
- Chytáme příliš obecný typ, takže nemůžeme nijak rozlišit mezi jednotlivými typy chyb.
- Kombinace chytání příliš obecné chyby a neudělání re-throw, je velmi nebezpečná.
  - Pokud nechceme dělat re-throw, měli bychom chytat jen ten typ, kterého se to týká.
- A další věci, jako stupidní message "Oh no!", atd.
:END:
**** Explain Java 7 ARM (Automatic Resource Managemet) Feature and multi-catch block? :QUESTION:
- If you are catching a lot of exceptions in a single try block, you will notice that catch block code looks very ugly and mostly consists of redundant code to log the error,
- keeping this in mind Java 7 one of the feature was multi-catch block where we can catch multiple exceptions in a single catch block.
- The catch block with this feature looks like below:

#+begin_src java
  catch(IOException | SQLException | Exception ex){
      logger.error(ex);
      throw new MyException(ex.getMessage());
  }
#+end_src
- Most of the time, we use finally block just to close the resources and sometimes we forget to close them and get runtime exceptions when the resources are exhausted.
- These exceptions are hard to debug and we might need to look into each place where we are using that type of resource to make sure we are closing it.
- So java 7 one of the improvement was try-with-resources where we can create a resource in the try statement itself and use it inside the try-catch block.
- When the execution comes out of try-catch block, runtime environment automatically close these resources.
- Sample of try-catch block with this improvement is:

#+begin_src java
  try (MyResource mr = new MyResource()) {
      System.out.println("MyResource created in try-with-resources");
  } catch (Exception e) {
      e.printStackTrace();
  }
#+end_src
**** TODO JPA
**** TODO Generics
**** TODO Java 9 - project jigsaw
**** TODO QueryDSL
**** WIP Maven
***** Jaký je rozdíl mezi <dependencies> a <dependencyManagement>? :QUESTION:
:ANSWER:
- dependencyManagement má smysl je v multi-module projektu, konkrétně v otcovském pomu.
- Používá se pro deklarování dependencí a jejich scopů a verzí a každý sub-modul si pak jen řekne, které z nich chce používat (a už nemusí deklarovat scope a verzi).
- dependencies v otcovském pomu znamenají, že každý sub-modul všechny takové dependence automaticky dostane.
- Používá se to např. pro testovací balíky nebo nějaké velmi obecně použitelné commons balíky a jiné pomocné tooly jako Lombok.
:END:
