public/fullstack.html
<div id="outline-container-org76cee9c" class="outline-5">
<h5 id="org76cee9c"><span class="section-number-5">9.7.1.8</span> How to create thread safe Singleton in Java&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-8">
<ul class="org-ul">
<li>use double checked locking</li>
<li>use class loader</li>
<li>use enum</li>
<li>Read more: <a href="https://javarevisited.blogspot.com/2012/12/how-to-create-thread-safe-singleton-in-java-example.html#ixzz6Y1Y1v8C1">https://javarevisited.blogspot.com/2012/12/how-to-create-thread-safe-singleton-in-java-example.html#ixzz6Y1Y1v8C1</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5247281" class="outline-5">
<h5 id="org5247281"><span class="section-number-5">9.7.1.9</span> Difference between List and Set in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-9">
<ul class="org-ul">
<li>hint: List is ordered and allows duplicate. Set is unordered and doesn't allow duplicate elements.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb13253f" class="outline-5">
<h5 id="orgb13253f"><span class="section-number-5">9.7.1.10</span> How do you prevent a class from being sub-classed in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-10">
<ul class="org-ul">
<li>just make its constructor private</li>
</ul>
</div>
</div>
<div id="outline-container-orgf2f4c97" class="outline-5">
<h5 id="orgf2f4c97"><span class="section-number-5">9.7.1.11</span> Difference between throw and throws keyword in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-11">
<ul class="org-ul">
<li>throws declare what exception a method can throw in case of error but throw keyword actually throws an exception.</li>
<li>See Java Fundamentals: Exception Handling to learn more about Exception handling in Java.</li>
</ul>
</div>
</div>
<div id="outline-container-org97870c4" class="outline-5">
<h5 id="org97870c4"><span class="section-number-5">9.7.1.12</span> Difference between Iterator and Enumeration in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-12">
<ul class="org-ul">
<li>Iterator also gives you the ability to remove an element while iterating while Enumeration doesn't allow that.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc2c48fa" class="outline-5">
<h5 id="orgc2c48fa"><span class="section-number-5">9.7.1.13</span> What is IdentityHashMap in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-13">
<ul class="org-ul">
<li>A Map, which uses  the == equality operator to check equality instead of the equals() method.</li>
</ul>
</div>
</div>
<div id="outline-container-orge0883fc" class="outline-5">
<h5 id="orge0883fc"><span class="section-number-5">9.7.1.14</span> What is String pool in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-14">
<ul class="org-ul">
<li>A pool of String literals. Remember it's moved to heap from perm gen space in JDK 7.</li>
</ul>
</div>
</div>
<div id="outline-container-orge734cfa" class="outline-5">
<h5 id="orge734cfa"><span class="section-number-5">9.7.1.15</span> Can a Serializable class contain a non-serializable field in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-15">
<ul class="org-ul">
<li>Yes, but you need to make it either static or transient.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ae57a0" class="outline-5">
<h5 id="org5ae57a0"><span class="section-number-5">9.7.1.16</span> Difference between this and super in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-16">
<ul class="org-ul">
<li>this refers to the current instance while super refers to an instance of the superclass.</li>
</ul>
</div>
</div>
<div id="outline-container-orgbfb7af0" class="outline-5">
<h5 id="orgbfb7af0"><span class="section-number-5">9.7.1.17</span> Difference between Comparator and Comparable in Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-17">
<ul class="org-ul">
<li>Comparator defines custom ordering while Comparable defines the natural order of objects, e.g. the alphabetic order for String. See The Complete Java MasterClass to learn more about sorting in Java.</li>
</ul>
</div>
</div>
<div id="outline-container-org84a7230" class="outline-5">
<h5 id="org84a7230"><span class="section-number-5">9.7.1.18</span> BigDecimal vs float&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org5486e53" class="outline-5">
<h5 id="org5486e53"><span class="section-number-5">9.7.1.19</span> what is the difference betwen checked and unchecked exception?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-orgfb5e596" class="outline-5">
<h5 id="orgfb5e596"><span class="section-number-5">9.7.1.20</span> Co všechno je špatně na tomto kusu kódu&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-20">
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">try</span> {
  <span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">...</span>
} <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>) {
  log.error(<span style="color: #008000;">"Oh no!"</span>, e.getMessage());
}
</pre>
</div>
<ul class="org-ul">
<li>Zdaleka největší průšvih je, že jsme přišli o stack trace!
<ul class="org-ul">
<li>Musíme nechat zalogovat celý objekt "e" a nebo aspoň přímo jeho ST.</li>
</ul></li>
<li>Chytáme příliš obecný typ, takže nemůžeme nijak rozlišit mezi jednotlivými typy chyb.</li>
<li>Kombinace chytání příliš obecné chyby a neudělání re-throw, je velmi nebezpečná.
<ul class="org-ul">
<li>Pokud nechceme dělat re-throw, měli bychom chytat jen ten typ, kterého se to týká.</li>
</ul></li>
<li>A další věci, jako stupidní message "Oh no!", atd.</li>
</ul>
</div>
</div>
<div id="outline-container-org766eb86" class="outline-5">
<h5 id="org766eb86"><span class="section-number-5">9.7.1.21</span> Explain Java 7 ARM (Automatic Resource Managemet) Feature and multi-catch block?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-1-21">
<ul class="org-ul">
<li>If you are catching a lot of exceptions in a single try block, you will notice that catch block code looks very ugly and mostly consists of redundant code to log the error,</li>
<li>keeping this in mind Java 7 one of the feature was multi-catch block where we can catch multiple exceptions in a single catch block.</li>
<li>The catch block with this feature looks like below:</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">catch</span>(IOException | SQLException | Exception ex){
    logger.error(ex);
    <span style="color: #0000FF;">throw</span> <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">MyException</span>(ex.getMessage());
}
</pre>
</div>
<ul class="org-ul">
<li>Most of the time, we use finally block just to close the resources and sometimes we forget to close them and get runtime exceptions when the resources are exhausted.</li>
<li>These exceptions are hard to debug and we might need to look into each place where we are using that type of resource to make sure we are closing it.</li>
<li>So java 7 one of the improvement was try-with-resources where we can create a resource in the try statement itself and use it inside the try-catch block.</li>
<li>When the execution comes out of try-catch block, runtime environment automatically close these resources.</li>
<li>Sample of try-catch block with this improvement is:</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">try</span> (<span style="color: #6434A3;">MyResource</span> <span style="color: #BA36A5;">mr</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">MyResource</span>()) {
    System.out.println(<span style="color: #008000;">"MyResource created in try-with-resources"</span>);
} <span style="color: #0000FF;">catch</span> (<span style="color: #6434A3;">Exception</span> <span style="color: #BA36A5;">e</span>) {
    e.printStackTrace();
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org494b430" class="outline-5">
<h5 id="org494b430"><span class="section-number-5">9.7.1.22</span> <span class="todo TODO">TODO</span> JPA</h5>
</div>
<div id="outline-container-orgdad4875" class="outline-5">
<h5 id="orgdad4875"><span class="section-number-5">9.7.1.23</span> <span class="todo TODO">TODO</span> Generics</h5>
</div>
<div id="outline-container-org2e70128" class="outline-5">
<h5 id="org2e70128"><span class="section-number-5">9.7.1.24</span> <span class="todo TODO">TODO</span> Java 9 - project jigsaw</h5>
</div>
<div id="outline-container-org34394d2" class="outline-5">
<h5 id="org34394d2"><span class="section-number-5">9.7.1.25</span> <span class="todo TODO">TODO</span> QueryDSL</h5>
</div>
<div id="outline-container-orgb930b09" class="outline-5">
<h5 id="orgb930b09"><span class="section-number-5">9.7.1.26</span> <span class="todo WIP">WIP</span> Maven</h5>
<div class="outline-text-5" id="text-9-7-1-26">
</div>
<div id="outline-container-org2ace6d2" class="outline-6">
<h6 id="org2ace6d2">Jaký je rozdíl mezi &lt;dependencies&gt; a &lt;dependencyManagement&gt;?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h6>
<div class="outline-text-6" id="text-org2ace6d2">
<ul class="org-ul">
<li>dependencyManagement má smysl je v multi-module projektu, konkrétně v otcovském pomu.</li>
<li>Používá se pro deklarování dependencí a jejich scopů a verzí a každý sub-modul si pak jen řekne, které z nich chce používat (a už nemusí deklarovat scope a verzi).</li>
<li>dependencies v otcovském pomu znamenají, že každý sub-modul všechny takové dependence automaticky dostane.</li>
<li>Používá se to např. pro testovací balíky nebo nějaké velmi obecně použitelné commons balíky a jiné pomocné tooly jako Lombok.</li>
</ul>
</div>
</div>
