README.org
***** K čemu se používá scope provided?                        :QUESTION:
:ANSWER:
- Jde o dependence, které chceme při kompilaci, ale nechceme na runtimu
- Většinou jde o dependence, které nám v JavaEE poskytne aplikační server
- Nebo o tooly jako Lombok, které potřebujeme při kompilaci a nepotřebujeme na runtimu
:END:
**** TODO Gradle
*** Spring & Spring Boot
:PROPERTIES:
:lerning:  https://www.baeldung.com/spring-interview-questions
:END:
**** Jaký je rozdíl mezi JavaEE a Springem?                     :QUESTION:
- JavaEE je standard, který potřebuje aplikační server (JBoss, WebSphere, etc.) jakožto implementaci a runtime prostředí.
- Spring je framework, který roztáčí vlastní Spring Context, což je taková obdoba kontejneru v JavaEE a v něm všechno běží.
**** Difference between spring and spting boot                 :QUESTION:
**** Co přinesl Spring Boot do Spring ekosystému?               :QUESTION:
:ANSWER:
- Strašně zjednodušený start aplikace.
- Vše je velmi opinionated a není potřeba napsat ani jednu řádku konfigurace, protože všechno má nějaký "rozumný default".
- Aplikace může být standalone JAR proces, WAR nebo JAR s embedded Tomcatem.
- V každém případě je to one liner.
- Plus mnoho "starter" dependencí, kterými jde snadno přidat další moduly a tooly tímto opinionated stylem.
:END:
**** Jaký je hlavní rozdíl v transaction handlingu mezi JavaEE (od verze 3) a Springem? :QUESTION:
:ANSWER:
- JavaEE to má implicitní a Spring explicitní
- V JavaEE deklarujeme EJB a ta má všechny své public metody automaticky v transakci v nějakém defaultním módu
- Ve Springu deklarujeme beanu nějakého typu a automaticky nikdy žádné transakce nemá.
- Zapínáme si je explicitně pomocí anotace.
:END:
**** How Would You Enable Transactions in Spring and What Are Their Benefits? :QUESTION:
:ANSWER:
There are two distinct ways to configure Transactions:
- with *annotations* or
- by using *Aspect Oriented Programming* (AOP)  each with their advantages.

The benefits of using Spring Transactions, according to the official docs, are:

- Provide a consistent programming model across different transaction APIs such as JTA, JDBC, Hibernate, JPA, and JDO
- Support declarative transaction management
- Provide a simpler API for programmatic transaction management than some complex transaction APIs such as JTA
- Integrate very well with Spring's various data access abstractions
:END:
**** What is the difference betweek JPA and Hibernate?          :QUESTION:
:ANSWER:
- JPA is a Data Access Abstraction used to reduce the amount of boilerplate code
- Hibernate is an implementation of Java Persistence API and offers benefits of loose coupling
:END:
**** Can use jetty instead of tomcat in spring-boot-starter-web? :QUESTION:
:ANSWER:
- Yes, we can use jetty instead of tomcat in spring-boot-starter-web, by removing the existing dependency and including the following:
#+begin_src xml
<dependency>
    <groupId>org.springframework.boot</groupId>
    <artifactId>spring-boot-starter-web</artifactId>
    <exclusions>
        <exclusion>
            <groupId>org.springframework.boot</groupId>
            <artifactId>spring-boot-starter-tomcat</artifactId>
        </exclusion>
    </exclusions>
</dependency>
<dependency>
    <groupId>org.springframework.boot</groupId>
    <artifactId>spring-boot-starter-jetty</artifactId>
</dependency>
#+end_src
:END:
**** What Is Reactive Programming?                              :QUESTION:
:ANSWER:
- Reactive programming is about:
  - non-blocking,
  - event-driven applications that
  - scale with a small number of threads, with
  - back pressure being a key ingredient that aims to ensure producers don't overwhelm consumers.

- The primary benefits of reactive programming are:

- increased utilization of computing resources on multicore and multi-CPU hardware
- and increased performance by reducing serialization
- Reactive programming is generally event-driven, in contrast to reactive systems, which are message-driven.
- Thus, using reactive programming does not mean we're building a reactive system, which is an architectural style.

However, reactive programming may be used as a means to implement reactive systems if we follow the Reactive Manifesto, which is quite vital to understand.

- Based on this, reactive systems have four important characteristics:
  - Responsive: the system should respond in a timely manner
  - Resilient: in case the system faces any failure, it should stay responsive
  - Elastic: reactive systems can react to changes and stay responsive under varying workload
  - Message-driven: reactive systems need to establish a boundary between components by relying on asynchronous message passing
:END:
**** What Is Spring Webflux?                                    :QUESTION:
:ANSWER:
- Spring WebFlux is Spring's reactive-stack web framework, and it's an alternative to Spring MVC.

- In order to achieve this reactive model and be highly scalable, the entire stack is non-blocking. Check out our tutorial on Spring 5 WebFlux for additional details.
:END:
