public/fullstack.html
<div id="outline-container-org4937e20" class="outline-6">
<h6 id="org4937e20">K čemu se používá scope provided?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h6>
<div class="outline-text-6" id="text-org4937e20">
<ul class="org-ul">
<li>Jde o dependence, které chceme při kompilaci, ale nechceme na runtimu</li>
<li>Většinou jde o dependence, které nám v JavaEE poskytne aplikační server</li>
<li>Nebo o tooly jako Lombok, které potřebujeme při kompilaci a nepotřebujeme na runtimu</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgbfe51ed" class="outline-5">
<h5 id="orgbfe51ed"><span class="section-number-5">9.7.1.27</span> <span class="todo TODO">TODO</span> Gradle</h5>
</div>
</div>
<div id="outline-container-orgeb8dd86" class="outline-4">
<h4 id="orgeb8dd86"><span class="section-number-4">9.7.2</span> Spring &amp; Spring Boot</h4>
<div class="outline-text-4" id="text-9-7-2">
<pre class="example">
lerning: https://www.baeldung.com/spring-interview-questions
</pre>
</div>
<div id="outline-container-org5a8240f" class="outline-5">
<h5 id="org5a8240f"><span class="section-number-5">9.7.2.1</span> Jaký je rozdíl mezi JavaEE a Springem?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-1">
<ul class="org-ul">
<li>JavaEE je standard, který potřebuje aplikační server (JBoss, WebSphere, etc.) jakožto implementaci a runtime prostředí.</li>
<li>Spring je framework, který roztáčí vlastní Spring Context, což je taková obdoba kontejneru v JavaEE a v něm všechno běží.</li>
</ul>
</div>
</div>
<div id="outline-container-org5920cad" class="outline-5">
<h5 id="org5920cad"><span class="section-number-5">9.7.2.2</span> Difference between spring and spting boot&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
<div id="outline-container-org24adfd8" class="outline-5">
<h5 id="org24adfd8"><span class="section-number-5">9.7.2.3</span> Co přinesl Spring Boot do Spring ekosystému?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-3">
<ul class="org-ul">
<li>Strašně zjednodušený start aplikace.</li>
<li>Vše je velmi opinionated a není potřeba napsat ani jednu řádku konfigurace, protože všechno má nějaký "rozumný default".</li>
<li>Aplikace může být standalone JAR proces, WAR nebo JAR s embedded Tomcatem.</li>
<li>V každém případě je to one liner.</li>
<li>Plus mnoho "starter" dependencí, kterými jde snadno přidat další moduly a tooly tímto opinionated stylem.</li>
</ul>
</div>
</div>
<div id="outline-container-orgedc8130" class="outline-5">
<h5 id="orgedc8130"><span class="section-number-5">9.7.2.4</span> Jaký je hlavní rozdíl v transaction handlingu mezi JavaEE (od verze 3) a Springem?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-4">
<ul class="org-ul">
<li>JavaEE to má implicitní a Spring explicitní</li>
<li>V JavaEE deklarujeme EJB a ta má všechny své public metody automaticky v transakci v nějakém defaultním módu</li>
<li>Ve Springu deklarujeme beanu nějakého typu a automaticky nikdy žádné transakce nemá.</li>
<li>Zapínáme si je explicitně pomocí anotace.</li>
</ul>
</div>
</div>
<div id="outline-container-org07c7c37" class="outline-5">
<h5 id="org07c7c37"><span class="section-number-5">9.7.2.5</span> How Would You Enable Transactions in Spring and What Are Their Benefits?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-5">
<p>
There are two distinct ways to configure Transactions:
</p>
<ul class="org-ul">
<li>with <b>annotations</b> or</li>
<li>by using <b>Aspect Oriented Programming</b> (AOP)  each with their advantages.</li>
</ul>

<p>
The benefits of using Spring Transactions, according to the official docs, are:
</p>

<ul class="org-ul">
<li>Provide a consistent programming model across different transaction APIs such as JTA, JDBC, Hibernate, JPA, and JDO</li>
<li>Support declarative transaction management</li>
<li>Provide a simpler API for programmatic transaction management than some complex transaction APIs such as JTA</li>
<li>Integrate very well with Spring's various data access abstractions</li>
</ul>
</div>
</div>
<div id="outline-container-org0abb448" class="outline-5">
<h5 id="org0abb448"><span class="section-number-5">9.7.2.6</span> What is the difference betweek JPA and Hibernate?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-6">
<ul class="org-ul">
<li>JPA is a Data Access Abstraction used to reduce the amount of boilerplate code</li>
<li>Hibernate is an implementation of Java Persistence API and offers benefits of loose coupling</li>
</ul>
</div>
</div>
<div id="outline-container-org8e5752a" class="outline-5">
<h5 id="org8e5752a"><span class="section-number-5">9.7.2.7</span> Can use jetty instead of tomcat in spring-boot-starter-web?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-7">
<ul class="org-ul">
<li>Yes, we can use jetty instead of tomcat in spring-boot-starter-web, by removing the existing dependency and including the following:</li>
</ul>
<div class="org-src-container">
<pre class="src src-xml">&lt;<span style="color: #AE1B9A;">dependency</span>&gt;
    &lt;<span style="color: #AE1B9A;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #AE1B9A;">groupId</span>&gt;
    &lt;<span style="color: #AE1B9A;">artifactId</span>&gt;spring-boot-starter-web&lt;/<span style="color: #AE1B9A;">artifactId</span>&gt;
    &lt;<span style="color: #AE1B9A;">exclusions</span>&gt;
        &lt;<span style="color: #AE1B9A;">exclusion</span>&gt;
            &lt;<span style="color: #AE1B9A;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #AE1B9A;">groupId</span>&gt;
            &lt;<span style="color: #AE1B9A;">artifactId</span>&gt;spring-boot-starter-tomcat&lt;/<span style="color: #AE1B9A;">artifactId</span>&gt;
        &lt;/<span style="color: #AE1B9A;">exclusion</span>&gt;
    &lt;/<span style="color: #AE1B9A;">exclusions</span>&gt;
&lt;/<span style="color: #AE1B9A;">dependency</span>&gt;
&lt;<span style="color: #AE1B9A;">dependency</span>&gt;
    &lt;<span style="color: #AE1B9A;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #AE1B9A;">groupId</span>&gt;
    &lt;<span style="color: #AE1B9A;">artifactId</span>&gt;spring-boot-starter-jetty&lt;/<span style="color: #AE1B9A;">artifactId</span>&gt;
&lt;/<span style="color: #AE1B9A;">dependency</span>&gt;
</pre>
</div>
</div>
</div>
<div id="outline-container-org893a2d5" class="outline-5">
<h5 id="org893a2d5"><span class="section-number-5">9.7.2.8</span> What Is Reactive Programming?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-8">
<ul class="org-ul">
<li>Reactive programming is about:
<ul class="org-ul">
<li>non-blocking,</li>
<li>event-driven applications that</li>
<li>scale with a small number of threads, with</li>
<li>back pressure being a key ingredient that aims to ensure producers don't overwhelm consumers.</li>
</ul></li>

<li>The primary benefits of reactive programming are:</li>

<li>increased utilization of computing resources on multicore and multi-CPU hardware</li>
<li>and increased performance by reducing serialization</li>
<li>Reactive programming is generally event-driven, in contrast to reactive systems, which are message-driven.</li>
<li>Thus, using reactive programming does not mean we're building a reactive system, which is an architectural style.</li>
</ul>

<p>
However, reactive programming may be used as a means to implement reactive systems if we follow the Reactive Manifesto, which is quite vital to understand.
</p>

<ul class="org-ul">
<li>Based on this, reactive systems have four important characteristics:
<ul class="org-ul">
<li>Responsive: the system should respond in a timely manner</li>
<li>Resilient: in case the system faces any failure, it should stay responsive</li>
<li>Elastic: reactive systems can react to changes and stay responsive under varying workload</li>
<li>Message-driven: reactive systems need to establish a boundary between components by relying on asynchronous message passing</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org80a392d" class="outline-5">
<h5 id="org80a392d"><span class="section-number-5">9.7.2.9</span> What Is Spring Webflux?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-9">
<ul class="org-ul">
<li>Spring WebFlux is Spring's reactive-stack web framework, and it's an alternative to Spring MVC.</li>

<li>In order to achieve this reactive model and be highly scalable, the entire stack is non-blocking. Check out our tutorial on Spring 5 WebFlux for additional details.</li>
</ul>
</div>
</div>
