README.org
**** What Are the Mono and Flux Types?                          :QUESTION:
:ANSWER:
- The WebFlux framework in Spring Framework 5 uses Reactor as its async foundation.

- This project provides two core types: Mono to represent a single async value, and Flux to represent a stream of async values.

- They both implement the ~Publisher~ interface defined in the Reactive Streams specification.

Mono implements ~Publisher~ and returns 0 or 1 elements:
#+begin_src java
public abstract class Mono<T> implements Publisher<T> {...}
#+end_src
Also, Flux implements ~Publisher~ and returns N elements:

#+begin_src java
public abstract class Flux<T> implements Publisher<T> {...}
#+end_src
By definition, the two types represent streams, hence they're both lazy, which means nothing is executed until we consume the stream using the subscribe() method. Both types are immutable, therefore calling any method will return a new instance of Flux or Mono.
:END:
**** What Is the Use of Webclient and Webtestclient?            :QUESTION:
:ANSWER:
- *WebClient* is a component in the new Web Reactive framework that can act as a reactive client for performing non-blocking HTTP requests.
  - Being a reactive client, it can handle reactive streams with back pressure, and it can take full advantage of Java 8 lambdas.
  - It can also handle both sync and async scenarios.

- On the other hand, the *WebTestClient* is a similar class that we can use in tests.
  - Basically, it's a thin shell around the WebClient. It can connect to any server over an HTTP connection. It can also bind directly to WebFlux applications using mock request and response objects, without the need for an HTTP server.
:END:
**** What Are the Disadvantages of Using Reactive Streams?      :QUESTION:
:ANSWER:
The major disadvantages of using reactive streams are:

- Troubleshooting a Reactive application is a bit difficult; be sure to check out our tutorial on debugging reactive streams for some handy debugging tips
- There is limited support for reactive data stores, as traditional relational data stores have yet to embrace the reactive paradigm
- There's an extra learning curve when implementing
:END:
**** Is Spring 5 Compatible With Older Versions of Java?        :QUESTION:
:ANSWER:
In order to take advantage of Java 8 features, the Spring codebase has been revamped. This means older versions of Java cannot be used. Hence, the framework requires a minimum of Java 8.
:END:
**** Can We Use Both Web Mvc and Webflux in the Same Application? :QUESTION:
:ANSWER:
- As of now, Spring Boot will only allow either Spring MVC or Spring WebFlux, as Spring Boot tries to auto-configure the context depending on the dependencies that exist in its classpath.
- Also, Spring MVC cannot run on Netty. 
-  Moreover, MVC is a blocking paradigm and WebFlux is a non-blocking style, therefore we shouldn't be mixing both together, as they serve different purposes.
:END:
**** What Is the Role of the @Autowired Annotation?             :QUESTION:
- The @Autowired annotation can be used with fields or methods for injecting a bean by type.
- This annotation allows Spring to resolve and inject collaborating beans into your bean.
**** "Spring 4.3 přinesl constructor-based dependency injection i bez nutnosti anotace Autowired. Jaké jsou výhody a nevýhody takového DI?" :QUESTION:
:ANSWER:
- "Lépe se to testuje - máme větší kontrolu nad dependencemi a můžeme je mockovat dle libosti a velmi snadno.
- Současně tím v testech vynucujeme nějakou inicializaci těchto dependencí. Jinak by klidně mohly být null.
- Je to takový mnohem přirozenější a intuitivnější způsob inicializace v OOP světě.
- Asi jediná nevýhoda: pokud bude dependencí hodně, začne to být trochu nepřehledné."
:END:
*** JavaEE / JakartaEE
**** access intent
***** optimistic vs pessimistic
**** Jaký je rozdíl mezi Java SE a JavaEE                       :QUESTION:
- Java SE se používá hlavně pro nějaké procesy, které se nastartují, provedou nějakou činost a skončí
- JavaEE se používá hlavně pro aplikace, které jsou nasazené na nějakém trvale běžícím serveru a vystavují buď nějaké služby nebo přímo front end.
**** Co je to aplikační server a nějaký příklad                 :QUESTION:
*** Implemetations
**** GraalVM
**** Quarcus
**** AdoptOpenJDK
*** JDBC
*** JMS
 
** TODO Python
** TODO JS on a backend
*** TODO NodeJS                                                     :TOPIC:
** TODO JS environment
*** npm
*** yarn
*** nvm
*** Name soem popular libraries?

** Language theory                                                   :TOPIC:
*** Garbage Collector
*** Type systems
**** strongly typed
**** weakly typed

