public/fullstack.html
<div id="outline-container-org04f1e0c" class="outline-5">
<h5 id="org04f1e0c"><span class="section-number-5">9.7.2.10</span> What Are the Mono and Flux Types?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-10">
<ul class="org-ul">
<li>The WebFlux framework in Spring Framework 5 uses Reactor as its async foundation.</li>

<li>This project provides two core types: Mono to represent a single async value, and Flux to represent a stream of async values.</li>

<li>They both implement the <code>Publisher</code> interface defined in the Reactive Streams specification.</li>
</ul>

<p>
Mono implements <code>Publisher</code> and returns 0 or 1 elements:
</p>
<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">abstract</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Mono</span>&lt;<span style="color: #6434A3;">T</span>&gt; <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">Publisher</span>&lt;<span style="color: #6434A3;">T</span>&gt; {...}
</pre>
</div>
<p>
Also, Flux implements <code>Publisher</code> and returns N elements:
</p>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #0000FF;">public</span> <span style="color: #0000FF;">abstract</span> <span style="color: #0000FF;">class</span> <span style="color: #6434A3;">Flux</span>&lt;<span style="color: #6434A3;">T</span>&gt; <span style="color: #0000FF;">implements</span> <span style="color: #6434A3;">Publisher</span>&lt;<span style="color: #6434A3;">T</span>&gt; {...}
</pre>
</div>
<p>
By definition, the two types represent streams, hence they're both lazy, which means nothing is executed until we consume the stream using the subscribe() method. Both types are immutable, therefore calling any method will return a new instance of Flux or Mono.
</p>
</div>
</div>
<div id="outline-container-orgb718f58" class="outline-5">
<h5 id="orgb718f58"><span class="section-number-5">9.7.2.11</span> What Is the Use of Webclient and Webtestclient?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-11">
<ul class="org-ul">
<li><b>WebClient</b> is a component in the new Web Reactive framework that can act as a reactive client for performing non-blocking HTTP requests.
<ul class="org-ul">
<li>Being a reactive client, it can handle reactive streams with back pressure, and it can take full advantage of Java 8 lambdas.</li>
<li>It can also handle both sync and async scenarios.</li>
</ul></li>

<li>On the other hand, the <b>WebTestClient</b> is a similar class that we can use in tests.
<ul class="org-ul">
<li>Basically, it's a thin shell around the WebClient. It can connect to any server over an HTTP connection. It can also bind directly to WebFlux applications using mock request and response objects, without the need for an HTTP server.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgded9704" class="outline-5">
<h5 id="orgded9704"><span class="section-number-5">9.7.2.12</span> What Are the Disadvantages of Using Reactive Streams?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-12">
<p>
The major disadvantages of using reactive streams are:
</p>

<ul class="org-ul">
<li>Troubleshooting a Reactive application is a bit difficult; be sure to check out our tutorial on debugging reactive streams for some handy debugging tips</li>
<li>There is limited support for reactive data stores, as traditional relational data stores have yet to embrace the reactive paradigm</li>
<li>There's an extra learning curve when implementing</li>
</ul>
</div>
</div>
<div id="outline-container-org65daf5b" class="outline-5">
<h5 id="org65daf5b"><span class="section-number-5">9.7.2.13</span> Is Spring 5 Compatible With Older Versions of Java?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-13">
<p>
In order to take advantage of Java 8 features, the Spring codebase has been revamped. This means older versions of Java cannot be used. Hence, the framework requires a minimum of Java 8.
</p>
</div>
</div>
<div id="outline-container-orgb81aa02" class="outline-5">
<h5 id="orgb81aa02"><span class="section-number-5">9.7.2.14</span> Can We Use Both Web Mvc and Webflux in the Same Application?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-14">
<ul class="org-ul">
<li>As of now, Spring Boot will only allow either Spring MVC or Spring WebFlux, as Spring Boot tries to auto-configure the context depending on the dependencies that exist in its classpath.</li>
<li>Also, Spring MVC cannot run on Netty.</li>
<li>Moreover, MVC is a blocking paradigm and WebFlux is a non-blocking style, therefore we shouldn't be mixing both together, as they serve different purposes.</li>
</ul>
</div>
</div>
<div id="outline-container-org19d0248" class="outline-5">
<h5 id="org19d0248"><span class="section-number-5">9.7.2.15</span> What Is the Role of the @Autowired Annotation?&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-15">
<ul class="org-ul">
<li>The @Autowired annotation can be used with fields or methods for injecting a bean by type.</li>
<li>This annotation allows Spring to resolve and inject collaborating beans into your bean.</li>
</ul>
</div>
</div>
<div id="outline-container-org0ed8045" class="outline-5">
<h5 id="org0ed8045"><span class="section-number-5">9.7.2.16</span> "Spring 4.3 přinesl constructor-based dependency injection i bez nutnosti anotace Autowired. Jaké jsou výhody a nevýhody takového DI?"&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-2-16">
<ul class="org-ul">
<li>"Lépe se to testuje - máme větší kontrolu nad dependencemi a můžeme je mockovat dle libosti a velmi snadno.</li>
<li>Současně tím v testech vynucujeme nějakou inicializaci těchto dependencí. Jinak by klidně mohly být null.</li>
<li>Je to takový mnohem přirozenější a intuitivnější způsob inicializace v OOP světě.</li>
<li>Asi jediná nevýhoda: pokud bude dependencí hodně, začne to být trochu nepřehledné."</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0ce9a19" class="outline-4">
<h4 id="org0ce9a19"><span class="section-number-4">9.7.3</span> JavaEE / JakartaEE</h4>
<div class="outline-text-4" id="text-9-7-3">
</div>
<div id="outline-container-org386f91a" class="outline-5">
<h5 id="org386f91a"><span class="section-number-5">9.7.3.1</span> access intent</h5>
<div class="outline-text-5" id="text-9-7-3-1">
</div>
<div id="outline-container-org0c261d0" class="outline-6">
<h6 id="org0c261d0">optimistic vs pessimistic</h6>
</div>
</div>
<div id="outline-container-orgc8ec94d" class="outline-5">
<h5 id="orgc8ec94d"><span class="section-number-5">9.7.3.2</span> Jaký je rozdíl mezi Java SE a JavaEE&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
<div class="outline-text-5" id="text-9-7-3-2">
<ul class="org-ul">
<li>Java SE se používá hlavně pro nějaké procesy, které se nastartují, provedou nějakou činost a skončí</li>
<li>JavaEE se používá hlavně pro aplikace, které jsou nasazené na nějakém trvale běžícím serveru a vystavují buď nějaké služby nebo přímo front end.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4543c7" class="outline-5">
<h5 id="orgf4543c7"><span class="section-number-5">9.7.3.3</span> Co je to aplikační server a nějaký příklad&#xa0;&#xa0;&#xa0;<span class="tag"><span class="QUESTION">QUESTION</span></span></h5>
</div>
</div>
<div id="outline-container-org5936f5a" class="outline-4">
<h4 id="org5936f5a"><span class="section-number-4">9.7.4</span> Implemetations</h4>
<div class="outline-text-4" id="text-9-7-4">
</div>
<div id="outline-container-orga408427" class="outline-5">
<h5 id="orga408427"><span class="section-number-5">9.7.4.1</span> GraalVM</h5>
</div>
<div id="outline-container-org3182ee0" class="outline-5">
<h5 id="org3182ee0"><span class="section-number-5">9.7.4.2</span> Quarcus</h5>
</div>
<div id="outline-container-orgfffc8fa" class="outline-5">
<h5 id="orgfffc8fa"><span class="section-number-5">9.7.4.3</span> AdoptOpenJDK</h5>
</div>
</div>
<div id="outline-container-org43363e9" class="outline-4">
<h4 id="org43363e9"><span class="section-number-4">9.7.5</span> JDBC</h4>
</div>
<div id="outline-container-orgbe7946a" class="outline-4">
<h4 id="orgbe7946a"><span class="section-number-4">9.7.6</span> JMS</h4>
</div>
</div>

<div id="outline-container-org6662f26" class="outline-3">
<h3 id="org6662f26"><span class="section-number-3">9.8</span> <span class="todo TODO">TODO</span> Python</h3>
</div>
<div id="outline-container-org0f4e2a5" class="outline-3">
<h3 id="org0f4e2a5"><span class="section-number-3">9.9</span> <span class="todo TODO">TODO</span> JS on a backend</h3>
<div class="outline-text-3" id="text-9-9">
</div>
<div id="outline-container-orgf6fd3f9" class="outline-4">
<h4 id="orgf6fd3f9"><span class="section-number-4">9.9.1</span> <span class="todo TODO">TODO</span> NodeJS&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h4>
</div>
</div>
<div id="outline-container-orgb6f5425" class="outline-3">
<h3 id="orgb6f5425"><span class="section-number-3">9.10</span> <span class="todo TODO">TODO</span> JS environment</h3>
<div class="outline-text-3" id="text-9-10">
</div>
<div id="outline-container-orgf492a00" class="outline-4">
<h4 id="orgf492a00"><span class="section-number-4">9.10.1</span> npm</h4>
</div>
<div id="outline-container-org0417f2c" class="outline-4">
<h4 id="org0417f2c"><span class="section-number-4">9.10.2</span> yarn</h4>
</div>
<div id="outline-container-orgc6d6735" class="outline-4">
<h4 id="orgc6d6735"><span class="section-number-4">9.10.3</span> nvm</h4>
</div>
<div id="outline-container-org6e6a86f" class="outline-4">
<h4 id="org6e6a86f"><span class="section-number-4">9.10.4</span> Name soem popular libraries?</h4>
</div>
</div>

<div id="outline-container-orga626ff0" class="outline-3">
<h3 id="orga626ff0"><span class="section-number-3">9.11</span> Language theory&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-9-11">
</div>
