README.org
* WIP Quality and Testing                                            :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: QUALITY
:END:
** TODO Blue green deployment
** TODO AB testing
** TODO Code coverage
** TODO Cyclomatic complexity                                        :TOPIC:
** TODO Code quality                                                 :TOPIC:
** TODO Unit testing
* WIP Core Values                                                    :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: CORE_VALUES
:END:
The moral aspect
** TODO Code of Conduct                                                :TOPIC:
** WIP SW developer responsibility                                   :TOPIC:
- finally the code that was driving the engine in diesel gat was written by someone -> this developer(s) knew what are they doing
  - 
* WIP Information Sources                                            :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: INFORMATION_SOURCES
:END:
- where to learn, what to read and follow
** InfoQ
** Coding Blocks
** SE-Radio
* WIP Big Names                                                      :DOMAIN:
:PROPERTIES:
:CUSTOM_ID: BIG_NAMES
:END:
- whom to follow
** TODO Bartosz Milewski
** TODO Venkat Subramaniam
** TODO Trisha Gee
** TODO Kevlin Henney
** TODO Brian Goetz
** TODO Troy HUNT
** TODO Scott Meyers
** TODO Erik Meijer
** TODO Edward Kmett
** TODO Chris Allen
** TODO Martin Fowller
** TODO Martin Kleppmann 
:PROPERTIES:
:book:     https://dataintensive.net/
:END:
- Book: Designing data intensive applications
