public/fullstack.html
<div id="outline-container-org7c830cc" class="outline-4">
<h4 id="org7c830cc"><span class="section-number-4">9.11.1</span> Garbage Collector</h4>
</div>
<div id="outline-container-org423430b" class="outline-4">
<h4 id="org423430b"><span class="section-number-4">9.11.2</span> Type systems</h4>
<div class="outline-text-4" id="text-9-11-2">
</div>
<div id="outline-container-org7f6ce8d" class="outline-5">
<h5 id="org7f6ce8d"><span class="section-number-5">9.11.2.1</span> strongly typed</h5>
</div>
<div id="outline-container-org7addf42" class="outline-5">
<h5 id="org7addf42"><span class="section-number-5">9.11.2.2</span> weakly typed</h5>
</div>
</div>
</div>
</div>

<div id="outline-container-org724222a" class="outline-2">
<h2 id="QUALITY"><span class="section-number-2">10</span> <span class="todo WIP">WIP</span> Quality and Testing&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-QUALITY">
<pre class="example">
CUSTOM_ID: QUALITY
</pre>
</div>
<div id="outline-container-orge4aab85" class="outline-3">
<h3 id="orge4aab85"><span class="section-number-3">10.1</span> <span class="todo TODO">TODO</span> Blue green deployment</h3>
</div>
<div id="outline-container-orgfa4e8e0" class="outline-3">
<h3 id="orgfa4e8e0"><span class="section-number-3">10.2</span> <span class="todo TODO">TODO</span> AB testing</h3>
</div>
<div id="outline-container-org53b03b0" class="outline-3">
<h3 id="org53b03b0"><span class="section-number-3">10.3</span> <span class="todo TODO">TODO</span> Code coverage</h3>
</div>
<div id="outline-container-org231770c" class="outline-3">
<h3 id="org231770c"><span class="section-number-3">10.4</span> <span class="todo TODO">TODO</span> Cyclomatic complexity&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orgca04c58" class="outline-3">
<h3 id="orgca04c58"><span class="section-number-3">10.5</span> <span class="todo TODO">TODO</span> Code quality&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-orge123c5f" class="outline-3">
<h3 id="orge123c5f"><span class="section-number-3">10.6</span> <span class="todo TODO">TODO</span> Unit testing</h3>
</div>
</div>
<div id="outline-container-orga22ebb0" class="outline-2">
<h2 id="CORE_VALUES"><span class="section-number-2">11</span> <span class="todo WIP">WIP</span> Core Values&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-CORE_VALUES">
<pre class="example">
CUSTOM_ID: CORE_VALUES
</pre>
<p>
The moral aspect
</p>
</div>
<div id="outline-container-org06123cc" class="outline-3">
<h3 id="org06123cc"><span class="section-number-3">11.1</span> <span class="todo TODO">TODO</span> Code of Conduct&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
</div>
<div id="outline-container-org9bd68d2" class="outline-3">
<h3 id="org9bd68d2"><span class="section-number-3">11.2</span> <span class="todo WIP">WIP</span> SW developer responsibility&#xa0;&#xa0;&#xa0;<span class="tag"><span class="TOPIC">TOPIC</span></span></h3>
<div class="outline-text-3" id="text-11-2">
<ul class="org-ul">
<li>finally the code that was driving the engine in diesel gat was written by someone -&gt; this developer(s) knew what are they doing
<ul class="org-ul">
<li></li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org63203e1" class="outline-2">
<h2 id="INFORMATION_SOURCES"><span class="section-number-2">12</span> <span class="todo WIP">WIP</span> Information Sources&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-INFORMATION_SOURCES">
<pre class="example">
CUSTOM_ID: INFORMATION_SOURCES
</pre>
<ul class="org-ul">
<li>where to learn, what to read and follow</li>
</ul>
</div>
<div id="outline-container-orgcac02df" class="outline-3">
<h3 id="orgcac02df"><span class="section-number-3">12.1</span> InfoQ</h3>
</div>
<div id="outline-container-orga2fef8b" class="outline-3">
<h3 id="orga2fef8b"><span class="section-number-3">12.2</span> Coding Blocks</h3>
</div>
<div id="outline-container-orgaeb4d0e" class="outline-3">
<h3 id="orgaeb4d0e"><span class="section-number-3">12.3</span> SE-Radio</h3>
</div>
</div>
<div id="outline-container-org1a1d9f6" class="outline-2">
<h2 id="BIG_NAMES"><span class="section-number-2">13</span> <span class="todo WIP">WIP</span> Big Names&#xa0;&#xa0;&#xa0;<span class="tag"><span class="DOMAIN">DOMAIN</span></span></h2>
<div class="outline-text-2" id="text-BIG_NAMES">
<pre class="example">
CUSTOM_ID: BIG_NAMES
</pre>
<ul class="org-ul">
<li>whom to follow</li>
</ul>
</div>
<div id="outline-container-org672f1c5" class="outline-3">
<h3 id="org672f1c5"><span class="section-number-3">13.1</span> <span class="todo TODO">TODO</span> Bartosz MILEWSKI</h3>
</div>
<div id="outline-container-org7fddbc7" class="outline-3">
<h3 id="org7fddbc7"><span class="section-number-3">13.2</span> <span class="todo TODO">TODO</span> Venkat Subramaniam</h3>
</div>
<div id="outline-container-org5865238" class="outline-3">
<h3 id="org5865238"><span class="section-number-3">13.3</span> <span class="todo TODO">TODO</span> Trisha GEE</h3>
</div>
<div id="outline-container-orgc80ce7c" class="outline-3">
<h3 id="orgc80ce7c"><span class="section-number-3">13.4</span> <span class="todo TODO">TODO</span> Kevlin HENNEY</h3>
</div>
<div id="outline-container-org643d9cd" class="outline-3">
<h3 id="org643d9cd"><span class="section-number-3">13.5</span> <span class="todo TODO">TODO</span> Brian GOETZ</h3>
</div>
<div id="outline-container-org5a4bd37" class="outline-3">
<h3 id="org5a4bd37"><span class="section-number-3">13.6</span> <span class="todo TODO">TODO</span> Troy HUNT</h3>
</div>
<div id="outline-container-org998061c" class="outline-3">
<h3 id="org998061c"><span class="section-number-3">13.7</span> <span class="todo TODO">TODO</span> Scott MEYERS</h3>
</div>
<div id="outline-container-orgf4239d0" class="outline-3">
<h3 id="orgf4239d0"><span class="section-number-3">13.8</span> <span class="todo TODO">TODO</span> Erik Meijer</h3>
</div>
<div id="outline-container-org696a2bd" class="outline-3">
<h3 id="org696a2bd"><span class="section-number-3">13.9</span> <span class="todo TODO">TODO</span> Edward Kmett</h3>
</div>
<div id="outline-container-orge526b96" class="outline-3">
<h3 id="orge526b96"><span class="section-number-3">13.10</span> <span class="todo TODO">TODO</span> Chris Allen</h3>
</div>
</div>
