public/fullstack.html
<div id="outline-container-org20c056f" class="outline-2">
<h2 id="org20c056f"><span class="section-number-2">14</span> <span class="todo TODO">TODO</span> To integrate&#xa0;&#xa0;&#xa0;<span class="tag"><span class="NO_EXPORT">NO_EXPORT</span></span></h2>
<div class="outline-text-2" id="text-14">
<ul class="org-ul">
<li>gcloud</li>
<li>tiller</li>
<li>psql</li>

<li><a href="https://haydenjames.io/linux-commands-frequently-used-by-linux-sysadmins-part-1">https://haydenjames.io/linux-commands-frequently-used-by-linux-sysadmins-part-1</a></li>
<li><a href="https://jeremiahflaga.github.io/2017/06/03/most-important-design-guideline-of-scott-myers/">https://jeremiahflaga.github.io/2017/06/03/most-important-design-guideline-of-scott-myers/</a></li>
<li><a href="http://site.icu-project.org/">http://site.icu-project.org/</a></li>
<li><a href="https://kubernetes.io/docs/concepts/extend-kubernetes/compute-storage-net/network-plugins/">https://kubernetes.io/docs/concepts/extend-kubernetes/compute-storage-net/network-plugins/</a></li>
<li><a href="https://www.softwaretestinghelp.com/git-interview-questions/">https://www.softwaretestinghelp.com/git-interview-questions/</a></li>
<li><a href="https://iqsanswers.com/postgresql-interview-questions-answers/">https://iqsanswers.com/postgresql-interview-questions-answers/</a></li>
<li><a href="https://enterprisecraftsmanship.com/posts/entity-vs-value-object-the-ultimate-list-of-differences/">https://enterprisecraftsmanship.com/posts/entity-vs-value-object-the-ultimate-list-of-differences/</a></li>
<li><a href="https://ahmet.im/blog/knative-better-kubernetes-networking/">https://ahmet.im/blog/knative-better-kubernetes-networking/</a></li>
<li><a href="https://github.com/ahmetb/kubernetes-network-policy-recipes">https://github.com/ahmetb/kubernetes-network-policy-recipes</a></li>
<li><a href="https://ahmet.im/blog/kubecon-2017/">https://ahmet.im/blog/kubecon-2017/</a></li>
<li><a href="https://www.illumio.com/">https://www.illumio.com/</a></li>
<li><a href="https://micronaut.io/">https://micronaut.io/</a></li>
<li><a href="https://docs.solace.com/SDKPerf/SDKPerf.htm">https://docs.solace.com/SDKPerf/SDKPerf.htm</a></li>
<li><a href="https://github.com/mjoellnier/micronaut-vs-quarkus">https://github.com/mjoellnier/micronaut-vs-quarkus</a></li>
<li><a href="https://github.com/quarkusio/quarkus">https://github.com/quarkusio/quarkus</a></li>
<li><a href="https://java.libhunt.com/">https://java.libhunt.com/</a></li>
<li><a href="https://architectelevator.com/book/">https://architectelevator.com/book/</a></li>
<li><a href="https://www.enterpriseintegrationpatterns.com/ramblings.html">https://www.enterpriseintegrationpatterns.com/ramblings.html</a></li>
<li><a href="https://www.simultrans.com/blog/what-are-.po-files">https://www.simultrans.com/blog/what-are-.po-files</a></li>
<li><a href="https://www.gnu.org/software/gettext/manual/html_node/PO-Files.html">https://www.gnu.org/software/gettext/manual/html_node/PO-Files.html</a></li>
<li><a href="https://docs.weblate.org/en/latest/admin/addons.html?highlight=.po#update-po-files-to-match-pot-msgmerge">https://docs.weblate.org/en/latest/admin/addons.html?highlight=.po#update-po-files-to-match-pot-msgmerge</a></li>
<li><a href="http://www.chschneider.org/linux/server/openldap.shtml">http://www.chschneider.org/linux/server/openldap.shtml</a></li>
<li><a href="https://medium.com/@raghu.icecraft/simple-working-with-ldapsearch-cf6a5986977">https://medium.com/@raghu.icecraft/simple-working-with-ldapsearch-cf6a5986977</a></li>
<li><a href="https://linoxide.com/mail/ldapsearch-command-test-ldap-connection/">https://linoxide.com/mail/ldapsearch-command-test-ldap-connection/</a></li>
<li><a href="https://adoptopenjdk.net/">https://adoptopenjdk.net/</a></li>
<li><a href="https://quarkus.io/">https://quarkus.io/</a></li>
<li><a href="https://github.com/vaquarkhan/vaquarkhan">https://github.com/vaquarkhan/vaquarkhan</a></li>
<li><a href="https://java.libhunt.com/">https://java.libhunt.com/</a></li>
<li><a href="https://hub.docker.com/r/jboss/keycloak/">https://hub.docker.com/r/jboss/keycloak/</a></li>
<li><a href="https://docs.nats.io/">https://docs.nats.io/</a></li>
<li><a href="https://github.com/nkatre/Free-DevOps-Books-1">https://github.com/nkatre/Free-DevOps-Books-1</a></li>
<li><a href="https://openid.net/2015/05/26/enhancing-oauth-security-for-mobile-applications-with-pkse/">https://openid.net/2015/05/26/enhancing-oauth-security-for-mobile-applications-with-pkse/</a></li>
<li><a href="https://en.wikipedia.org/wiki/Apache_Drill">https://en.wikipedia.org/wiki/Apache_Drill</a></li>
<li><a href="https://cloud.google.com/files/BigQueryTechnicalWP.pdf">https://cloud.google.com/files/BigQueryTechnicalWP.pdf</a></li>
<li><a href="https://cloud.google.com/bigquery/streaming-data-into-bigquery">https://cloud.google.com/bigquery/streaming-data-into-bigquery</a></li>
<li><a href="https://cilium.io/">https://cilium.io/</a></li>
<li><a href="https://medium.com/@ruxijitianu/database-version-control-liquibase-versus-flyway-9872d43ee5a4">https://medium.com/@ruxijitianu/database-version-control-liquibase-versus-flyway-9872d43ee5a4</a></li>
<li><a href="https://insights.stackoverflow.com/survey/2020#developer-profile">https://insights.stackoverflow.com/survey/2020#developer-profile</a></li>
<li><a href="https://ldapwiki.com/wiki/Acr_values">https://ldapwiki.com/wiki/Acr_values</a></li>
<li><a href="https://www.udemy.com/course/spring-interview-questions-and-answers/">https://www.udemy.com/course/spring-interview-questions-and-answers/</a></li>
<li><a href="https://www.edureka.co/blog/interview-questions/spring-boot-interview-questions/">https://www.edureka.co/blog/interview-questions/spring-boot-interview-questions/</a></li>
<li><a href="https://en.wikipedia.org/wiki/Comparison_of_Java_virtual_machines">https://en.wikipedia.org/wiki/Comparison_of_Java_virtual_machines</a></li>
<li><a href="https://en.wikipedia.org/wiki/OpenJ9#Garbage_Collector">https://en.wikipedia.org/wiki/OpenJ9#Garbage_Collector</a></li>
<li><a href="https://en.wikipedia.org/wiki/Azul_Systems">https://en.wikipedia.org/wiki/Azul_Systems</a></li>
<li><a href="https://en.wikipedia.org/wiki/GraalVM">https://en.wikipedia.org/wiki/GraalVM</a></li>
<li><a href="https://en.wikipedia.org/wiki/List_of_Java_virtual_machines">https://en.wikipedia.org/wiki/List_of_Java_virtual_machines</a></li>
<li><a href="https://dzone.com/articles/choosing-the-right-gc">https://dzone.com/articles/choosing-the-right-gc</a></li>
<li><a href="https://medium.com/@gacheruevans0/2-tier-vs-3-tier-architecture-26db56fe7e9c">https://medium.com/@gacheruevans0/2-tier-vs-3-tier-architecture-26db56fe7e9c</a></li>
<li><a href="https://en.wikipedia.org/wiki/IETF_language_tag#cite_note-8">https://en.wikipedia.org/wiki/IETF_language_tag#cite_note-8</a></li>
<li><a href="https://stackoverflow.com/questions/43535693/private-ios-app">https://stackoverflow.com/questions/43535693/private-ios-app</a></li>
<li><a href="https://emacs.christianbaeuerlein.com/my-org-config.html">https://emacs.christianbaeuerlein.com/my-org-config.html</a></li>
<li><a href="https://www.typescriptlang.org/docs/handbook/advanced-types.html">https://www.typescriptlang.org/docs/handbook/advanced-types.html</a></li>
<li><a href="https://cloud.google.com/logging">https://cloud.google.com/logging</a></li>
<li><a href="https://kubernetes.io/docs/tutorials/#services">https://kubernetes.io/docs/tutorials/#services</a></li>
<li><a href="https://kubernetes.io/docs/concepts/services-networking/service/">https://kubernetes.io/docs/concepts/services-networking/service/</a></li>
<li><a href="https://examples.yourdictionary.com/examples-of-hindsight-bias.html">https://examples.yourdictionary.com/examples-of-hindsight-bias.html</a></li>
<li><a href="https://guides.sonatype.com/foundations/devops/principle-based-devops-frameworks/">https://guides.sonatype.com/foundations/devops/principle-based-devops-frameworks/</a></li>
<li><a href="https://aws.amazon.com/getting-started/learning-path-hobbyist-developer/">https://aws.amazon.com/getting-started/learning-path-hobbyist-developer/</a></li>
<li><a href="https://blog.sonatype.com/2010/04/why-nexus-for-the-non-programmer/">https://blog.sonatype.com/2010/04/why-nexus-for-the-non-programmer/</a></li>
<li><a href="https://en.wikipedia.org/wiki/Pomodoro_Technique">https://en.wikipedia.org/wiki/Pomodoro_Technique</a></li>
<li><a href="https://en.wikipedia.org/wiki/X.509">https://en.wikipedia.org/wiki/X.509</a></li>
<li><a href="https://www.dmarcanalyzer.com/dkim/">https://www.dmarcanalyzer.com/dkim/</a></li>
<li><a href="https://www.dmarcanalyzer.com/dmarc/">https://www.dmarcanalyzer.com/dmarc/</a></li>
<li><a href="https://www.dmarcanalyzer.com/spf/">https://www.dmarcanalyzer.com/spf/</a></li>
<li><a href="https://www.npmjs.com/package/@dynatrace/react-native-plugin">https://www.npmjs.com/package/@dynatrace/react-native-plugin</a></li>
<li><a href="https://astrobiomike.github.io/unix/six-glorious-commands">https://astrobiomike.github.io/unix/six-glorious-commands</a></li>
<li><a href="https://docs.ksqldb.io/en/latest/developer-guide/syntax-reference/">https://docs.ksqldb.io/en/latest/developer-guide/syntax-reference/</a></li>
<li><a href="https://tapoueh.org/blog/2018/07/postgresql-listen-notify/">https://tapoueh.org/blog/2018/07/postgresql-listen-notify/</a></li>
<li><a href="https://editor.swagger.io/">https://editor.swagger.io/</a></li>
<li><a href="https://www.nbs-system.com/">https://www.nbs-system.com/</a></li>
<li><a href="https://crowdsec.net/">https://crowdsec.net/</a></li>
<li><a href="https://www.datawarehouse4u.info/SCD-Slowly-Changing-Dimensions.html">https://www.datawarehouse4u.info/SCD-Slowly-Changing-Dimensions.html</a></li>
<li><a href="https://www.baeldung.com/spring-mvc-interview-questions">https://www.baeldung.com/spring-mvc-interview-questions</a></li>
<li><a href="https://www.baeldung.com/spring-mvc-interview-questions">https://www.baeldung.com/spring-mvc-interview-questions</a></li>
<li><a href="https://archive.fosdem.org/2018/schedule/event/closing_keynote/attachments/slides/2597/export/events/attachments/closing_keynote/slides/2597/FOSDEM_2018_Closing_Keynote.pdf">https://archive.fosdem.org/2018/schedule/event/closing_keynote/attachments/slides/2597/export/events/attachments/closing_keynote/slides/2597/FOSDEM_2018_Closing_Keynote.pdf</a></li>
<li><a href="https://en.wikipedia.org/wiki/Cache_placement_policies">https://en.wikipedia.org/wiki/Cache_placement_policies</a></li>
<li><a href="https://en.wikipedia.org/wiki/Cache_replacement_policies">https://en.wikipedia.org/wiki/Cache_replacement_policies</a></li>
<li><a href="https://docs.oracle.com/javaee/6/tutorial/doc/giwhl.html">https://docs.oracle.com/javaee/6/tutorial/doc/giwhl.html</a></li>
<li><a href="https://weld.cdi-spec.org/">https://weld.cdi-spec.org/</a></li>
<li><a href="https://www.journaldev.com/2763/java-8-functional-interfaces">https://www.journaldev.com/2763/java-8-functional-interfaces</a></li>
<li><a href="https://www.journaldev.com/592/java-try-with-resources">https://www.journaldev.com/592/java-try-with-resources</a></li>
<li><a href="https://www.journaldev.com/2167/java-exception-interview-questions-and-answers">https://www.journaldev.com/2167/java-exception-interview-questions-and-answers</a></li>
<li><a href="https://tools.ietf.org/html/rfc6749#section-3.3">https://tools.ietf.org/html/rfc6749#section-3.3</a></li>
<li><a href="https://www.oauth.com/oauth2-servers/scope/defining-scopes/">https://www.oauth.com/oauth2-servers/scope/defining-scopes/</a></li>
<li><a href="https://docs.apigee.com/api-platform/security/oauth/working-scopes">https://docs.apigee.com/api-platform/security/oauth/working-scopes</a></li>
<li><a href="https://developer.okta.com/blog/2017/07/25/oidc-primer-part-1">https://developer.okta.com/blog/2017/07/25/oidc-primer-part-1</a></li>
<li><a href="https://brandur.org/oauth-scope">https://brandur.org/oauth-scope</a></li>
<li><a href="https://oauth.net/2/scope/">https://oauth.net/2/scope/</a></li>
<li><a href="https://auth0.com/docs/authorization/which-oauth-2-0-flow-should-i-use">https://auth0.com/docs/authorization/which-oauth-2-0-flow-should-i-use</a></li>
<li><a href="https://cloudinit.readthedocs.io/en/latest/topics/availability.html">https://cloudinit.readthedocs.io/en/latest/topics/availability.html</a></li>
<li><a href="https://en.wikipedia.org/wiki/ACID">https://en.wikipedia.org/wiki/ACID</a></li>
<li><a href="http://shiroyasha.io/transaction-isolation-levels-in-postgresql.html">http://shiroyasha.io/transaction-isolation-levels-in-postgresql.html</a></li>
<li><a href="https://stackoverflow.com/questions/13647604/isolation-levels-in-oracle">https://stackoverflow.com/questions/13647604/isolation-levels-in-oracle</a></li>
<li><a href="https://docs.oracle.com/cd/E19830-01/819-4721/beamv/index.html">https://docs.oracle.com/cd/E19830-01/819-4721/beamv/index.html</a></li>
<li><a href="https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#CIDR_notation">https://en.wikipedia.org/wiki/Classless_Inter-Domain_Routing#CIDR_notation</a></li>
<li><a href="https://www.codecademy.com/articles/what-is-cors">https://www.codecademy.com/articles/what-is-cors</a></li>
<li><a href="https://www.javatpoint.com/html-interview-questions">https://www.javatpoint.com/html-interview-questions</a></li>
<li><a href="https://github.com/IdentityModel/oidc-client-js/blob/dev/jsrsasign/dist/jsrsasign.js">https://github.com/IdentityModel/oidc-client-js/blob/dev/jsrsasign/dist/jsrsasign.js</a></li>
<li><a href="https://snyk.io/vuln/npm:jsrsasign@8.0.12">https://snyk.io/vuln/npm:jsrsasign@8.0.12</a></li>
<li><a href="https://www.mongodb.com/cloud/atlas">https://www.mongodb.com/cloud/atlas</a></li>
<li><a href="https://tools.ietf.org/id/draft-ietf-httpbis-rfc6265bis-03.html">https://tools.ietf.org/id/draft-ietf-httpbis-rfc6265bis-03.html</a></li>
<li><a href="https://web.dev/samesite-cookies-explained/">https://web.dev/samesite-cookies-explained/</a></li>
<li><a href="https://cloud.google.com/stackdriver/pricing#pricing_examples_2">https://cloud.google.com/stackdriver/pricing#pricing_examples_2</a></li>
<li><a href="https://nativecloud.dev/cnn-2020-21/">https://nativecloud.dev/cnn-2020-21/</a></li>
<li><a href="https://k3d.io/">https://k3d.io/</a></li>
<li><a href="https://www.reddit.com/r/kubernetes/comments/be0415/k3s_minikube_or_microk8s/">https://www.reddit.com/r/kubernetes/comments/be0415/k3s_minikube_or_microk8s/</a></li>
<li><a href="https://helm.sh/docs/topics/charts/#helm">https://helm.sh/docs/topics/charts/#helm</a></li>
<li><a href="https://cloud.google.com/kubernetes-engine/docs/concepts/persistent-volumes">https://cloud.google.com/kubernetes-engine/docs/concepts/persistent-volumes</a></li>
<li><a href="https://aws.amazon.com/ec2/instance-types/">https://aws.amazon.com/ec2/instance-types/</a></li>
<li><a href="https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/instance-types.html">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/instance-types.html</a></li>
<li><a href="https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-regions-availability-zones.html">https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-regions-availability-zones.html</a></li>
<li><a href="https://aws.amazon.com/cli/">https://aws.amazon.com/cli/</a></li>
<li><a href="https://martinfowler.com/articles/evodb.html">https://martinfowler.com/articles/evodb.html</a></li>
<li><a href="https://github.com/IdentityModel/oidc-client-js">https://github.com/IdentityModel/oidc-client-js</a></li>
<li><a href="https://www.baeldung.com/java-equals-hashcode-contracts">https://www.baeldung.com/java-equals-hashcode-contracts</a></li>
<li><a href="https://gethue.com/">https://gethue.com/</a></li>
<li><a href="https://en.wikipedia.org/wiki/Apache_Hadoop">https://en.wikipedia.org/wiki/Apache_Hadoop</a></li>
<li><a href="https://spark.apache.org/">https://spark.apache.org/</a></li>
<li><a href="https://hive.apache.org/">https://hive.apache.org/</a></li>
<li><a href="https://hbase.apache.org/">https://hbase.apache.org/</a></li>
<li></li>

<li></li>

<li></li>

<li></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Richard Bouska</p>
<p class="date">Created: 2020-09-26 Sat 15:09</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
